import { useState, useMemo, useEffect, useRef } from "react";
import { loadState, saveState, mode, submitRegistration, loadRegistrations, removeRegistration } from "./storage.js";
import {
  Volume2, SlidersVertical, Phone, MessageCircle, Facebook, Instagram,
  CalendarDays, Users, Wallet, Link2, ChevronRight, X, Award, Copy, Check, Lock, Cloud, CloudOff,
} from "lucide-react";

// ─── ธีมสีตามโลโก้ ───────────────────────────────────────────
const BLUE = "#1656D6";
const BLUE_DARK = "#0F44B0";
const BLUE_SOFT = "#E9F0FE";
const INK = "#10254F";

const font = { fontFamily: "'Prompt', 'Kanit', 'Sarabun', system-ui, sans-serif" };

// ─── ข้อมูลจริงจากไฟล์ Excel (ทุกแท็บ) ────────────────────────────
// students: [id, ชื่อเล่น, ชื่อจริง, นามสกุล, tel, line, fb, ig]
// courses:  [ชื่อคอร์ส, ราคา, จำนวนครั้ง, ค่าสอนต่อคาบ]
// purchases:[id, วันที่ซื้อ, คอร์ส, ราคา, สถานะโอน, วันเริ่ม, ครู, รวมครั้ง, เวลา]
// sessions: [id, วันที่, เวลา, ครู, คอร์ส, ครั้งที่, รวม, สถานะ, คลาส, คะแนน, หมายเหตุ]
const DATA = {"students":[["001","ตะวัน","ธีรภัทร์","ข","","byninglapat2","",""],["002","กู๊ด","จตุพร","โฆษิตานนท์","","good11432","",""],["003","อะตอม","มนต์ชยา","ก","","atom7654","",""],["004","เอิร์ธ","ณัฐรัฐ","","061-212-9393","061-212-9393","",""],["005","ฟา","เนติวุฒิ","","094-587-2479","_ntw.s","",""],["006","อาชว์","อาชว์","","086-529-7788","gspiz","",""],["007","แน็ก","ชลากร","เพียงแก้ว","080-031-3398","nackchalakorn","",""],["008","เปรม","เปรมณัช","เทียมเมือง","095-837-9816","prem12345672","",""],["009","เนย","ญาณิศา","คีรีวรรณ์","080-913-0993","nyk81206","",""],["010","บิว","ณัฐ","แม้นเจริญ","061-451-5526","Bew225","Knat Mancharoen",""],["011","ยศ","สมยศ","ไพเราะ","063-297-3779","ank23456792","",""],["012","ไอซ์","วีรินทร์","เมฆพัฒน์","098-670-7683","veerin00","",""],["013","บอส","ภัคคพงศ์","สุวรรณประเสริฐ","0634152550","bossa0202","Phakkaphong Suw",""],["014","ไฮด์","ณัฐภัทร","เจริญพงศ์ถาวร","095-559-6952","25hours.","",""],["015","VJ","ชวัลวิทย์","พงษ์พันธุ์","099-110-2200","Vj34971","Chawanwit phongphan",""],["016","โฮจุน","เมธานันท์","ตันนารักษ์","064-632-3417","646323417","Methanan Tannarak",""],["017","ภีม","ฉัทชนัน","มันทะ","","kdckdk123","Chatchanun munta",""],["018","มินท์","พันทิวา","เกษตรรุ่งเรือง","","cccc_2552","ideo q chula samyan",""],["020","แอม","ธรรมรักษ์","อูปคำ","092-963-1026","","Thammrak Oupakham",""],["021","พอใจ","บุญญาภา","รัตนพิเศษ","","pj2007pj","","pjpppporjai"],["022","ปลื้ม","ปิติภัทร","ปานโบ","","Plumeza007","",""],["023","อาร์ต","อิทธิกร","","062-145-9297","","art09052550",""],["024","ภีม","ภัทรพล","ภาคสุชล","0803257993","pheempeem","pheempeem",""],["025","โปเต้","พีรพัฒน์","สัชชานนท์","0661650002","@potaeuuu","",""],["026","ยูโร","ณัฐภัทร","สุวรรณเกิด","063 923 9610","rov.com.eurk","",""],["027","ติน","ตฤณ","ไตรสุทธิ์","0991951493","991951493","",""],["028","พุทธ","พักตร์พุทธ","รัชชระเสวี","0971848008","putt.beetle","",""],["029","ปิ่น","ปิ่น","Busarapirat","991275005","","pin Busarapirat",""],["030","พิชญ์","พิชญาภา","กำจัดศัตรูพ่าย","971866208","","",""],["031","กุลนิภาณัฏฐ์","กุลนิภาณัฏฐ์","พินธุรักษ์","808896944","carrotnotcabbage","",""],["032","โม","ธรรมรุจ","ปิยมาตย์","896159526","thammarujpiyamat","Thammaruj Piyamat",""],["033","ปุน","คุณานนต์","จาบรรณ์","884423787","Kunanon Jaban","884423787",""],["034","ปิ่น","ปิ่นลดา","แก่นนาคำ","","Pinlada2550","",""],["035","บาส","ณัฐกฤตา","กันเกตุ","","natkritta1209","Natthakrita kanked","nattjzqn"],["036","เฟิม","วีรภัทร","ลิ่ววิริยกุล","","firm_wrp","Firm Weerapat","weerapatfirm"],["037","ม่อน","ม่อน","ม่อน","","","","Mistiquer"],["038","เจี้ย","ศุภศรณ์","อ่างมณีกุล","093-190-0441","","","kiruellaa"],["039","กาย","นวพล","ประวันรัมย์","","once_333","",""],["040","เพลิน","จิดาภา","อังกสิทธิ์","982808879","plearn22","",""],["041","อะตอม","สิรวิชญ์","พิชิตเมธากุล","828885601","atomsecretz","Sirawit Pichitmaetakun",""],["042","ฉัทชนัน","ฉัทชนัน","มันทะ","","kdckdk123","Chatchanun Munta","sxzq_xal"],["043","ปัญ","สุศิษฏิ์","เติมวิริยะกุล","800684888","https://line.me/ti/p/veW6sjLeNS","","susith_termviriyakul"],["044","คุณ","ปลาบปลื้ม","คุณปลื้ม","881441499","khunkhun04","Plarbpluem Khunpluem",""],["045","นภ","นภ","ณ ถลาง","","noppie007","Nop Na Thalang","nopnopnopnopnopp"],["046","อิทธิกร","อิทธิกร","ชณหวรชัย","","peter713","Otto Ittikorn",""],["047","ฟู่","กิตติภพ","อร่ามเรือง","","","Kittiphop Foulong","xiii_iii_kittiphop"],["048","โซแปง","โซแปง","โซแปง","868078008","chopangvvv","",""],["049","ปีกุน","ชุติกาญจน์","สารวานิชพิทักษ์","","peekooncs","","peekoonshi"],["050","ชินวิช","ชินวิช","บุญช่วยเหลือ","","","","ohm"],["051","คณิน","คณิน","ญนุช","","cusycuss","",""],["052","ต้นกล้า","กล้าณรงค์","จันทร์พานิชย์","0902882714","902882714","",""],["053","สิทธิกร","สิทธิกร","โคทวี","0988581224","988581224","Sittigonbom",""],["054","ปอ","สิรวิชญ์","อรรถเวทิน","0839960067","opor9944","Sirawit Atthawethin",""],["055","ธนวัฒน์","ธนวัฒน์","ญาณโกมุท","0863950499","","",""],["056","มิกซ์","ณภัทร","ศรีภุมมา","0984822279","","napat seepumma",""],["057","เอม","จิดาภา","ทัสฐาน","","aim.jidapa","","koon.nongaim"],["058","ชยังกูณ","ชยังกูณ","ศิริพ่วงพิพัฒน์","","Goaety","Chayangkul siripuangpipat","jixchm"],["059","คิว","Piyawat","Siripongsumpun","","iq_robert","piyawat siripongsumpun","undecember.wav"],["060","อชิตะ","อชิตะ","ศรีหมอก","0838611145","","","chita_08"],["061","นิง","นิง","นิง","","morningburiram","ณธีพัฒน์ ชนะอัยยรัชต์",""],["062","ซี","พัทธนดนย์","บุญธรรม","0648649914","","","seapattana"],["063","หฤษฎ์","หฤษฎ์","ฐิติพงษ์พันธ์","0623366347","","",""],["064","การ์ฟิล","ทินภัทร","กองวงศ์","","gafill0940","Tinnaphat kongwong",""],["066","ปวริศา","ปวริศา","ด้วงสงค์","0633185563","","",""],["067","ภู","สิรคม","อ่องรัตนา","0894428095","phukaprae","",""],["068","พล","อนันตชัย","อาษาพล","0967259434","25410906","anantachai arsapon",""],["069","ฟร้องซ์","พรเวทย์","คณาลัยวุฒิพงศ์","0945471222","0945471222","",""],["070","น้ำมน","พุทธิรัตน์","บุญร่วม","0919355035","b.puttirat","พุทธิรัตน์ บุญร่วม","nammon_puttirat"],["071","ฟอเฟรน","จิรัชญา","เฟื่องทิพย์","0929475242","phbb.","",""],["072","โบ๊ท","ภูธเนศ","แสนงาม","","","Boat Sanngam","boatsanza"],["073","ต้น","พระนาย","บุญสุวรรณ","0895858428","0895858428","",""],["074","สีไม้","จิรัฏฐ์","ไฝจันทร์ทอง","","myth1cal38","Seemai Faichantong",""],["075","กราฟฟิค","ธัญรดา","จันทรี","","0626192211","Thanrada Juntharee","graphicjtr"],["076","ทาม","Siyapa","Prakitrittanon","0615201659","timemu","","timemumee"],["077","ลูน","สันติอโนทัย","สันติอโนทัย","","oei.lun","","iiilune._"],["078","ตี้","ณภัทร","ญาณสิทธิ","","1960.","",""],["079","บอล","นวพล","จันทร์ทรัพย์","","0809493523","Nawaphon Chansap",""],["080","เคลียส์","ศุภพงศ์","กาบตุ้ม","","Clear.k","Supapong Kabtoom",""],["081","ดัชซี่","จิรเดช","แฟงจะโปะ","","kk12345677oo","Jiradech Fangjapho","jeng_dutmm"],["082","อาร์กอน","พงศ์พิสุทธิ์","ตูมพิทักษ์","0968600011","","",""],["083","กล้า","นภัสรพี","เรือนสิทธิ์","","ftgfdas","Naphatraphe Rueansit","k14x_a"],["084","ออกัส","กรินทร์","สร้อยสน","0641938864","augustkrin","Krin soison",""],["085","เชณ","อภิภู","ภูวกุล","","apipubhuwakul","",""],["086","เบญ","ศรรังศิกรณ์","ภัทรมณีชาติ","","mark.haha","",""],["087","นาโน","เสณณ์","เสนภักดี","","ppkujoxd","Namo Seanpakdee","snx.namo"],["088","โบอิ้ง","เคียงฟ้า","ศิริมานะชัย","0948710505","","Kiengfah Sirimanachai",""],["089","อิง","ปาณิสรา","บุญชัย","","52436891756432156529","panisara boonchai","toolazy.topractice"],["090","ดิฟ","กฤศพัฒ","ศักดิ์ทอง","","drift08","Kristsapat Sakthong","vxlkris"],["091","ดูม","พีรวิทย์","จิตการุณ","","271255","Peerawit Jitkarun",""],["092","ไซม่อน","ภีมลภัสสร์","เทียมทองใบ","","sa50s","SimonKz Thiemthongbai","slaxhxckxr_"],["093","โฟกัส","จินันท์","ฒิเลาหพันธ์","","focus23793","","fo_dgfp"],["094","ปาร์ค","นัฏฐวัฒน์","อาชหาว","","0635908615","Nutthawat Ardhaw","pdsntx._"],["095","กื","กีรยต","เดชากรณ์","","iggygw","Keerayote Dechakorn",""],["096","ฮูโต๋","ญาดา","สัจจากุล","0954181007","","",""],["097","นนท์","อดิศร","วชิรพงศ์","0871188221","adisorn_non","Adisorn Wachiraphong","non.adisorn"],["098","พี","พชิรา","หร่องบุตรศรี","0958512184","noina_pachira","","@draftp_"],["099","เจ","พัทธพล","องอาจพันธุ์ชัย","","","Pattapon Ongarjphanchai","sheruminator"],["100","ปิ่น","ผุสราภิรัฐ","หอรุ่งเรือง","0991275005","busarapirat","","pinbinto"],["101","คลาสกลุ่ม","","","","","",""],["102","ภัทร","ณัฐพล","เพชรน้อย","0972600281","0972600281","",""],["103","นะโม","เสณณ์","เสนภักดี","0618285588","ppkujoxd","Namoseanpakdee","snx.namo"],["104","นาย","วัชริศ","ศรีพล","0985292025","0985292025","Naay Watcharich","9aayis"],["105","ปังปัง","วีระพันธ์","โลห์ศิริ","0885807518","","",""],["106","สปาย","ณัฐวุฒิ​","เเซ่ลิ้ม","0802283090​","taeyangbruh","",""],["107","เอม","พิมชุมพล","เจริญ","0815259190","","",""],["108","โม","ทยิดา","บำเพ็ญผล","0615843329","","",""],["109","กัส","บรรณต","ไอยรารัตน์","0639848521","","",""],["110","อชิ","เฉิน จื้อ","หว่อง","0944896419","","",""],["111","ดิว","ปรีชาพล","เหลืองช่วยโชค","0830705290","","",""],["112","โอ๊ต","ปัฐวีณ์กร","พิริยโยธากุล","0647147879","oatoat2552","pattaweekorn_oat","pattaweekorn_oat"],["113","ฟอง","ฟองนวล","ชาญปรีชา","","kim_123.4","ไม่มีค่ะ","f0nxg._"],["114","เซียน","จันทรวิทย์","ลิ้มเจริญ","0927512551","iamchantharawizz","","https://www.instagram.com/chantharawiz?igsh=cjdsM25yYXN0d2tz"],["115","คิว","ชุติพนธ์","พิเชษฐพันธ์","0819836933","quechutipon","Chutipon Pichetpun","q_chutipon"],["116","ป๊อปปี้","รตนกร","ปะนะพุตโต","949842789.0","agane_ol","",""],["117","เกียร์","วลัยพรรณ","ศิริวิเชียร","0985694799","nogearh","",""],["118","กานต์","เอกวิชญ์","เรืองจรูญ","0853986318","karnoboe@gmail.com","Kaan ekkawit",""],["119","โอ๊ต","ปัฐวีณ์กร","พิริยโยธากุล","0647147879","oatoat2552","pattaweekorn_oat",""],["120","ไตเติ้ล","พัทธวัช","สัจจาภรณ์รัตน์","0806429996","tairoruxd","Pattawat Title",""],["121","ชัวร์","รัฐพล","วัฒนรังสรรค์","0951693987","0951693987","Erus trator",""],["122","ปอร์โต้","ชลณัฐ","อยู่เย็น","","chonlanat__","Chonlanat yooyen","Chonlanatt__"],["123","คลาสกลุ่ม 2","คลาสกลุ่ม 2","คลาสกลุ่ม 2","ชาย","ชาย","ชาย",""],["124","ไตเติ้ล","พัทธวัช","สัจจาภรณ์รัตน์","0806429996","tairoruxd","Pattawat Title",""],["125","ปอร์โต้","ชลณัฐ","อยู่เย็น","0646587743","chonlanat__","Chonlanat yooyen","Chonlanatt__"],["126","มินตัน","เอกฤกษ์","บุตรหงษ์","0659211464","❤️Minton❤️","Minton Minton Min","NxmeleSs"],["127","โฟร์ธ","ธนภัทร","ภาคินพณิชย์กุล","0939493966","4fourth4","",""],["128","บอย","ศุภวิชญ์","สรมณาพงศ์","086 644 6695","jit0866446695","Jitkunut","ไม่มี"],["129","ซอน","ยศพนธ์","โสภางกูล","","","",""],["130","เนิ้ด","พรชิตา","โอภาสสุวรรณ","0826860045","0826860045","NE RD","21thpnerd"]],"courses":[["ติวเทคโนโลยี",8500.0,10,300.0],["ทำเพลง 1",8900.0,8,400.0],["ทำเพลง half",3950.0,4,400.0],["ติวเทคโนโลยี กลุ่ม",7500.0,10,400.0],["ติวเทคโนโลยี กลุ่ม ลด 5%",7125.0,10,400.0],["ติวเทคโนโลยี 2 ชม.",8500.0,5,500.0],["ทำเพลง",7900.0,10,400.0],["Mix & Mastering",7900.0,10,400.0],["ติวทำเพลง",7900.0,10,400.0],["ติวทำเพลง กลุ่ม",5900.0,10,500.0],["ติวเทคโนโลยี ใหม่",4500.0,5,300.0],["ติวเทคโนโลยี รวมพิเศษ",0,0,400.0],["Mix & Mastering ใหม่",3500.0,4,400.0],["ทำเพลง ใหม่",3500.0,4,400.0],["ทำเพลง Advance",3900.0,4,500.0]],"teachers":[["Aoujai","Active"],["Jingle","Active"],["Peem","Active"],["Miu","Active"],["Guy","Active"],["Japan","Active"]],"purchases":[["001","2024-10-26","ทำเพลง half",3950,"Confirmed","2024-10-19","Aoujai",4,"10:00"],["002","2024-10-18","ติวเทคโนโลยี",8500,"Confirmed","2024-10-18","Aoujai",10,"22:00"],["003","2024-10-19","ติวเทคโนโลยี",8500,"Confirmed","2024-10-18","Aoujai",10,"19:00"],["004","2024-10-31","ติวเทคโนโลยี",8500,"Confirmed","2024-11-03","Jingle",10,"20:00"],["005","2024-11-03","ติวเทคโนโลยี กลุ่ม",7500,"Confirmed","2024-11-05","Aoujai",10,"19:00"],["006","2024-11-04","ติวเทคโนโลยี กลุ่ม ลด 5%",7125,"Confirmed","2024-11-05","Aoujai",10,"19:00"],["007","2024-11-16","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2024-11-09","Aoujai",5,"17:00"],["008","2024-11-13","ติวเทคโนโลยี กลุ่ม",7500,"Confirmed","2024-11-12","Aoujai",10,"19:00"],["009","2024-11-20","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2024-11-21","Peem",5,"19:00"],["010","2024-12-09","ติวเทคโนโลยี",8500,"Confirmed","2024-12-02","Aoujai",10,"18:00"],["011","2024-12-13","ติวเทคโนโลยี",0,"Confirmed","2024-12-13","Aoujai",10,""],["012","","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2025-01-03","Aoujai",5,"18:00"],["013","2025-01-06","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2025-01-06","Aoujai",5,"19:00"],["014","2025-01-11","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2025-01-11","Aoujai",5,"15:00"],["015","2025-01-15","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2025-01-15","Aoujai",5,""],["016","2025-01-20","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2025-01-20","Aoujai",5,"19:00"],["017","2025-01-27","ติวเทคโนโลยี",8500,"Confirmed","2025-01-27","Aoujai",10,"18:00"],["018","2025-01-31","ติวเทคโนโลยี",8500,"Confirmed","2025-01-31","Aoujai",10,"18:00"],["020","2025-02-11","ติวเทคโนโลยี",8500,"Confirmed","2025-02-11","Aoujai",10,"18:00"],["021","2025-02-07","ติวเทคโนโลยี",8500,"Confirmed","2025-02-07","Aoujai",10,"17:00"],["022","2025-02-12","ติวเทคโนโลยี",8500,"Confirmed","2025-02-15","Aoujai",10,"19:00"],["023","2025-02-22","ติวเทคโนโลยี",8500,"Confirmed","2025-02-22","Aoujai",10,"11:00"],["024","2025-03-16","ติวเทคโนโลยี",8500,"NYC","2025-03-16","Aoujai",10,"18:00"],["025","2025-03-06","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2025-03-16","Aoujai",5,""],["026","2025-03-23","ติวเทคโนโลยี",8500,"Confirmed","2025-03-23","Aoujai",10,""],["027","2025-04-11","ติวเทคโนโลยี",8500,"Confirmed","2025-04-11","Aoujai",10,"19:00"],["028","2025-04-26","ติวเทคโนโลยี",8500,"Confirmed","2025-04-26","Aoujai",10,"10:00"],["029","","ติวเทคโนโลยี",8500,"Confirmed","2025-04-29","Aoujai",10,"19:00"],["030","2025-05-03","ติวเทคโนโลยี",8500,"Confirmed","2025-04-23","Aoujai",10,"18:00"],["031","2025-05-03","ติวเทคโนโลยี",8500,"Confirmed","2025-04-28","Aoujai",10,""],["032","2025-05-12","ติวเทคโนโลยี",8500,"Confirmed","2025-05-12","Aoujai",10,"20:00"],["033","2025-05-14","ติวเทคโนโลยี",8500,"Confirmed","2025-05-14","Aoujai",10,"20:00"],["034","2025-05-15","ติวเทคโนโลยี",8500,"Confirmed","2025-05-13","Aoujai",10,"19:00"],["035","2025-05-15","ติวเทคโนโลยี",8500,"Confirmed","2025-05-13","Aoujai",10,"20:00"],["036","2025-05-15","ติวเทคโนโลยี",8500,"Confirmed","2025-05-15","Aoujai",10,"18:00"],["037","2025-05-21","ติวเทคโนโลยี",8500,"Confirmed","2025-05-28","Aoujai",10,"19:00"],["038","2025-06-05","ติวเทคโนโลยี",8500,"Confirmed","2025-06-05","Aoujai",10,"19:00"],["039","2025-06-09","ทำเพลง",7900,"Confirmed","2025-06-06","Aoujai",10,"17:00"],["040","2025-06-12","ติวเทคโนโลยี",8500,"Confirmed","2025-06-12","Miu",10,"19:00"],["041","2025-06-15","ทำเพลง",7900,"Confirmed","2025-06-12","Aoujai",10,"20:00"],["042","2025-06-16","ทำเพลง",7900,"Confirmed","2025-06-18","Aoujai",10,"20:00"],["018","2025-06-22","ทำเพลง",7900,"Confirmed","2025-05-25","Aoujai",10,"15:00"],["043","2025-06-26","ติวเทคโนโลยี",8500,"Confirmed","2025-06-30","Aoujai",10,"18:00"],["044","2025-06-26","ติวเทคโนโลยี",8500,"Confirmed","2025-06-27","Aoujai",10,"18:00"],["045","2025-06-30","ทำเพลง",7900,"Confirmed","2025-07-06","Jingle",10,"11:00"],["046","2025-06-29","ทำเพลง",7900,"Confirmed","2025-07-05","Aoujai",10,"15:00"],["027","2025-07-04","ทำเพลง",7900,"Confirmed","2025-07-12","Aoujai",10,"17:00"],["047","2025-07-06","ติวเทคโนโลยี",8500,"Confirmed","2025-07-06","Aoujai",10,"20:00"],["048","2025-07-10","ติวเทคโนโลยี",8500,"Confirmed","2025-07-30","Aoujai",10,"18:00"],["033","2025-07-11","ทำเพลง",7900,"Confirmed","2025-07-11","Guy",10,"23:00"],["049","2025-07-14","ติวเทคโนโลยี",8500,"Confirmed","2025-07-17","Aoujai",10,"18:00"],["050","2025-07-13","ทำเพลง",7900,"Confirmed","2025-07-13","Aoujai",10,"20:00"],["051","2025-07-17","Mix & Mastering",7900,"Confirmed","2025-07-21","Aoujai",10,"20:00"],["052","2025-07-22","ทำเพลง",7900,"Confirmed","2025-07-25","Aoujai",10,"20:00"],["053","2025-07-23","Mix & Mastering",7900,"Confirmed","2025-07-31","Aoujai",10,"19:00"],["054","2025-07-24","ติวเทคโนโลยี",8500,"Confirmed","2025-07-26","Miu",10,"20:00"],["055","2025-07-24","ทำเพลง",7900,"Confirmed","2025-08-02","Aoujai",10,"17:00"],["055","2025-07-24","ติวเทคโนโลยี",8500,"Confirmed","2025-07-27","Jingle",10,"17:00"],["056","2025-08-05","ติวเทคโนโลยี",8500,"Confirmed","2025-08-05","Aoujai",10,"20:00"],["057","2025-08-07","ทำเพลง",7900,"Confirmed","2025-08-25","Guy",10,"20:00"],["058","2025-08-08","ติวเทคโนโลยี",8500,"Confirmed","2025-08-09","Aoujai",10,"20:00"],["059","2025-08-09","Mix & Mastering",7900,"Confirmed","2025-08-16","Aoujai",10,"13:00"],["060","2025-08-16","ติวเทคโนโลยี",8500,"Confirmed","2025-08-19","Miu",10,"20:00"],["049","2025-08-21","ทำเพลง",7900,"Confirmed","2025-08-29","Aoujai",10,"19:00"],["028","2025-08-25","ติวทำเพลง",7900,"Confirmed","2025-09-01","Jingle",10,"19:00"],["043","2025-08-25","ติวทำเพลง",7900,"Confirmed","2025-08-25","Peem",10,"19:00"],["061","2025-08-25","ติวเทคโนโลยี ใหม่",4500,"Confirmed","2025-08-26","Aoujai",5,"19:00"],["031","2025-08-25","ติวทำเพลง",7900,"Confirmed","2025-09-03","Aoujai",10,"21:00"],["035","2025-08-25","ติวทำเพลง กลุ่ม",5900,"Confirmed","2025-09-01","Guy",10,"20:00"],["057","2025-08-25","ติวทำเพลง",7900,"Confirmed","2025-09-01","Guy",10,"20:00"],["034","2025-08-25","ติวทำเพลง กลุ่ม",5900,"Confirmed","2025-09-01","Guy",10,"20:00"],["047","2025-08-25","ติวทำเพลง",7900,"Confirmed","2025-09-03","Guy",10,"19:00"],["060","2025-08-25","ติวทำเพลง",7900,"Confirmed","2025-09-02","Guy",10,"19:00"],["058","2025-08-25","ติวทำเพลง กลุ่ม",5900,"Confirmed","2025-09-01","Guy",10,"20:00"],["040","2025-08-25","ติวทำเพลง กลุ่ม",5900,"Confirmed","2025-09-01","Guy",10,"20:00"],["044","2025-08-25","ติวทำเพลง",7900,"Confirmed","2025-09-01","Peem",10,"19:00"],["032","2025-08-26","ติวทำเพลง",7900,"Confirmed","2025-09-01","Jingle",10,"20:00"],["062","2025-08-26","ติวเทคโนโลยี ใหม่",4500,"Confirmed","2025-09-02","Miu",5,"19:00"],["062","2025-08-26","ติวทำเพลง",7900,"Confirmed","2025-09-01","Peem",10,"20:00"],["063","2025-08-26","ติวเทคโนโลยี ใหม่",4500,"Confirmed","2025-08-26","Aoujai",5,"19:00"],["064","2025-08-28","Mix & Mastering",7900,"Confirmed","2025-09-04","Jingle",10,"18:00"],["066","2025-09-02","ติวเทคโนโลยี",8500,"Confirmed","2025-09-02","Aoujai",10,"18:00"],["024","2025-09-05","ติวทำเพลง",7900,"Confirmed","2025-09-05","Guy",10,"20:00"],["048","2025-09-02","ติวทำเพลง",7900,"Confirmed","2025-09-03","Guy",10,"13:00"],["067","2025-09-24","ติวเทคโนโลยี ใหม่",4500,"Confirmed","2025-09-03","Aoujai",5,""],["068","2025-09-29","Mix & Mastering",7900,"Confirmed","2025-09-29","Aoujai",10,"18:00"],["069","2025-09-30","ทำเพลง",7900,"Confirmed","2025-10-02","Aoujai",10,"20:00"],["067","2025-10-04","ทำเพลง",7900,"Confirmed","2025-10-08","Aoujai",10,"18:00"],["070","2025-10-05","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2025-10-03","Aoujai",5,"20:00"],["071","2025-10-11","ทำเพลง",7900,"Confirmed","2025-10-11","Aoujai",10,"11:00"],["024","2025-10-06","ติวเทคโนโลยี ใหม่",4500,"Confirmed","2025-10-06","Guy",5,"18:00"],["072","2025-10-10","ติวทำเพลง",7900,"Confirmed","2025-10-15","Aoujai",10,"21:00"],["073","2025-10-11","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2025-10-11","Peem",5,"18:00"],["036","2025-10-13","ทำเพลง",7900,"Confirmed","2025-10-13","Aoujai",10,"08:00"],["045","2025-10-19","ทำเพลง",7900,"Confirmed","2025-10-19","Aoujai",10,"11:00"],["074","2025-10-24","ติวทำเพลง",7900,"Confirmed","2025-10-27","Aoujai",10,"19:00"],["075","2025-10-24","ติวทำเพลง",7900,"Confirmed","2025-10-27","Guy",10,"19:00"],["075","2025-10-24","ติวเทคโนโลยี",8500,"Confirmed","2025-10-29","Guy",10,"19:00"],["076","2025-10-30","ทำเพลง",7900,"Confirmed","2025-10-30","Aoujai",10,"21:00"],["077","2025-10-31","ติวเทคโนโลยี",8500,"Confirmed","2025-10-31","Aoujai",10,"20:00"],["078","2025-11-05","ติวทำเพลง",7900,"Confirmed","2025-11-05","Peem",10,"21:00"],["079","2025-11-29","ติวเทคโนโลยี",8500,"Confirmed","2025-11-30","Aoujai",10,"14:00"],["080","2025-11-29","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2025-12-01","Peem",5,""],["081","2025-12-13","Mix & Mastering",7900,"Confirmed","2025-12-20","Aoujai",10,"12:00"],["079","2025-12-15","ติวทำเพลง",7900,"Confirmed","2025-12-15","Aoujai",10,"18:00"],["082","2026-01-06","ติวเทคโนโลยี",8500,"Confirmed","2026-01-05","Aoujai",10,"19:00"],["082","2026-01-10","ทำเพลง 1",8900,"Confirmed","2026-01-10","Aoujai",8,"19:00"],["083","2026-01-09","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2026-01-07","Peem",5,"20:00"],["084","2026-01-19","ทำเพลง",7900,"Confirmed","2026-01-19","Aoujai",10,"19:00"],["085","2026-01-19","ทำเพลง",7900,"Confirmed","2026-01-10","Aoujai",10,"19:00"],["086","2026-01-22","ติวทำเพลง",7900,"Confirmed","2026-01-22","Aoujai",10,"18:00"],["087","2026-01-23","ติวทำเพลง",7900,"Confirmed","2026-01-23","Aoujai",10,"19:00"],["088","2026-01-29","ติวเทคโนโลยี",8500,"Confirmed","2026-02-04","Aoujai",10,"18:00"],["089","2026-02-01","ติวทำเพลง",7900,"Confirmed","2026-02-03","Aoujai",10,"20:00"],["090","2026-02-01","ทำเพลง",7900,"Confirmed","2026-02-03","Aoujai",10,"19:00"],["091","2026-02-13","ทำเพลง",7900,"Confirmed","2026-02-04","Aoujai",10,"18:00"],["072","2026-01-20","ทำเพลง",7900,"Confirmed","2026-01-20","Guy",10,"19:00"],["092","2026-03-02","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2026-03-02","Aoujai",5,"19:00"],["093","2026-03-11","ทำเพลง",7900,"Confirmed","2026-03-07","Guy",10,"18:00"],["094","2026-03-12","ทำเพลง",7900,"Confirmed","2026-03-12","Aoujai",10,"20:00"],["095","2026-03-17","ทำเพลง",7900,"Confirmed","2026-03-21","Guy",10,"13:00"],["043","2026-03-23","Mix & Mastering",7900,"Confirmed","2026-03-26","Aoujai",10,"18:00"],["096","2026-03-25","ทำเพลง",7900,"Confirmed","2026-03-18","Aoujai",10,"18:00"],["097","2026-04-04","ทำเพลง",7900,"Confirmed","2026-03-28","Aoujai",10,"11:00"],["098","2026-05-11","ทำเพลง",7900,"Confirmed","2026-05-11","Aoujai",10,"20:00"],["099","2026-05-14","ทำเพลง",7900,"Confirmed","2026-05-14","Aoujai",10,"20:00"],["100","2026-06-12","Mix & Mastering ใหม่",3500,"Confirmed","2026-06-12","Aoujai",4,"19:00"],["062","2026-06-09","ทำเพลง",7900,"Confirmed","2026-06-09","Aoujai",10,"19:00"],["062","2026-06-09","ติวเทคโนโลยี",8500,"Confirmed","2026-06-09","Aoujai",10,"19:00"],["101","2026-06-07","ติวทำเพลง",7900,"Confirmed","2026-06-11","Aoujai",10,"19:00"],["102","2026-06-07","Mix & Mastering ใหม่",3500,"Confirmed","2026-06-14","Guy",4,"17:00"],["103","2026-06-07","ติวเทคโนโลยี",8500,"Confirmed","2026-06-09","Aoujai",10,"19:00"],["104","2026-06-08","ติวเทคโนโลยี",8500,"Confirmed","2026-06-12","Peem",10,"19:00"],["090","2026-06-12","ติวเทคโนโลยี",8500,"Confirmed","2026-06-12","Aoujai",10,"20:00"],["105","2026-06-13","ติวทำเพลง",7900,"Confirmed","2026-06-07","Aoujai",10,"11:00"],["106","2026-06-17","ทำเพลง ใหม่",3500,"Confirmed","2026-06-17","Aoujai",4,"19:00"],["107","2026-06-21","ทำเพลง",7900,"Confirmed","2026-06-14","Aoujai",10,"15:00"],["072","2026-06-21","ติวเทคโนโลยี",8500,"Confirmed","2026-06-14","Aoujai",10,"20:00"],["108","2026-06-27","ทำเพลง ใหม่",3500,"Confirmed","2026-06-27","Aoujai",4,"13:00"],["109","2026-06-29","ทำเพลง ใหม่",3500,"Confirmed","2026-06-29","Aoujai",4,"20:00"],["110","2026-07-12","ทำเพลง ใหม่",3500,"Confirmed","2026-07-12","Guy",4,"22:00"],["111","2026-07-15","ทำเพลง ใหม่",3500,"Confirmed","2026-07-15","Aoujai",4,"21:00"],["112","","ทำเพลง ใหม่",3500,"Confirmed","2026-08-02","Aoujai",4,"19:00"],["106","2026-07-22","ทำเพลง ใหม่",3500,"Confirmed","2026-07-22","Aoujai",4,""],["072","2026-08-26","ทำเพลง ใหม่",3500,"Confirmed","2026-07-26","Aoujai",4,""],["113","2026-08-08","ทำเพลง ใหม่",3500,"Confirmed","2026-08-08","Aoujai",4,"16:00"],["114","2026-08-10","ทำเพลง ใหม่",3500,"Confirmed","2026-08-17","Aoujai",4,"20:00"],["115","2026-08-15","ทำเพลง ใหม่",3500,"Confirmed","2026-08-15","Aoujai",4,"20:00"],["116","2026-08-19","ทำเพลง ใหม่",3500,"Confirmed","2026-08-19","Aoujai",4,"20:00"],["117","2026-08-22","ทำเพลง ใหม่",3500,"Confirmed","2026-08-22","Guy",4,"21:00"],["118","2026-08-16","ทำเพลง ใหม่",3500,"Confirmed","2026-08-17","Aoujai",4,"20:00"],["119","2026-08-16","ทำเพลง ใหม่",3500,"Confirmed","2026-08-16","Aoujai",4,"19:00"],["111","","ติวเทคโนโลยี ใหม่",4500,"Confirmed","","",5,""],["121","2026-08-22","ทำเพลง ใหม่",3500,"Confirmed","2026-08-22","Aoujai",4,"13:00"],["117","2026-08-30","ติวเทคโนโลยี",8500,"Confirmed","2026-08-30","Aoujai",10,"20:00"],["122","2026-08-27","ทำเพลง ใหม่",3500,"Confirmed","2026-08-27","Aoujai",4,"19:00"],["038","","",0,"","","",0,""],["123","2026-08-24","ติวเทคโนโลยี กลุ่ม",7500,"Confirmed","2026-08-28","Aoujai",10,"18:00"],["119","2026-08-30","ติวเทคโนโลยี",8500,"Confirmed","2026-08-30","Peem",10,"10:00"],["124","2026-08-24","ทำเพลง Advance",3900,"Confirmed","2026-08-23","Japan",4,"10:00"],["103","2026-08-25","ทำเพลง ใหม่",3500,"Confirmed","2026-08-25","Aoujai",4,"19:00"],["125","2026-08-29","ติวเทคโนโลยี 2 ชม.",8500,"Confirmed","2026-09-01","Peem",5,"19:00"],["126","2026-08-29","ติวเทคโนโลยี",8500,"Confirmed","2026-08-30","Aoujai",10,"17:00"],["125","2026-08-29","ทำเพลง ใหม่",3500,"Confirmed","2026-08-29","Aoujai",4,"20:00"],["104","2026-08-30","ทำเพลง ใหม่",3500,"Confirmed","2026-08-30","Aoujai",4,"13:00"],["098","2026-08-30","ติวเทคโนโลยี",8500,"Confirmed","2026-08-30","Aoujai",10,"14:00"],["127","2026-08-31","ทำเพลง 1",8900,"Confirmed","2026-09-17","Aoujai",8,"18:00"],["128","2026-08-31","ติวเทคโนโลยี",8500,"Confirmed","2026-09-01","Aoujai",10,"21:00"],["128","2026-09-01","ทำเพลง ใหม่",3500,"Confirmed","2026-09-06","Aoujai",4,"21:00"],["130","2026-08-26","ติวเทคโนโลยี",8500,"Confirmed","2026-08-26","Aoujai",10,""],["130","2026-09-12","ทำเพลง ใหม่",3500,"Confirmed","2026-09-12","Aoujai",4,"18:00"]],"sessions":[["001","2024-10-19","10:00","Aoujai","ทำเพลง half",1,4,"Present","เดี่ยว","",""],["001","2024-11-11","10:00","Aoujai","ทำเพลง half",2,4,"Present","เดี่ยว","",""],["001","2025-10-24","10:00","Aoujai","ทำเพลง half",3,4,"","เดี่ยว","",""],["001","2025-10-24","10:00","Aoujai","ทำเพลง half",4,4,"","เดี่ยว","",""],["002","2024-10-18","22:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["002","2024-11-04","22:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["002","2024-11-11","22:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["002","2024-11-18","22:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","76/100",""],["002","2024-11-24","22:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","ชุด 2",""],["002","2024-11-25","22:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["002","2025-10-24","22:00","Aoujai","ติวเทคโนโลยี",7,10,"","เดี่ยว","",""],["002","2025-10-24","22:00","Aoujai","ติวเทคโนโลยี",8,10,"","เดี่ยว","",""],["002","2025-10-24","22:00","Aoujai","ติวเทคโนโลยี",9,10,"","เดี่ยว","",""],["002","2025-10-24","22:00","Aoujai","ติวเทคโนโลยี",10,10,"","เดี่ยว","",""],["003","2024-10-18","19:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["003","2024-10-25","19:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["003","2024-11-10","19:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["003","2024-11-13","19:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["003","2024-11-17","19:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["003","2024-11-20","19:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","92/100",""],["003","2024-11-24","19:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["003","2024-11-27","19:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["003","2024-12-01","19:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["003","2024-12-04","19:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["004","2024-11-03","20:00","Jingle","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","32 / 54",""],["004","2024-11-09","20:00","Jingle","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","52 / 54",""],["004","2024-11-10","20:00","Jingle","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","54 / 54",""],["004","2024-11-16","20:00","Jingle","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","84 / 100",""],["004","2024-11-17","23:00","Jingle","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","98 / 100",""],["004","2024-11-23","20:00","Jingle","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","94 / 100 (ชุด2)",""],["004","2024-11-24","20:00","Jingle","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","98 / 100",""],["004","2024-11-30","21:00","Jingle","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","95 / 100 (ชุด3)",""],["004","2024-12-01","20:00","Jingle","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","100 / 100 (ชุด3)",""],["004","2024-12-03","20:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["005","2024-11-05","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",1,10,"Present","กลุ่ม 1","","กลุ่มแต่ราคาเดี่ยว เพราะมาแค่ 2 คน"],["005","2024-11-08","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",2,10,"Present","กลุ่ม 1","",""],["005","2024-11-12","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",3,10,"Present","กลุ่ม 1","",""],["005","2024-11-15","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",4,10,"Present","กลุ่ม 1","",""],["005","2024-11-19","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",5,10,"Present","กลุ่ม 1","89/100",""],["005","2024-11-22","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",6,10,"Present","กลุ่ม 1","",""],["005","2024-11-26","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",7,10,"Present","กลุ่ม 1","100/100",""],["005","2024-11-29","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",8,10,"Present","กลุ่ม 1","",""],["005","2024-12-03","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",9,10,"Present","กลุ่ม 1","",""],["005","2024-12-06","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",10,10,"Present","กลุ่ม 1","",""],["006","2024-11-05","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม ลด 5%",1,10,"Present","กลุ่ม 1","",""],["006","2024-11-08","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม ลด 5%",2,10,"Present","กลุ่ม 1","",""],["006","2024-11-12","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม ลด 5%",3,10,"Present","กลุ่ม 1","",""],["006","2024-11-15","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม ลด 5%",4,10,"Present","กลุ่ม 1","",""],["006","2024-11-19","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม ลด 5%",5,10,"Present","กลุ่ม 1","90/100",""],["006","2024-11-22","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม ลด 5%",6,10,"Present","กลุ่ม 1","",""],["006","2024-11-26","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม ลด 5%",7,10,"Present","กลุ่ม 1","100/100",""],["006","2024-11-29","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม ลด 5%",8,10,"Present","กลุ่ม 1","",""],["006","2024-12-03","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม ลด 5%",9,10,"Present","กลุ่ม 1","",""],["006","2024-12-06","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม ลด 5%",10,10,"Present","กลุ่ม 1","",""],["007","2024-11-16","17:00","Jingle","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","35,49 / 54",""],["007","2024-11-23","17:00","Aoujai","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["007","2024-11-30","17:00","Aoujai","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","",""],["007","2024-12-01","17:00","Aoujai","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","",""],["007","2024-12-06","17:00","Aoujai","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","",""],["008","2024-11-05","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",1,10,"Present","กลุ่ม 1","",""],["008","2024-11-08","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",2,10,"Present","กลุ่ม 1","",""],["008","2024-11-12","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",3,10,"Present","กลุ่ม 1","",""],["008","2024-11-15","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",4,10,"Present","กลุ่ม 1","",""],["008","2024-11-19","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",5,10,"Present","กลุ่ม 1","",""],["008","2024-11-22","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",6,10,"Present","กลุ่ม 1","",""],["008","2024-11-26","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",7,10,"Present","กลุ่ม 1","",""],["008","2024-11-29","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",8,10,"Present","กลุ่ม 1","",""],["008","2024-12-03","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",9,10,"Present","กลุ่ม 1","",""],["008","2024-12-06","19:00","Aoujai","ติวเทคโนโลยี กลุ่ม",10,10,"Present","กลุ่ม 1","",""],["009","2024-11-21","19:00","Peem","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["009","2024-11-25","19:00","Peem","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["009","2024-11-27","19:00","Aoujai","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","",""],["009","2024-12-02","19:00","Peem","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","",""],["009","2024-12-04","19:00","Peem","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","",""],["010","2024-12-02","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["010","2024-12-09","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["010","2024-12-20","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["010","2024-12-23","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["010","2025-01-06","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["010","2025-01-10","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["010","2025-01-13","18:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["010","2025-01-21","18:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["010","2025-01-23","14:00","Jingle","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","96 / 100",""],["010","2025-01-24","18:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["011","2024-12-13","","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["011","2024-12-20","","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["011","2025-01-03","","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["011","2025-01-06","","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["011","2025-01-10","","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["011","2025-01-14","","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["011","2025-01-16","","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["011","2025-01-20","","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["011","2025-01-22","","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["011","2025-01-24","","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["012","2025-01-22","18:00","Aoujai","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["012","2025-01-11","18:00","Aoujai","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["012","2025-01-17","18:00","Aoujai","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","",""],["012","2025-01-19","13:00","Aoujai","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","",""],["012","2025-01-24","18:00","Aoujai","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","",""],["013","2025-01-06","19:00","Aoujai","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["013","2025-01-13","19:00","Aoujai","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["013","2025-01-16","19:00","Aoujai","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","",""],["013","2025-01-20","19:00","Aoujai","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","",""],["013","2025-01-24","19:00","Aoujai","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","",""],["014","2025-01-10","15:00","Aoujai","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["014","2025-01-11","15:00","Aoujai","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["014","2025-01-19","15:00","Aoujai","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","",""],["014","2025-01-23","13:00","Aoujai","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","",""],["014","2025-01-24","15:00","Aoujai","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","",""],["015","2025-01-15","","Aoujai","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["015","2025-01-13","","Peem","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["015","2025-01-21","","Aoujai","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","",""],["015","2025-01-17","","Aoujai","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","",""],["015","2025-01-18","","Aoujai","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","",""],["016","2025-01-20","19:00","Miu","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["016","2025-01-21","19:00","Miu","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["016","2025-01-22","19:00","Aoujai","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","",""],["016","2025-01-23","19:00","Miu","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","",""],["016","2025-01-24","19:00","Aoujai","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","",""],["017","2025-01-27","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["017","2025-02-03","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["017","2025-02-10","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["017","2025-02-17","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["017","2025-02-24","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["017","2025-03-03","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["017","2025-03-10","18:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["017","2025-03-16","18:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["017","2025-03-17","18:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["017","2025-03-21","18:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["018","2025-01-31","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["018","2025-02-07","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["018","2025-02-14","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["018","2025-02-21","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["018","2025-02-28","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["018","2025-03-07","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["018","2025-03-14","18:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["018","2025-03-20","18:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["018","2025-03-20","18:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["018","2025-03-21","18:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["020","2025-02-11","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["020","2025-02-04","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["020","2025-02-11","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["020","2025-02-25","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["020","2025-03-11","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["020","2025-03-16","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["020","2025-03-16","18:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["020","2025-04-01","18:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["020","2025-04-08","18:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["020","2025-04-15","18:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["021","2025-02-08","17:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["021","2025-02-14","17:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["021","2025-02-21","17:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["021","2025-02-22","17:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["021","2025-02-28","19:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["021","2025-03-01","17:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["021","2025-03-07","19:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["021","2025-03-08","17:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["021","2025-03-14","19:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["021","2025-03-15","17:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["022","2025-02-15","19:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["022","2025-02-22","19:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["022","2025-03-01","19:00","Miu","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["022","2025-03-08","19:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["022","2025-03-15","19:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["022","2025-03-22","19:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["022","2025-03-29","19:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["022","2025-04-05","19:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["022","2025-04-12","19:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["022","2025-04-19","19:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["023","2025-02-15","11:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["023","2025-02-22","11:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["023","2025-03-01","11:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["023","2025-03-08","11:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["023","2025-03-08","12:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["023","2025-03-15","11:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["023","2025-03-15","12:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["023","2025-03-19","11:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["023","2025-03-19","12:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["023","2025-03-21","11:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["024","2025-02-16","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["024","2025-03-01","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["024","2025-03-01","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["024","2025-03-09","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["024","2025-03-12","18:00","Miu","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["024","2025-03-15","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["024","2025-03-15","18:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["024","2025-03-16","18:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["024","2025-03-16","18:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["024","2025-03-21","18:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["025","2025-03-16","","Aoujai","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["025","2025-03-13","","Aoujai","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["025","2025-03-15","15:00","Aoujai","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","",""],["025","2025-03-16","13:00","Aoujai","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","",""],["025","2025-04-25","","Aoujai","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","",""],["026","2025-03-23","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["026","2025-03-30","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["026","2025-04-06","18:00","Peem","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["026","2025-04-13","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["026","2025-04-20","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["026","2025-04-27","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["026","2025-05-04","18:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["026","2025-05-11","18:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["026","2025-05-18","18:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["026","2025-10-14","18:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["027","2025-04-11","19:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["027","2025-04-18","19:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["027","2025-04-25","19:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["027","2025-05-02","19:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["027","2025-05-09","19:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["027","2025-05-16","19:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["027","2025-05-23","19:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["027","2025-05-30","19:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["027","2025-06-06","19:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["027","2025-06-13","19:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["028","2025-04-26","10:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["028","2025-05-03","10:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["028","2025-05-10","10:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["028","2025-05-17","10:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["028","2025-05-24","10:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["028","2025-05-31","10:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["028","2025-06-07","10:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["028","2025-06-14","10:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["028","2025-07-19","20:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["028","2025-07-26","10:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["029","2025-04-28","19:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["029","2025-05-05","19:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["029","2025-05-12","19:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["029","2025-05-19","19:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["029","2025-05-26","19:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["029","2025-06-02","19:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["029","2025-06-09","19:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["029","2025-06-23","19:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["029","2025-06-23","19:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["029","2025-07-07","19:00","Miu","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["030","2025-04-23","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["030","2025-04-30","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["030","2025-05-06","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["030","2025-05-13","19:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["030","2025-05-20","19:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["030","2025-05-27","19:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["030","2025-07-15","19:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["030","2025-06-10","19:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["030","2025-06-17","19:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["030","2025-06-24","19:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["031","2025-04-27","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["031","2025-05-04","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["031","2025-05-11","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["031","2025-05-18","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["031","2025-05-25","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["031","2025-06-02","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["031","2025-06-08","19:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["031","2025-07-06","19:00","Miu","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["031","2025-06-22","19:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["031","2025-10-16","19:00","Aoujai","ติวเทคโนโลยี รวมพิเศษ",10,10,"Present","รวมพิเศษ","",""],["033","2025-05-14","19:00","Guy","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["033","2025-05-21","19:00","Guy","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["033","2025-05-28","19:00","Guy","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["033","2025-06-04","19:00","Peem","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["033","2025-06-11","19:00","Guy","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["033","2025-06-18","19:00","Guy","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["033","2025-07-30","19:00","Guy","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["033","2025-08-14","19:00","Guy","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["033","2025-08-26","19:00","Guy","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["033","2025-09-13","19:00","Guy","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["032","2025-05-12","20:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["032","2025-05-19","20:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["032","2025-05-26","20:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["032","2025-06-02","20:00","Miu","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["032","2025-06-09","20:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["032","2025-06-16","20:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["032","2025-06-23","20:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["032","2025-06-30","20:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["032","2025-07-07","20:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["032","2025-07-15","20:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["034","2025-05-13","20:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["034","2025-05-20","20:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["034","2025-05-27","20:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["034","2025-06-03","20:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["034","2025-06-10","20:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["034","2025-06-17","20:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["034","2025-06-24","20:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["034","2025-07-01","20:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["034","2025-07-08","20:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["034","2025-07-29","20:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["035","2025-05-13","20:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["035","2025-05-20","20:00","Miu","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["035","2025-05-27","20:00","Miu","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["035","2025-06-03","20:00","Miu","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["035","2025-06-10","20:00","Miu","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["035","2025-06-17","20:00","Miu","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["035","2025-06-24","20:00","Miu","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["035","2025-07-01","20:00","Miu","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["035","2025-07-08","20:00","Miu","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["035","2025-07-15","20:00","Miu","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["036","2025-05-15","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["036","2025-05-22","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["036","2025-05-29","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["036","2025-06-05","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["036","2025-06-12","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["036","2025-06-19","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["036","2025-06-26","18:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","97/100",""],["036","2025-07-03","18:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["036","2025-10-23","18:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["036","2025-07-17","18:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["037","2025-05-21","19:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["037","2025-05-28","19:00","Miu","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["037","2025-06-04","19:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["037","2025-06-11","19:00","Miu","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","36/54",""],["037","2025-06-18","19:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["037","2025-06-25","19:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","56/100",""],["037","2025-07-02","19:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["037","2025-07-09","19:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["037","2025-07-16","19:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","77/100",""],["037","2025-08-02","19:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","73/100",""],["038","2025-06-05","19:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["038","2025-06-12","19:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["038","2025-06-19","19:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["038","2025-06-26","19:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["038","2025-07-03","19:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["038","2025-07-17","19:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["038","2025-07-24","19:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","93/100",""],["038","2025-08-05","19:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["038","2025-08-28","20:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["038","2025-10-16","20:00","Aoujai","ติวเทคโนโลยี รวมพิเศษ",10,10,"Present","รวมพิเศษ","",""],["039","2025-06-08","13:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["039","2025-06-15","13:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["039","2025-06-29","13:00","Miu","ทำเพลง",3,10,"Present","เดี่ยว","",""],["039","2025-06-29","13:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","","Ableton / การบ้านคือ กลับไปแบ่งท่อน เขียนกลอง เบส KB"],["039","2025-07-27","13:00","Miu","ทำเพลง",5,10,"Present","เดี่ยว","","เติมเพลง"],["039","2025-08-10","13:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","","เสียงเครื่องสายตรงให้หน่อยยยย"],["039","2025-08-17","13:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["039","2025-08-24","13:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["039","2025-08-31","13:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","","แกะเพลง"],["039","2025-10-26","13:00","Aoujai","ทำเพลง",10,10,"","","",""],["040","2025-06-13","19:00","Miu","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["040","2025-06-19","19:00","Miu","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["040","2025-06-26","19:00","Miu","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["040","2025-07-03","19:00","Miu","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["040","2025-07-17","19:00","Miu","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["040","2025-07-24","19:00","Miu","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["040","2025-07-31","19:00","Miu","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["040","2025-08-07","19:00","Miu","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["040","2025-08-14","19:00","Miu","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["040","2025-08-21","19:00","Miu","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["042","2025-06-18","20:00","Guy","ทำเพลง",1,10,"Present","เดี่ยว","",""],["042","2025-06-25","20:00","Guy","ทำเพลง",2,10,"Present","เดี่ยว","",""],["042","2025-07-23","20:00","Guy","ทำเพลง",3,10,"Present","เดี่ยว","",""],["042","2025-07-23","20:00","Guy","ทำเพลง",4,10,"","","",""],["042","2025-07-23","20:00","Guy","ทำเพลง",5,10,"","","",""],["042","2025-07-30","20:00","Guy","ทำเพลง",6,10,"","","",""],["042","2025-08-06","20:00","Guy","ทำเพลง",7,10,"","","",""],["042","2025-08-13","20:00","Guy","ทำเพลง",8,10,"","","",""],["042","2025-08-20","20:00","Guy","ทำเพลง",9,10,"","","",""],["042","2025-08-27","20:00","Guy","ทำเพลง",10,10,"","","",""],["041","2025-06-12","20:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["041","2025-06-19","20:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["041","2025-06-26","20:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["041","2025-07-03","20:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["041","2025-07-10","20:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["041","2025-07-17","20:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["041","2025-07-24","20:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","","เขียนเครื่องสาย"],["041","2025-08-28","20:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["041","2025-08-07","20:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","",""],["041","2025-08-14","20:00","Aoujai","ทำเพลง",10,10,"Present","เดี่ยว","",""],["018","2025-05-25","15:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["018","2025-06-01","15:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["018","2025-06-08","15:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["018","2025-06-15","15:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["018","2025-06-22","15:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["018","2025-06-29","15:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","","เตรียม paradell"],["018","2025-11-04","15:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["018","2025-11-02","15:00","Aoujai","ทำเพลง",8,10,"","","",""],["018","2025-11-09","15:00","Aoujai","ทำเพลง",9,10,"","","",""],["018","2025-11-16","15:00","Aoujai","ทำเพลง",10,10,"","","",""],["043","2025-06-30","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","32/54",""],["043","2025-07-07","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["043","2025-07-14","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["043","2025-07-21","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","48/54",",มีการบ้าน"],["043","2025-07-28","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["043","2025-08-04","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["043","2025-08-11","18:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["043","2025-08-18","18:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","","เรียน signal Flow"],["043","2025-09-15","18:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["043","2025-09-15","18:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["044","2025-06-27","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["044","2025-07-09","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["044","2025-07-23","20:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["044","2025-07-30","20:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["044","2025-08-06","20:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","76/100",""],["044","2025-09-01","21:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["044","2025-08-29","21:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["044","2025-09-05","18:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["044","2025-10-10","18:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["044","2025-10-16","18:00","Aoujai","ติวเทคโนโลยี รวมพิเศษ",10,10,"Present","รวมพิเศษ","",""],["045","2025-07-06","11:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","","Ableton"],["045","2025-07-13","11:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["045","2025-07-20","11:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["045","2025-07-27","11:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","","Mix ทุกอย่าง เตรียมเรียน Side Chain"],["045","2025-08-03","11:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","","Side-Chain เตรียม Mastering"],["045","2025-08-10","11:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","","เตรียมเพลงไป"],["045","2025-08-17","11:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","","จูนเสียงร้อง / น้ำลาย"],["045","2025-08-31","11:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["045","2025-09-07","11:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","",""],["045","2025-10-05","11:00","Aoujai","ทำเพลง",10,10,"Present","เดี่ยว","",""],["046","2025-07-05","15:00","Guy","ทำเพลง",1,10,"Present","เดี่ยว","",""],["046","2025-07-19","15:00","Guy","ทำเพลง",2,10,"Present","เดี่ยว","",""],["046","2025-08-02","15:00","Guy","ทำเพลง",3,10,"Present","เดี่ยว","",""],["046","2025-08-20","15:00","Guy","ทำเพลง",4,10,"Present","เดี่ยว","",""],["046","2025-09-13","15:00","Guy","ทำเพลง",5,10,"Present","เดี่ยว","",""],["046","2025-09-20","15:00","Guy","ทำเพลง",6,10,"Present","เดี่ยว","",""],["046","2025-09-27","15:00","Guy","ทำเพลง",7,10,"Present","เดี่ยว","",""],["046","2025-11-23","15:00","Guy","ทำเพลง",8,10,"Present","เดี่ยว","",""],["046","2025-08-30","15:00","Guy","ทำเพลง",9,10,"","","",""],["046","2025-09-06","15:00","Guy","ทำเพลง",10,10,"","","",""],["027","2025-07-12","17:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","","สอนเขียนกลอง มีพื้นฐาน / การบ้าน ทำ Loop เพลง 4 ห้อง Full"],["027","2025-07-19","17:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["027","2025-07-26","17:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","","เขียนเครื่องสาย + อัดกีตาร์"],["027","2025-08-02","17:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","","ทำเพลงมีท่อนเต็มและ Soft มีกีตาร์ไฟฟ้ากับเครื่องสาย"],["027","2025-08-30","17:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["027","2025-10-05","17:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["027","2025-08-23","17:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["027","2025-11-02","17:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["027","2025-11-09","17:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","","Mix"],["027","2025-11-08","17:00","Aoujai","ทำเพลง",10,10,"","","",""],["047","2025-07-07","19:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["047","2025-07-14","19:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["047","2025-07-21","19:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["047","2025-07-28","19:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","45/54",""],["047","2025-08-18","19:00","Miu","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["047","2025-08-25","19:00","Miu","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["047","2025-09-01","19:00","Miu","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["047","2025-09-08","19:00","Miu","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["047","2025-09-15","19:00","Miu","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["047","2025-09-22","19:00","Miu","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["048","2025-07-30","18:00","Miu","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["048","2025-08-06","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["048","2025-08-13","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["048","2025-08-20","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["048","2025-08-27","18:00","Miu","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["048","2025-09-10","18:00","Miu","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["048","2025-09-17","18:00","Miu","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["048","2025-09-24","18:00","Miu","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["048","2025-10-01","18:00","Miu","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","","**ตัดคาบ"],["048","2025-10-08","18:00","Miu","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["033","2025-07-11","23:00","Guy","ทำเพลง",1,10,"Present","เดี่ยว","",""],["033","2025-07-30","23:00","Guy","ทำเพลง",2,10,"Present","เดี่ยว","",""],["033","2025-07-25","23:00","Guy","ทำเพลง",3,10,"Present","เดี่ยว","",""],["033","2025-08-26","23:00","Guy","ทำเพลง",4,10,"Present","เดี่ยว","",""],["033","2026-01-08","23:00","Guy","ทำเพลง",5,10,"Present","เดี่ยว","",""],["033","2026-02-09","23:00","Guy","ทำเพลง",6,10,"Present","เดี่ยว","",""],["033","2025-08-22","23:00","Guy","ทำเพลง",7,10,"","","",""],["033","2025-08-29","23:00","Guy","ทำเพลง",8,10,"","","",""],["033","2025-09-05","23:00","Guy","ทำเพลง",9,10,"","","",""],["033","2025-09-12","23:00","Guy","ทำเพลง",10,10,"","","",""],["049","2025-07-17","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["049","2025-07-24","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["049","2025-07-31","18:00","Miu","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["049","2025-08-14","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["049","2025-08-21","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["049","2025-08-28","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["049","2025-09-04","18:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["049","2025-09-11","18:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["049","2025-09-18","18:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["049","2025-10-09","18:00","Miu","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["050","2025-07-13","20:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","","Logic Pro / การบ้าน เขียนเบส"],["050","2025-07-20","20:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["050","2025-08-03","20:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","","ทำ Loop 16 ห้อง อัดกีตาร์ไฟฟ้า"],["050","2025-08-17","20:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","","เขียน KB"],["050","2025-08-24","19:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["050","2025-11-28","18:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["050","2025-10-30","18:00","Aoujai","ทำเพลง",7,10,"","","",""],["050","2025-11-06","18:00","Aoujai","ทำเพลง",8,10,"","","",""],["050","2025-11-13","18:00","Aoujai","ทำเพลง",9,10,"","","",""],["050","2025-11-20","18:00","Aoujai","ทำเพลง",10,10,"","","",""],["051","2025-07-21","20:00","Aoujai","Mix & Mastering",1,10,"Present","เดี่ยว","","Logic Mix / การบ้าน จัด Track mix เสียงกลอง"],["051","2025-07-30","18:00","Aoujai","Mix & Mastering",2,10,"Present","เดี่ยว","","Logic Mix / การบ้าน Mix กีตาร์ เบส KB"],["051","2025-08-04","20:00","Aoujai","Mix & Mastering",3,10,"Present","เดี่ยว","",""],["051","2025-08-13","20:00","Aoujai","Mix & Mastering",4,10,"Present","เดี่ยว","",""],["051","2025-08-18","20:00","Aoujai","Mix & Mastering",5,10,"Present","เดี่ยว","",""],["051","2025-08-20","20:00","Aoujai","Mix & Mastering",6,10,"","","","Paralell Compression"],["051","2025-08-25","20:00","Aoujai","Mix & Mastering",7,10,"","","",""],["051","2025-08-27","20:00","Aoujai","Mix & Mastering",8,10,"","","",""],["051","2025-09-01","20:00","Aoujai","Mix & Mastering",9,10,"","","",""],["051","2025-09-03","20:00","Aoujai","Mix & Mastering",10,10,"","","",""],["052","2025-08-11","20:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","","Ableton / เขียนกลอง 3 Loop Loop ละ 4 กลอง Sample / Midi แกะตามเพลง"],["052","2025-08-09","20:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","","Ableton / เขียนกลอง 3 Loop Loop ละ 4 กลอง Sample / Midi แกะตามเพลง"],["052","2025-08-16","20:00","Aoujai","ทำเพลง",3,10,"","","",""],["052","2025-08-23","20:00","Aoujai","ทำเพลง",4,10,"","","",""],["052","2025-08-30","20:00","Aoujai","ทำเพลง",5,10,"","","",""],["052","2025-09-06","20:00","Aoujai","ทำเพลง",6,10,"","","",""],["052","2025-09-13","20:00","Aoujai","ทำเพลง",7,10,"","","",""],["052","2025-09-20","20:00","Aoujai","ทำเพลง",8,10,"","","",""],["052","2025-09-27","20:00","Aoujai","ทำเพลง",9,10,"","","",""],["052","2025-10-04","20:00","Aoujai","ทำเพลง",10,10,"","","",""],["053","2025-08-09","19:00","Aoujai","Mix & Mastering",1,10,"Present","เดี่ยว","",""],["053","2025-08-14","19:00","Aoujai","Mix & Mastering",2,10,"Present","เดี่ยว","","การบ้าน แก้กลอง เบส กีตาร์"],["053","2025-08-21","19:00","Aoujai","Mix & Mastering",3,10,"Present","เดี่ยว","","Mix KB Automation"],["053","2025-08-28","19:00","Aoujai","Mix & Mastering",4,10,"Present","เดี่ยว","","เสียงร้อง"],["053","2025-09-25","19:00","Aoujai","Mix & Mastering",5,10,"Present","เดี่ยว","","สอน Side chain เตรียม Mastering"],["053","2025-10-02","19:00","Aoujai","Mix & Mastering",6,10,"Present","เดี่ยว","","Mastering"],["053","2025-10-09","19:00","Aoujai","Mix & Mastering",7,10,"Present","เดี่ยว","","Mastering / New Project"],["053","2025-10-16","19:00","Aoujai","Mix & Mastering",8,10,"Present","เดี่ยว","",""],["053","2025-11-06","19:00","Aoujai","Mix & Mastering",9,10,"Present","เดี่ยว","","Mastering ต่อ"],["053","2025-10-30","19:00","Aoujai","Mix & Mastering",10,10,"Present","เดี่ยว","",""],["054","2025-07-19","20:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["054","2025-07-26","20:00","Miu","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["054","2025-08-02","20:00","Miu","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["054","2025-08-16","20:00","Miu","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["054","2025-08-23","20:00","Miu","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["054","2025-08-30","20:00","Miu","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["054","2025-09-10","20:00","Miu","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["054","2025-09-14","20:00","Miu","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["054","2025-09-25","20:00","Miu","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["054","2025-10-04","20:00","Miu","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["055","2025-08-02","17:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","","เขียนกลอง 8 ห้อง และก็ แกะกลองจากเพลง 1 เพลง Hook 8 ห้อง"],["055","2025-08-10","17:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","","จัด Track บวกกกับ Balance เสียง / ลง Plugin Wave"],["055","2025-08-17","17:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["055","2025-09-14","17:00","Peem","ทำเพลง",4,10,"Present","เดี่ยว","","เขียนเบส"],["055","2025-08-28","17:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["055","2025-09-07","17:00","Aoujai","ทำเพลง",6,10,"","","",""],["055","2025-09-21","17:00","Aoujai","ทำเพลง",7,10,"","","",""],["055","2025-09-21","17:00","Aoujai","ทำเพลง",8,10,"","","",""],["055","2025-09-28","17:00","Aoujai","ทำเพลง",9,10,"","","",""],["055","2025-10-05","17:00","Aoujai","ทำเพลง",10,10,"","","",""],["055","2025-07-27","17:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["055","2025-08-03","17:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["055","2025-08-09","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["055","2025-08-16","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["055","2025-08-23","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["055","2025-08-30","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["055","2025-09-13","18:00","Peem","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","","0.77"],["055","2025-09-20","18:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["055","2025-10-16","18:00","Aoujai","ติวเทคโนโลยี รวมพิเศษ",9,10,"Present","รวมพิเศษ","",""],["055","2025-10-19","18:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["056","2025-08-05","20:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["056","2025-08-12","20:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["056","2025-08-27","20:00","Miu","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["056","2025-09-02","20:00","Peem","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["056","2025-09-09","20:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["056","2025-09-30","20:00","Peem","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["056","2025-10-14","20:00","Peem","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","89.0","100 ข้อ ชุดที่ 2"],["056","2025-10-21","20:00","Aoujai","ติวเทคโนโลยี",8,10,"Absent","เดี่ยว","",""],["056","2025-10-21","20:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["056","2025-10-14","20:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["037","2025-08-13","19:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","83/100",""],["037","2025-08-20","19:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","86/100",""],["037","2025-08-27","19:00","Aoujai","ติวเทคโนโลยี",3,10,"","","","ไฟฟ้า"],["037","2025-09-03","19:00","Aoujai","ติวเทคโนโลยี",4,10,"","","",""],["037","2025-09-10","19:00","Aoujai","ติวเทคโนโลยี",5,10,"","","",""],["037","2025-09-17","19:00","Aoujai","ติวเทคโนโลยี",6,10,"","","",""],["037","2025-09-24","19:00","Aoujai","ติวเทคโนโลยี",7,10,"","","",""],["037","2025-10-01","19:00","Aoujai","ติวเทคโนโลยี",8,10,"","","",""],["037","2025-10-08","19:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["037","2025-10-08","19:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["057","2025-08-18","20:00","Guy","ทำเพลง",1,10,"Present","เดี่ยว","","Ableton"],["057","2025-08-21","20:00","Guy","ทำเพลง",2,10,"Present","เดี่ยว","",""],["057","2025-10-16","19:00","Guy","ทำเพลง",3,10,"Present","เดี่ยว","",""],["057","2026-01-13","19:00","Guy","ทำเพลง",4,10,"Present","เดี่ยว","",""],["057","2026-02-10","19:00","Guy","ทำเพลง",5,10,"Present","เดี่ยว","",""],["057","2026-03-12","19:00","Guy","ทำเพลง",6,10,"Present","เดี่ยว","",""],["057","2026-03-12","19:00","Guy","ทำเพลง",7,10,"Present","เดี่ยว","",""],["057","2025-09-25","19:00","Guy","ทำเพลง",8,10,"","","",""],["057","2025-09-25","19:00","Guy","ทำเพลง",9,10,"","","",""],["057","2025-09-25","19:00","Guy","ทำเพลง",10,10,"","","",""],["058","2025-08-15","21:00","Miu","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["058","2025-08-22","21:00","Miu","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["058","2025-08-29","21:00","Miu","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["058","2025-09-05","21:00","Miu","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["058","2025-09-16","21:00","Miu","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["058","2025-09-19","21:00","Miu","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["058","2025-09-29","21:00","Miu","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["058","2025-10-03","21:00","Miu","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["058","2025-10-10","21:00","Miu","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["058","2025-10-17","21:00","Miu","ติวเทคโนโลยี",10,10,"","","",""],["059","2025-08-16","13:00","Aoujai","Mix & Mastering",1,10,"Present","เดี่ยว","",""],["059","2025-08-23","13:00","Aoujai","Mix & Mastering",2,10,"Present","เดี่ยว","",""],["059","2025-08-30","13:00","Aoujai","Mix & Mastering",3,10,"Present","เดี่ยว","",""],["059","2025-09-06","13:00","Aoujai","Mix & Mastering",4,10,"Present","เดี่ยว","","สอน Mix GTR ไฟฟ้า EVE"],["059","2025-09-13","13:00","Aoujai","Mix & Mastering",5,10,"Present","เดี่ยว","",""],["059","2025-11-01","13:00","Aoujai","Mix & Mastering",6,10,"Present","เดี่ยว","",""],["059","2025-12-06","13:00","Aoujai","Mix & Mastering",7,10,"Present","เดี่ยว","","Paradell"],["059","2025-12-14","13:00","Aoujai","Mix & Mastering",8,10,"Present","เดี่ยว","",""],["059","2025-10-11","13:00","Aoujai","Mix & Mastering",9,10,"","","",""],["059","2025-10-18","13:00","Aoujai","Mix & Mastering",10,10,"","","",""],["060","2025-08-19","20:00","Miu","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["060","2025-08-26","20:00","Miu","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["060","2025-09-02","20:00","Miu","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["060","2025-09-09","20:00","Miu","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["060","2025-09-16","20:00","Miu","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["060","2025-09-23","20:00","Miu","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["060","2025-10-06","20:00","Miu","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["060","2025-10-07","20:00","Miu","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","","**ตัดคาบ"],["060","2025-10-14","20:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["060","2025-10-16","20:00","Aoujai","ติวเทคโนโลยี รวมพิเศษ",10,10,"Present","รวมพิเศษ","",""],["049","2025-09-02","19:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["049","2025-09-05","19:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["049","2025-09-13","19:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["049","2025-09-22","20:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["049","2025-09-26","19:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["049","2025-10-03","19:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["049","2025-10-16","18:00","Aoujai","ติวเทคโนโลยี รวมพิเศษ",7,10,"Present","รวมพิเศษ","",""],["049","2025-10-17","19:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["049","2025-11-16","19:00","Aoujai","ทำเพลง",9,10,"","","",""],["049","2025-11-14","19:00","Aoujai","ทำเพลง",10,10,"","","",""],["028","2025-09-01","19:00","Jingle","ติวทำเพลง",1,10,"Present","เดี่ยว","","ทำความรู้จัก, ส่อง Project"],["028","2025-09-03","19:00","Jingle","ติวทำเพลง",2,10,"Present","เดี่ยว","","จัดโปรเจค, Mastering เล็กน้อย การบ้าน: Clean Audio"],["028","2025-09-08","19:00","Jingle","ติวทำเพลง",3,10,"Absent","เดี่ยว","",""],["028","2025-09-11","19:00","Jingle","ติวทำเพลง",4,10,"Present","เดี่ยว","","Compressor"],["028","2025-09-15","19:00","Jingle","ติวทำเพลง",5,10,"Absent","เดี่ยว","",""],["028","2025-09-22","21:00","Jingle","ติวทำเพลง",6,10,"Present","เดี่ยว","","Verb Chorus Limiter"],["028","2025-09-24","19:00","Jingle","ติวทำเพลง",7,10,"Present","เดี่ยว","","Mastering, Ref, Side-Chain"],["028","2025-10-06","19:00","Jingle","ติวทำเพลง",8,10,"Present","เดี่ยว","","Mastering, Parallel Comp"],["028","2025-10-13","19:00","Jingle","ติวทำเพลง",9,10,"Present","เดี่ยว","","Vox Mixing"],["028","2025-10-16","19:00","Jingle","ติวทำเพลง",10,10,"Present","เดี่ยว","","การส่งงาน ส่ง Stems, Space Designer, Analog Plugin"],["043","2025-09-01","19:00","Peem","ติวทำเพลง",1,10,"Present","เดี่ยว","","แกะกลอง layer เสียง เรียงท่อนใหม่"],["043","2025-09-03","19:00","Peem","ติวทำเพลง",2,10,"Present","เดี่ยว","","การบ้าน - ทำท่อน hook สุดท้ายต่อ"],["043","2025-09-08","19:00","Peem","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["043","2025-09-10","19:00","Peem","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["043","2025-09-15","19:00","Peem","ติวทำเพลง",5,10,"Present","เดี่ยว","","การบ้าน - balance ท่อนที่เหลือ"],["043","2025-09-17","19:00","Peem","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["043","2025-09-22","19:00","Peem","ติวทำเพลง",7,10,"Present","เดี่ยว","","การบ้าน - เขียน report ไอเดียเพลง+สิ่งที่ทำในโปรเจค"],["043","2025-09-24","19:00","Peem","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["043","2025-09-29","19:00","Peem","ติวทำเพลง",9,10,"Present","เดี่ยว","",""],["043","2025-10-01","19:00","Peem","ติวทำเพลง",10,10,"Present","เดี่ยว","",""],["061","2025-08-26","19:00","Aoujai","ติวเทคโนโลยี ใหม่",1,5,"Present","กลุ่ม 3","",""],["061","2025-09-02","19:00","Aoujai","ติวเทคโนโลยี ใหม่",2,5,"Present","กลุ่ม 3","",""],["061","2025-09-09","19:00","Aoujai","ติวเทคโนโลยี ใหม่",3,5,"Present","กลุ่ม 3","",""],["061","2025-09-23","19:00","Aoujai","ติวเทคโนโลยี ใหม่",4,5,"Present","กลุ่ม 3","",""],["061","2025-09-23","19:00","Aoujai","ติวเทคโนโลยี ใหม่",5,5,"Present","กลุ่ม 3","",""],["031","2025-09-03","21:00","Aoujai","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["031","2025-09-07","21:00","Aoujai","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["031","2025-09-10","21:00","Aoujai","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["031","2025-09-13","16:00","Aoujai","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["031","2025-09-17","21:00","Aoujai","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["031","2025-09-20","16:00","Aoujai","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["031","2025-09-24","21:00","Aoujai","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["031","2025-09-25","16:00","Aoujai","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["031","2025-10-01","21:00","Aoujai","ติวทำเพลง",9,10,"Present","เดี่ยว","",""],["031","2025-10-16","16:00","Aoujai","ติวเทคโนโลยี รวมพิเศษ",10,10,"Present","รวมพิเศษ","",""],["035","2025-09-01","20:00","Guy","ติวทำเพลง กลุ่ม",1,10,"Present","กลุ่ม 1","",""],["035","2025-09-03","20:00","Guy","ติวทำเพลง กลุ่ม",2,10,"Present","กลุ่ม 1","",""],["035","2025-09-08","20:00","Guy","ติวทำเพลง กลุ่ม",3,10,"Present","กลุ่ม 1","",""],["035","2025-09-10","20:00","Guy","ติวทำเพลง กลุ่ม",4,10,"Present","กลุ่ม 1","",""],["035","2025-09-15","20:00","Guy","ติวทำเพลง กลุ่ม",5,10,"Present","กลุ่ม 1","",""],["035","2025-09-17","20:00","Guy","ติวทำเพลง กลุ่ม",6,10,"Present","กลุ่ม 1","",""],["035","2025-09-22","20:00","Guy","ติวทำเพลง กลุ่ม",7,10,"Present","กลุ่ม 1","",""],["035","2025-09-24","20:00","Guy","ติวทำเพลง กลุ่ม",8,10,"Present","กลุ่ม 1","",""],["035","2025-09-29","20:00","Guy","ติวทำเพลง กลุ่ม",9,10,"Present","กลุ่ม 1","",""],["035","2025-10-01","20:00","Guy","ติวทำเพลง กลุ่ม",10,10,"Present","กลุ่ม 1","",""],["034","2025-09-01","20:00","Guy","ติวทำเพลง กลุ่ม",1,10,"Present","กลุ่ม 1","",""],["034","2025-09-03","20:00","Guy","ติวทำเพลง กลุ่ม",2,10,"Present","กลุ่ม 1","",""],["034","2025-09-08","20:00","Guy","ติวทำเพลง กลุ่ม",3,10,"Present","กลุ่ม 1","",""],["034","2025-09-10","20:00","Guy","ติวทำเพลง กลุ่ม",4,10,"Present","กลุ่ม 1","",""],["034","2025-09-15","20:00","Guy","ติวทำเพลง กลุ่ม",5,10,"Present","กลุ่ม 1","",""],["034","2025-09-17","20:00","Guy","ติวทำเพลง กลุ่ม",6,10,"Present","กลุ่ม 1","",""],["034","2025-09-22","20:00","Guy","ติวทำเพลง กลุ่ม",7,10,"Present","กลุ่ม 1","",""],["034","2025-09-24","20:00","Guy","ติวทำเพลง กลุ่ม",8,10,"Present","กลุ่ม 1","",""],["034","2025-09-29","20:00","Guy","ติวทำเพลง กลุ่ม",9,10,"Present","กลุ่ม 1","",""],["034","2025-10-01","20:00","Guy","ติวทำเพลง กลุ่ม",10,10,"Present","กลุ่ม 1","",""],["047","2025-09-03","19:00","Guy","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["047","2025-09-05","19:00","Guy","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["047","2025-09-10","19:00","Peem","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["047","2025-09-17","19:00","Guy","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["047","2025-09-19","19:00","Guy","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["047","2025-09-25","19:00","Guy","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["047","2025-09-26","19:00","Guy","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["047","2025-09-26","19:00","Guy","ติวทำเพลง",8,10,"","","",""],["047","2025-10-01","19:00","Guy","ติวทำเพลง",9,10,"","","",""],["047","2025-10-03","19:00","Guy","ติวทำเพลง",10,10,"","","",""],["060","2025-09-02","19:00","Guy","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["060","2025-09-06","20:00","Peem","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["060","2025-09-16","19:00","Guy","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["060","2025-09-18","20:00","Guy","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["060","2025-09-23","19:00","Guy","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["060","2025-09-25","20:00","Guy","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["060","2026-01-12","19:00","Guy","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["060","2026-02-02","20:00","Guy","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["060","2025-09-30","19:00","Guy","ติวทำเพลง",9,10,"","","",""],["060","2025-10-02","20:00","Guy","ติวทำเพลง",10,10,"","","",""],["058","2025-09-01","20:00","Guy","ติวทำเพลง กลุ่ม",1,10,"Present","กลุ่ม 1","",""],["058","2025-09-03","20:00","Guy","ติวทำเพลง กลุ่ม",2,10,"Present","กลุ่ม 1","",""],["058","2025-09-08","20:00","Guy","ติวทำเพลง กลุ่ม",3,10,"Present","กลุ่ม 1","",""],["058","2025-09-10","20:00","Guy","ติวทำเพลง กลุ่ม",4,10,"Present","กลุ่ม 1","",""],["058","2025-09-15","20:00","Guy","ติวทำเพลง กลุ่ม",5,10,"Present","กลุ่ม 1","",""],["058","2025-09-17","20:00","Guy","ติวทำเพลง กลุ่ม",6,10,"Present","กลุ่ม 1","",""],["058","2025-09-22","20:00","Guy","ติวทำเพลง กลุ่ม",7,10,"Present","กลุ่ม 1","",""],["058","2025-09-24","20:00","Guy","ติวทำเพลง กลุ่ม",8,10,"Present","กลุ่ม 1","",""],["058","2025-09-29","20:00","Guy","ติวทำเพลง กลุ่ม",9,10,"Present","กลุ่ม 1","",""],["058","2025-10-01","20:00","Guy","ติวทำเพลง กลุ่ม",10,10,"Present","กลุ่ม 1","",""],["040","2025-09-01","20:00","Guy","ติวทำเพลง กลุ่ม",1,10,"Present","กลุ่ม 1","",""],["040","2025-09-03","20:00","Guy","ติวทำเพลง กลุ่ม",2,10,"Present","กลุ่ม 1","",""],["040","2025-09-08","20:00","Guy","ติวทำเพลง กลุ่ม",3,10,"Present","กลุ่ม 1","",""],["040","2025-09-10","20:00","Guy","ติวทำเพลง กลุ่ม",4,10,"Present","กลุ่ม 1","",""],["040","2025-09-15","20:00","Guy","ติวทำเพลง กลุ่ม",5,10,"Present","กลุ่ม 1","",""],["040","2025-09-17","20:00","Guy","ติวทำเพลง กลุ่ม",6,10,"Present","กลุ่ม 1","",""],["040","2025-09-22","20:00","Guy","ติวทำเพลง กลุ่ม",7,10,"Present","กลุ่ม 1","",""],["040","2025-09-24","20:00","Guy","ติวทำเพลง กลุ่ม",8,10,"Present","กลุ่ม 1","",""],["040","2025-09-29","20:00","Guy","ติวทำเพลง กลุ่ม",9,10,"Present","กลุ่ม 1","",""],["040","2025-10-01","20:00","Guy","ติวทำเพลง กลุ่ม",10,10,"Present","กลุ่ม 1","",""],["044","2025-09-01","19:00","Aoujai","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["044","2025-09-03","19:00","Aoujai","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["044","2025-09-08","19:00","Aoujai","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["044","2025-09-10","19:00","Aoujai","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["044","2025-09-15","19:00","Aoujai","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["044","2025-09-17","19:00","Aoujai","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["044","2025-09-22","19:00","Aoujai","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["044","2025-09-24","19:00","Aoujai","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["044","2025-09-29","19:00","Aoujai","ติวทำเพลง",9,10,"Present","เดี่ยว","",""],["044","2025-10-01","19:00","Aoujai","ติวทำเพลง",10,10,"Present","เดี่ยว","",""],["032","2025-09-04","20:00","Jingle","ติวทำเพลง",1,10,"Present","เดี่ยว","","เลือกเพลง, เขียนกลอง การบ้าน: เขียนกลอง"],["032","2025-09-05","20:00","Jingle","ติวทำเพลง",2,10,"Present","เดี่ยว","","ทำกลองต่อ การบ้าน: ปรับ Velocity"],["032","2025-09-08","20:00","Jingle","ติวทำเพลง",3,10,"Present","เดี่ยว","","การบ้าน: เขียนเบสให้เสร็จ"],["032","2025-09-11","20:00","Jingle","ติวทำเพลง",4,10,"Present","เดี่ยว","","เขียนเปียโน"],["032","2025-09-12","21:00","Jingle","ติวทำเพลง",5,10,"Present","เดี่ยว","","เติม Synth Pad Arp"],["032","2025-09-15","17:00","Jingle","ติวทำเพลง",6,10,"Present","เดี่ยว","","Mix"],["032","2025-09-17","20:00","Jingle","ติวทำเพลง",7,10,"Present","เดี่ยว","","Verb"],["032","2025-09-22","20:00","Jingle","ติวทำเพลง",8,10,"Present","เดี่ยว","","Mix ร้อง"],["032","2025-09-23","20:00","Jingle","ติวทำเพลง",9,10,"Present","เดี่ยว","","Mix กีตาร์"],["032","2025-09-24","20:00","Jingle","ติวทำเพลง",10,10,"Present","เดี่ยว","","ภาพรวม Master"],["062","2025-09-02","19:00","Miu","ติวเทคโนโลยี ใหม่",1,5,"Present","เดี่ยว","",""],["062","2025-09-09","19:00","Miu","ติวเทคโนโลยี ใหม่",2,5,"Present","เดี่ยว","",""],["062","2025-09-18","19:00","Miu","ติวเทคโนโลยี ใหม่",3,5,"Present","เดี่ยว","",""],["062","2025-09-23","19:00","Miu","ติวเทคโนโลยี ใหม่",4,5,"Present","เดี่ยว","",""],["062","2025-09-30","19:00","Miu","ติวเทคโนโลยี ใหม่",5,5,"Present","เดี่ยว","","93/100 ชุด2"],["062","2025-09-01","20:00","Peem","ติวทำเพลง",1,10,"Present","เดี่ยว","","เขียนกลอง เรียงท่อนใหม่"],["062","2025-09-03","20:00","Peem","ติวทำเพลง",2,10,"Present","เดี่ยว","","การบ้าน - แกะคอร์ด"],["062","2025-09-08","20:00","Peem","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["062","2025-09-10","20:00","Peem","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["062","2025-09-15","20:00","Peem","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["062","2025-09-17","20:00","Peem","ติวทำเพลง",6,10,"Present","เดี่ยว","","ใส่เปียโนให้ครบทุกท่อน"],["062","2025-09-24","20:00","Peem","ติวทำเพลง",7,10,"Present","เดี่ยว","","อัดร้อง"],["062","2025-09-25","20:00","Peem","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["062","2025-10-01","20:00","Peem","ติวทำเพลง",9,10,"Present","เดี่ยว","",""],["062","2025-10-02","20:00","Peem","ติวทำเพลง",10,10,"Present","เดี่ยว","",""],["063","2025-08-26","19:00","Aoujai","ติวเทคโนโลยี ใหม่",1,5,"Present","กลุ่ม 3","",""],["063","2025-09-02","19:00","Aoujai","ติวเทคโนโลยี ใหม่",2,5,"Present","กลุ่ม 3","",""],["063","2025-09-09","19:00","Aoujai","ติวเทคโนโลยี ใหม่",3,5,"Present","กลุ่ม 3","",""],["063","2025-09-16","19:00","Aoujai","ติวเทคโนโลยี ใหม่",4,5,"Present","กลุ่ม 3","",""],["063","2025-09-23","19:00","Aoujai","ติวเทคโนโลยี ใหม่",5,5,"Present","กลุ่ม 3","",""],["064","2025-09-04","18:00","Jingle","Mix & Mastering",1,10,"Present","เดี่ยว","","จัด Session, Balance, Pan"],["064","2025-09-25","18:00","Jingle","Mix & Mastering",2,10,"Present","เดี่ยว","","EQ เครื่อง"],["064","2025-10-02","18:00","Jingle","Mix & Mastering",3,10,"Present","เดี่ยว","","EQ, Compressor ร้อง"],["064","2025-12-04","18:00","Jingle","Mix & Mastering",4,10,"Absent","เดี่ยว","",""],["064","2025-12-11","18:00","Jingle","Mix & Mastering",5,10,"Present","เดี่ยว","","Compress เครื่อง, Fx"],["064","2026-01-15","18:00","Jingle","Mix & Mastering",6,10,"Absent","เดี่ยว","",""],["064","2026-02-26","18:00","Jingle","Mix & Mastering",7,10,"Absent","เดี่ยว","",""],["064","2026-03-19","18:00","Jingle","Mix & Mastering",8,10,"Absent","เดี่ยว","",""],["064","2026-03-26","18:00","Jingle","Mix & Mastering",9,10,"Present","เดี่ยว","","ทวน, ดูภาพรวม, Fx"],["064","2026-04-09","18:00","Jingle","Mix & Mastering",10,10,"Present","เดี่ยว","","Side Chain, Paralle Comp, Master"],["066","2025-09-02","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["066","2025-09-09","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["066","2025-09-16","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["066","2025-09-23","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["066","2025-09-30","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["066","2025-10-07","18:00","Peem","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","88.0","100 ข้อ ชุดที่ 1"],["066","2025-10-14","18:00","Peem","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","83.0","100 ข้อ ชุดที่ 2"],["066","2025-10-21","18:00","Aoujai","ติวเทคโนโลยี รวมพิเศษ",8,10,"Present","รวมพิเศษ","",""],["066","2025-10-21","18:00","Aoujai","ติวเทคโนโลยี",9,10,"Absent","เดี่ยว","",""],["066","2025-11-04","18:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["024","2025-09-05","20:00","Aoujai","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["024","2025-09-12","20:00","Peem","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["024","2025-09-19","20:00","Guy","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["024","2025-09-16","20:00","Guy","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["024","2025-09-19","20:00","Guy","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["024","2025-09-23","20:00","Guy","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["024","2025-09-26","20:00","Guy","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["024","2025-09-29","20:00","Guy","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["024","2025-10-05","20:00","Guy","ติวทำเพลง",9,10,"Present","เดี่ยว","",""],["024","2025-10-28","20:00","Guy","ติวทำเพลง",10,10,"","","",""],["048","2025-09-03","13:00","Guy","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["048","2025-09-05","13:00","Guy","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["048","2025-09-10","13:00","Guy","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["048","2025-09-12","13:00","Guy","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["048","2025-09-18","13:00","Guy","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["048","2025-09-23","13:00","Guy","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["048","2025-09-26","13:00","Guy","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["048","2025-10-03","13:00","Guy","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["048","2025-10-01","13:00","Guy","ติวทำเพลง",9,10,"","","",""],["048","2025-10-03","13:00","Guy","ติวทำเพลง",10,10,"","","",""],["067","2025-09-03","11:00","Aoujai","ติวเทคโนโลยี ใหม่",1,5,"Present","เดี่ยว","",""],["067","2025-09-10","11:00","Miu","ติวเทคโนโลยี ใหม่",2,5,"Present","เดี่ยว","",""],["067","2025-09-17","11:00","Aoujai","ติวเทคโนโลยี ใหม่",3,5,"Present","เดี่ยว","",""],["067","2025-10-11","11:00","Peem","ติวเทคโนโลยี ใหม่",4,5,"Present","เดี่ยว","",""],["067","2025-10-25","11:00","Peem","ติวเทคโนโลยี ใหม่",5,5,"Present","เดี่ยว","",""],["068","2025-09-29","18:00","Aoujai","Mix & Mastering",1,10,"Present","เดี่ยว","",""],["068","2025-10-06","18:00","Aoujai","Mix & Mastering",2,10,"Present","เดี่ยว","","Mix Drums"],["068","2025-10-13","18:00","Aoujai","Mix & Mastering",3,10,"Present","เดี่ยว","","Mix Bass"],["068","2025-10-20","18:00","Aoujai","Mix & Mastering",4,10,"Present","เดี่ยว","",""],["068","2025-10-28","20:00","Aoujai","Mix & Mastering",5,10,"Present","เดี่ยว","","mix เพลงตัวเอง"],["068","2025-11-03","18:00","Aoujai","Mix & Mastering",6,10,"Present","เดี่ยว","","อัดเสียงร้อง กีตาร์"],["068","2025-11-10","18:00","Aoujai","Mix & Mastering",7,10,"Present","เดี่ยว","","Live สด"],["068","2025-12-09","18:00","Aoujai","Mix & Mastering",8,10,"Present","เดี่ยว","","ทำ melodyne"],["068","2025-12-08","18:00","Aoujai","Mix & Mastering",9,10,"","","",""],["068","2025-12-15","18:00","Aoujai","Mix & Mastering",10,10,"","","",""],["069","2025-10-02","20:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["069","2025-10-09","20:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","","เขียน BASS"],["069","2025-10-22","20:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["069","2025-10-29","20:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","","สอนเรียงตั้งชื่อ"],["069","2025-11-05","20:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","","สอนเขียนกลองกัน"],["069","2025-11-26","20:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","","สอน Bass Guitar"],["069","2025-12-17","20:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","","สอนเขีียน KB"],["069","2026-01-08","20:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","","เรียน Mix ร้อง"],["069","2026-01-29","20:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","",""],["069","2026-02-05","20:00","Aoujai","ทำเพลง",10,10,"","","",""],["067","2025-10-08","18:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["067","2025-10-15","18:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","","การบ้าน เขียนกลอง"],["067","2025-11-01","18:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["067","2025-11-05","18:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["067","2025-11-05","18:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["067","2025-11-10","21:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["067","2025-11-26","21:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["067","2025-12-03","18:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["067","2025-12-10","18:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","",""],["067","2025-12-17","18:00","Aoujai","ทำเพลง",10,10,"","","",""],["070","2025-10-03","20:00","Peem","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["070","2025-10-08","20:00","Aoujai","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["070","2025-10-10","20:00","Aoujai","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","",""],["070","2025-10-15","20:00","Aoujai","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","",""],["070","2025-10-17","20:00","Aoujai","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","",""],["071","2025-10-11","11:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["071","2025-10-18","11:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["071","2025-12-22","11:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["071","2026-02-02","11:00","Aoujai","ทำเพลง",4,10,"","","",""],["071","2026-02-09","19:00","Aoujai","ทำเพลง",5,10,"","","",""],["071","2026-02-16","19:00","Aoujai","ทำเพลง",6,10,"","","",""],["071","2026-02-23","19:00","Aoujai","ทำเพลง",7,10,"","","",""],["071","2026-03-02","19:00","Aoujai","ทำเพลง",8,10,"","","",""],["071","2026-03-09","19:00","Aoujai","ทำเพลง",9,10,"","","",""],["071","2026-03-16","19:00","Aoujai","ทำเพลง",10,10,"","","",""],["024","2025-10-06","18:00","Guy","ติวเทคโนโลยี ใหม่",1,5,"Present","เดี่ยว","",""],["024","2025-10-08","18:00","Guy","ติวเทคโนโลยี ใหม่",2,5,"Present","เดี่ยว","",""],["024","2025-10-12","18:00","Guy","ติวเทคโนโลยี ใหม่",3,5,"Present","เดี่ยว","",""],["024","2025-10-13","18:00","Guy","ติวเทคโนโลยี ใหม่",4,5,"Present","เดี่ยว","",""],["024","2025-10-15","18:00","Guy","ติวเทคโนโลยี ใหม่",5,5,"Present","เดี่ยว","",""],["072","2025-10-15","19:00","Aoujai","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["072","2025-10-22","19:00","Peem","ติวทำเพลง",2,10,"Present","เดี่ยว","","เขียนกลองต่อ ลองใช้เอฟเฟค tremolo"],["072","2025-10-29","19:00","Aoujai","ติวทำเพลง",3,10,"Present","เดี่ยว","","เขียน Bass มาส่ง"],["072","2025-11-06","19:00","Aoujai","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["072","2025-11-16","19:00","Aoujai","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["072","2025-11-27","18:00","Aoujai","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["072","2025-12-03","19:00","Aoujai","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["072","2025-12-10","19:00","Aoujai","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["072","2025-12-24","19:00","Aoujai","ติวทำเพลง",9,10,"Present","เดี่ยว","",""],["072","2026-01-13","19:00","Guy","ติวทำเพลง",10,10,"Present","เดี่ยว","",""],["073","2025-10-11","18:00","Peem","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["073","2025-10-12","18:00","Peem","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["073","2025-10-13","18:00","Peem","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","83.0","100 ข้อ ชุด 1"],["073","2025-10-15","18:00","Peem","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","89.0","100 ข้อ ชุด 2"],["073","2025-10-16","18:00","Peem","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","100.0","100 ข้อ ชุด 3"],["036","2025-10-13","20:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["036","2025-10-20","20:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["036","2025-10-21","19:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["036","2025-11-01","20:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["036","2025-10-28","19:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["036","2025-11-03","20:00","Aoujai","ทำเพลง",6,10,"Absent","เดี่ยว","",""],["036","2025-11-04","19:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["036","2025-11-10","20:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["036","2025-11-12","18:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","",""],["036","2025-11-14","20:00","Aoujai","ทำเพลง",10,10,"Present","เดี่ยว","",""],["045","2025-10-19","11:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["045","2025-10-26","11:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["045","2025-11-02","11:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["045","2025-11-16","11:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","","ร้อิง"],["045","2025-12-21","11:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["045","2026-02-15","11:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["045","2026-02-22","11:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["045","2026-03-01","11:00","Aoujai","ทำเพลง",8,10,"","","",""],["045","2026-03-08","11:00","Aoujai","ทำเพลง",9,10,"","","",""],["045","2026-03-15","11:00","Aoujai","ทำเพลง",10,10,"","","",""],["074","2025-10-27","19:00","Aoujai","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["074","2025-10-30","20:00","Peem","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["074","2025-11-03","19:00","Aoujai","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["074","2025-11-06","20:00","Aoujai","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["074","2025-11-10","19:00","Aoujai","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["074","2025-11-12","20:00","Aoujai","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["074","2025-11-13","20:00","Aoujai","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["074","2025-11-21","20:00","Aoujai","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["074","2025-11-25","19:00","Aoujai","ติวทำเพลง",9,10,"Present","เดี่ยว","",""],["074","2025-11-27","20:00","Aoujai","ติวทำเพลง",10,10,"","","",""],["075","2025-10-27","19:00","Guy","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["075","2025-10-30","19:00","Guy","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["075","2025-11-03","19:00","Guy","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["075","2025-11-13","19:00","Guy","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["075","2025-11-21","19:00","Guy","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["075","2025-12-15","19:00","Guy","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["075","2025-12-17","19:00","Guy","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["075","2026-01-26","19:00","Guy","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["075","2026-02-13","19:00","Guy","ติวทำเพลง",9,10,"Present","เดี่ยว","",""],["075","2026-02-23","19:00","Guy","ติวทำเพลง",10,10,"Present","เดี่ยว","",""],["075","2025-10-29","19:00","Guy","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["075","2025-11-05","19:00","Guy","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["075","2025-11-12","19:00","Guy","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["075","2025-11-20","19:00","Guy","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["075","2025-11-24","19:00","Guy","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["075","2025-11-27","19:00","Guy","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["075","2026-01-06","19:00","Guy","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["075","2026-01-07","19:00","Guy","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["075","2026-01-12","19:00","Guy","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["075","2026-01-23","19:00","Guy","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["076","2025-10-30","21:00","Peem","ทำเพลง",1,10,"Present","เดี่ยว","",""],["076","2025-10-31","18:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["076","2025-11-03","21:00","Guy","ทำเพลง",3,10,"Present","เดี่ยว","",""],["076","2025-11-04","21:00","Peem","ทำเพลง",4,10,"Present","เดี่ยว","",""],["076","2025-11-05","21:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["076","2025-11-06","21:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["076","2025-11-07","21:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["076","2025-11-09","21:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["076","2025-11-15","21:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","",""],["076","2025-12-01","19:00","Aoujai","ทำเพลง",10,10,"","","",""],["077","2025-10-31","20:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["077","2025-11-07","20:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["077","2025-11-15","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["077","2025-11-18","21:00","Peem","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","","100 ข้อ ชุดที่ 1"],["077","2025-11-20","21:00","Peem","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","","100 ข้อ ชุดที่ 1"],["077","2025-11-25","20:00","Peem","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","0.93","100 ข้อ ชุดที่ 1"],["077","2025-11-27","20:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["077","2025-12-02","20:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["077","2025-12-04","20:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["077","2025-12-05","20:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["078","2025-11-05","21:00","Peem","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["078","2025-11-06","21:00","Peem","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["078","2025-11-08","21:00","Peem","ติวทำเพลง",3,10,"Absent","เดี่ยว","",""],["078","2025-11-09","21:00","Peem","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["078","2025-11-10","21:00","Peem","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["078","2025-11-11","21:00","Peem","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["078","2025-11-12","21:00","Peem","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["078","2025-11-13","21:00","Peem","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["078","2025-11-14","21:00","Peem","ติวทำเพลง",9,10,"Present","เดี่ยว","",""],["078","2025-11-15","21:00","Peem","ติวทำเพลง",10,10,"Present","เดี่ยว","",""],["079","2025-11-30","14:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["079","2025-12-07","14:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["079","2025-12-14","14:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["079","2025-12-21","16:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["079","2026-01-10","14:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["079","2026-01-17","09:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["079","2026-01-20","14:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["079","2026-01-18","14:00","Aoujai","ติวเทคโนโลยี",8,10,"","","",""],["079","2026-01-25","14:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["079","2026-02-01","14:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["080","2025-12-01","21:00","Peem","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["080","2025-12-02","21:00","Peem","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["080","2025-12-03","21:00","Peem","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","",""],["080","2026-01-08","20:00","Peem","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","",""],["080","2026-01-15","20:00","Peem","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","",""],["081","2025-12-23","12:00","Aoujai","Mix & Mastering",1,10,"Present","เดี่ยว","",""],["081","2026-01-03","12:00","Aoujai","Mix & Mastering",2,10,"Present","เดี่ยว","",""],["081","2026-01-19","12:00","Aoujai","Mix & Mastering",3,10,"Present","เดี่ยว","","รอบนี้ เบส และ กีตาร์"],["081","2026-01-26","18:00","Aoujai","Mix & Mastering",4,10,"Present","เดี่ยว","","เตรียมโปรโจค"],["081","2026-01-26","18:00","Aoujai","Mix & Mastering",5,10,"Present","เดี่ยว","",""],["081","2026-02-08","18:00","Aoujai","Mix & Mastering",6,10,"Present","เดี่ยว","",""],["081","2026-03-09","18:00","Aoujai","Mix & Mastering",7,10,"","","",""],["081","2026-03-16","18:00","Aoujai","Mix & Mastering",8,10,"","","",""],["081","2026-03-23","18:00","Aoujai","Mix & Mastering",9,10,"","","",""],["081","2026-03-23","18:00","Aoujai","Mix & Mastering",10,10,"","","",""],["079","2025-12-15","18:00","Aoujai","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["079","2025-12-19","18:00","Aoujai","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["079","2025-12-22","18:00","Aoujai","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["079","2025-12-24","18:00","Aoujai","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["079","2026-01-03","18:00","Aoujai","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["079","2026-01-03","18:00","Aoujai","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["079","2026-08-02","16:00","Aoujai","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["079","2026-05-10","16:00","Aoujai","ติวทำเพลง",8,10,"","","",""],["079","2026-05-17","16:00","Aoujai","ติวทำเพลง",9,10,"","","",""],["079","2026-05-24","16:00","Aoujai","ติวทำเพลง",10,10,"","","",""],["082","2026-01-05","19:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["082","2026-01-12","19:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["082","2026-01-19","19:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["082","2026-01-26","19:00","Aoujai","ติวเทคโนโลยี",4,10,"","","",""],["082","2026-02-02","19:00","Aoujai","ติวเทคโนโลยี",5,10,"","","",""],["082","2026-02-09","19:00","Aoujai","ติวเทคโนโลยี",6,10,"","","",""],["082","2026-02-16","19:00","Aoujai","ติวเทคโนโลยี",7,10,"","","",""],["082","2026-02-23","19:00","Aoujai","ติวเทคโนโลยี",8,10,"","","",""],["082","2026-03-02","19:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["082","2026-03-09","19:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["082","2026-01-10","19:00","Aoujai","ทำเพลง 1",1,8,"","","",""],["082","2026-01-17","19:00","Aoujai","ทำเพลง 1",2,8,"","","",""],["082","2026-01-24","19:00","Aoujai","ทำเพลง 1",3,8,"","","",""],["082","2026-01-31","19:00","Aoujai","ทำเพลง 1",4,8,"","","",""],["082","2026-02-07","19:00","Aoujai","ทำเพลง 1",5,8,"","","",""],["082","2026-02-14","19:00","Aoujai","ทำเพลง 1",6,8,"","","",""],["082","2026-02-21","19:00","Aoujai","ทำเพลง 1",7,8,"","","",""],["082","2026-02-28","19:00","Aoujai","ทำเพลง 1",8,8,"","","",""],["083","2026-01-07","20:00","Peem","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","","บทที่ 1-2 ข้อสอบ 54 ข้อ"],["083","2026-01-11","20:00","Peem","ติวเทคโนโลยี 2 ชม.",2,5,"Absent","เดี่ยว","",""],["083","2026-01-20","20:00","Peem","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","","บทที่ 3-4 ข้อสอบ 54 ข้อ"],["083","2026-01-21","20:00","Peem","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","","บทที่ 5-6 ข้อสอบ 100 ข้อ ชุดที่ 1"],["083","2026-01-22","20:00","Peem","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","","บทที่ 7 ข้อสอบ 100 ข้อ ชุดที่ 2"],["084","2026-01-05","19:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["084","2026-01-20","19:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["084","2026-01-30","19:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","","KB"],["084","2026-02-08","19:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["084","2026-04-08","20:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["084","2026-04-22","19:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["084","2026-05-06","19:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["084","2026-05-20","19:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","","EQ Comp"],["084","2026-06-03","19:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","",""],["084","2026-06-03","19:00","Aoujai","ทำเพลง",10,10,"","","",""],["085","2026-01-10","19:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["085","2026-01-22","19:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","","bass"],["085","2026-01-24","19:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["085","2026-03-12","19:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["085","2026-03-13","19:00","Guy","ทำเพลง",5,10,"Present","เดี่ยว","",""],["085","2026-03-26","19:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["085","2026-04-02","19:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["085","2026-04-09","19:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["085","2026-04-30","19:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","",""],["085","2026-05-07","19:00","Aoujai","ทำเพลง",10,10,"Present","เดี่ยว","",""],["087","2026-01-23","19:00","Aoujai","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["087","2026-01-30","19:00","Aoujai","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["087","2026-02-07","20:00","Aoujai","ติวทำเพลง",3,10,"Present","เดี่ยว","","ทำเบส"],["087","2026-02-15","20:00","Aoujai","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["087","2026-03-13","20:00","Aoujai","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["087","2026-03-27","20:00","Aoujai","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["087","2026-04-04","20:00","Aoujai","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["087","2026-05-19","20:00","Aoujai","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["087","2026-06-07","20:00","Aoujai","ติวทำเพลง",9,10,"Present","เดี่ยว","",""],["087","2026-06-16","20:00","Aoujai","ติวทำเพลง",10,10,"Present","เดี่ยว","",""],["086","2026-01-28","19:00","Aoujai","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["086","2026-01-29","19:00","Aoujai","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["086","2026-02-28","20:00","Aoujai","ติวทำเพลง",3,10,"Present","เดี่ยว","","KB"],["086","2026-04-04","20:00","Aoujai","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["086","2026-04-11","20:00","Aoujai","ติวทำเพลง",5,10,"","","",""],["086","2026-04-25","20:00","Aoujai","ติวทำเพลง",6,10,"","","",""],["086","2026-05-02","20:00","Aoujai","ติวทำเพลง",7,10,"","","",""],["086","2026-05-09","20:00","Aoujai","ติวทำเพลง",8,10,"","","",""],["086","2026-05-16","20:00","Aoujai","ติวทำเพลง",9,10,"","","",""],["086","2026-05-23","20:00","Aoujai","ติวทำเพลง",10,10,"","","",""],["088","2026-02-03","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["088","2026-02-04","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["088","2026-02-11","18:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["088","2026-02-22","18:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["088","2026-02-25","18:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["088","2026-03-10","18:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["088","2026-03-13","18:00","Aoujai","ติวเทคโนโลยี",7,10,"","","",""],["088","2026-03-15","21:00","Aoujai","ติวเทคโนโลยี",8,10,"","","",""],["088","2026-03-17","18:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["088","2026-03-20","20:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["089","2026-02-03","20:00","Aoujai","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["089","2026-02-10","20:00","Aoujai","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["089","2026-02-17","20:00","Aoujai","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["089","2026-02-22","20:00","Aoujai","ติวทำเพลง",4,10,"Present","เดี่ยว","","สอนอัดร้อง"],["089","2026-03-10","20:00","Aoujai","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["089","2026-03-17","20:00","Aoujai","ติวทำเพลง",6,10,"Present","เดี่ยว","","KB PAD เต็ม สอนร้อง"],["089","2026-03-31","20:00","Aoujai","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["089","2026-04-07","20:00","Aoujai","ติวทำเพลง",8,10,"Absent","เดี่ยว","",""],["089","2026-06-16","20:00","Aoujai","ติวทำเพลง",9,10,"","","",""],["089","2026-05-26","20:00","Aoujai","ติวทำเพลง",10,10,"","","",""],["090","2026-02-03","19:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["090","2026-02-10","19:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["090","2026-02-17","19:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["090","2026-03-12","20:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","","อัดกีตาร์ไฟฟ้า"],["090","2026-03-17","19:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["090","2026-03-24","19:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["090","2026-03-31","19:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["090","2026-04-07","19:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["090","2026-05-05","19:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","",""],["090","2026-05-12","19:00","Aoujai","ทำเพลง",10,10,"Present","เดี่ยว","",""],["091","2026-02-04","18:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["091","2026-02-11","18:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["091","2026-03-24","17:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["091","2026-03-23","18:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","","ไปบ้านดูม"],["091","2026-03-06","19:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["091","2026-06-08","18:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["091","2026-03-18","18:00","Aoujai","ทำเพลง",7,10,"","","",""],["091","2026-03-25","18:00","Aoujai","ทำเพลง",8,10,"","","",""],["091","2026-04-01","18:00","Aoujai","ทำเพลง",9,10,"","","",""],["091","2026-04-08","18:00","Aoujai","ทำเพลง",10,10,"","","",""],["072","2026-01-23","19:00","Guy","ทำเพลง",1,10,"Present","เดี่ยว","",""],["072","2026-02-03","19:00","Guy","ทำเพลง",2,10,"Present","เดี่ยว","",""],["072","2026-02-24","19:00","Guy","ทำเพลง",3,10,"Present","เดี่ยว","",""],["072","2026-03-06","19:00","Guy","ทำเพลง",4,10,"Present","เดี่ยว","",""],["072","2026-03-17","19:00","Guy","ทำเพลง",5,10,"Present","เดี่ยว","",""],["072","2026-04-16","19:00","Guy","ทำเพลง",6,10,"Present","เดี่ยว","",""],["072","2026-04-21","19:00","Guy","ทำเพลง",7,10,"Present","เดี่ยว","",""],["072","2026-05-02","19:00","Guy","ทำเพลง",8,10,"Present","เดี่ยว","",""],["072","2026-05-16","19:00","Guy","ทำเพลง",9,10,"Present","เดี่ยว","",""],["072","2026-06-03","19:00","Guy","ทำเพลง",10,10,"Present","เดี่ยว","",""],["092","2026-03-02","20:00","Aoujai","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["092","2026-03-03","20:00","Aoujai","ติวเทคโนโลยี 2 ชม.",2,5,"Present","เดี่ยว","",""],["092","2026-03-10","20:00","Aoujai","ติวเทคโนโลยี 2 ชม.",3,5,"Present","เดี่ยว","",""],["092","2026-03-11","20:00","Aoujai","ติวเทคโนโลยี 2 ชม.",4,5,"Present","เดี่ยว","",""],["092","2026-03-20","20:00","Aoujai","ติวเทคโนโลยี 2 ชม.",5,5,"Present","เดี่ยว","",""],["093","2026-03-10","18:00","Guy","ทำเพลง",1,10,"Present","เดี่ยว","",""],["093","2026-05-17","18:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["093","2026-05-29","18:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["093","2026-06-19","18:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["093","2026-04-04","18:00","Guy","ทำเพลง",5,10,"Present","เดี่ยว","",""],["093","2026-04-11","18:00","Guy","ทำเพลง",6,10,"","","",""],["093","2026-04-18","18:00","Guy","ทำเพลง",7,10,"","","",""],["093","2026-04-25","18:00","Guy","ทำเพลง",8,10,"","","",""],["093","2026-05-02","18:00","Guy","ทำเพลง",9,10,"","","",""],["093","2026-05-09","18:00","Guy","ทำเพลง",10,10,"","","",""],["094","2026-03-12","20:00","Aoujai","ทำเพลง",1,10,"","","",""],["094","2026-03-19","20:00","Aoujai","ทำเพลง",2,10,"","","",""],["094","2026-03-26","20:00","Aoujai","ทำเพลง",3,10,"","","",""],["094","2026-04-02","20:00","Aoujai","ทำเพลง",4,10,"","","",""],["094","2026-04-09","20:00","Aoujai","ทำเพลง",5,10,"","","",""],["094","2026-04-16","20:00","Aoujai","ทำเพลง",6,10,"","","",""],["094","2026-04-23","20:00","Aoujai","ทำเพลง",7,10,"","","",""],["094","2026-04-30","20:00","Aoujai","ทำเพลง",8,10,"","","",""],["094","2026-05-07","20:00","Aoujai","ทำเพลง",9,10,"","","",""],["094","2026-05-14","20:00","Aoujai","ทำเพลง",10,10,"","","",""],["095","2026-04-04","19:00","Guy","ทำเพลง",1,10,"Present","เดี่ยว","",""],["095","2026-04-11","19:00","Guy","ทำเพลง",2,10,"Present","เดี่ยว","",""],["095","2026-04-18","19:00","Guy","ทำเพลง",3,10,"Present","เดี่ยว","",""],["095","2026-05-23","19:00","Guy","ทำเพลง",4,10,"Present","เดี่ยว","",""],["095","2026-04-18","19:00","Guy","ทำเพลง",5,10,"","","",""],["095","2026-04-25","19:00","Guy","ทำเพลง",6,10,"","","",""],["095","2026-05-02","19:00","Guy","ทำเพลง",7,10,"","","",""],["095","2026-05-09","19:00","Guy","ทำเพลง",8,10,"","","",""],["095","2026-05-16","19:00","Guy","ทำเพลง",9,10,"","","",""],["095","2026-05-23","19:00","Guy","ทำเพลง",10,10,"","","",""],["043","2026-04-27","18:00","Aoujai","Mix & Mastering",1,10,"Present","เดี่ยว","",""],["043","2026-05-07","18:00","Aoujai","Mix & Mastering",2,10,"Present","เดี่ยว","",""],["043","2026-04-13","18:00","Aoujai","Mix & Mastering",3,10,"","","",""],["043","2026-05-11","18:00","Aoujai","Mix & Mastering",4,10,"","","",""],["043","2026-04-27","18:00","Aoujai","Mix & Mastering",5,10,"","","",""],["043","2026-05-04","18:00","Aoujai","Mix & Mastering",6,10,"","","",""],["043","2026-05-11","18:00","Aoujai","Mix & Mastering",7,10,"","","",""],["043","2026-05-18","18:00","Aoujai","Mix & Mastering",8,10,"","","",""],["043","2026-05-25","18:00","Aoujai","Mix & Mastering",9,10,"","","",""],["043","2026-06-01","18:00","Aoujai","Mix & Mastering",10,10,"","","",""],["096","2026-03-18","18:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["096","2026-03-25","18:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["096","2026-04-01","18:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["096","2026-04-08","18:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["096","2026-05-13","18:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["096","2026-05-14","18:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["096","2026-06-18","18:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["096","2026-05-06","18:00","Aoujai","ทำเพลง",8,10,"","","",""],["096","2026-05-13","18:00","Aoujai","ทำเพลง",9,10,"","","",""],["096","2026-05-20","18:00","Aoujai","ทำเพลง",10,10,"","","",""],["097","2026-03-28","11:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["097","2026-04-04","11:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["097","2026-04-07","11:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["097","2026-04-21","18:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["097","2026-04-25","11:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["097","2026-05-02","18:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["097","2026-05-09","11:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["097","2026-05-27","11:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["097","2026-05-23","11:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","",""],["097","2026-06-06","11:00","Aoujai","ทำเพลง",10,10,"Present","เดี่ยว","",""],["098","2026-05-04","20:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["098","2026-06-02","20:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["098","2026-06-04","20:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["098","2026-06-17","20:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["098","2026-07-02","20:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["098","2026-08-12","20:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["098","2026-09-03","21:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["098","2026-07-15","20:00","Aoujai","ทำเพลง",8,10,"","","",""],["098","2026-07-22","20:00","Aoujai","ทำเพลง",9,10,"","","",""],["098","2026-07-29","20:00","Aoujai","ทำเพลง",10,10,"","","",""],["099","2026-05-14","20:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["099","2026-06-04","20:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["099","2026-06-03","20:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["099","2026-07-02","20:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["099","2026-06-11","20:00","Aoujai","ทำเพลง",5,10,"Absent","เดี่ยว","",""],["099","2026-07-16","20:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["099","2026-06-25","20:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["099","2026-08-06","20:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["099","2026-08-13","20:00","Aoujai","ทำเพลง",9,10,"Present","เดี่ยว","",""],["099","2026-09-05","21:00","Aoujai","ทำเพลง",10,10,"Present","เดี่ยว","",""],["100","2026-07-02","19:00","Aoujai","Mix & Mastering ใหม่",1,4,"Present","เดี่ยว","",""],["100","2026-07-03","19:00","Aoujai","Mix & Mastering ใหม่",2,4,"Present","เดี่ยว","",""],["100","2026-07-04","19:00","Aoujai","Mix & Mastering ใหม่",3,4,"Present","เดี่ยว","",""],["100","2026-07-03","19:00","Aoujai","Mix & Mastering ใหม่",4,4,"","","",""],["062","2026-06-08","19:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["062","2026-06-15","19:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["062","2026-06-29","19:00","Aoujai","ทำเพลง",3,10,"Present","เดี่ยว","",""],["062","2026-07-13","19:00","Aoujai","ทำเพลง",4,10,"Present","เดี่ยว","",""],["062","2026-07-22","19:00","Aoujai","ทำเพลง",5,10,"Present","เดี่ยว","",""],["062","2026-07-28","19:00","Aoujai","ทำเพลง",6,10,"Present","เดี่ยว","",""],["062","2026-08-11","19:00","Aoujai","ทำเพลง",7,10,"Present","เดี่ยว","",""],["062","2026-09-07","19:00","Aoujai","ทำเพลง",8,10,"Present","เดี่ยว","",""],["062","2026-09-07","19:00","Aoujai","ทำเพลง",9,10,"","","",""],["062","2026-09-14","19:00","Aoujai","ทำเพลง",10,10,"","","",""],["062","2026-06-09","19:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["062","2026-06-16","19:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["062","2026-07-06","19:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["062","2026-07-14","19:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["062","2026-07-21","19:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["062","2026-07-27","19:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["062","2026-08-11","19:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["062","2026-07-28","19:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["062","2026-09-01","19:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["062","2026-09-01","19:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["101","2026-06-11","19:00","Aoujai","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["101","2026-06-18","19:00","Aoujai","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["101","2026-06-25","19:00","Aoujai","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["101","2026-07-02","19:00","Aoujai","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["101","2026-07-09","19:00","Aoujai","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["101","2026-07-16","19:00","Aoujai","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["101","2026-08-06","19:00","Aoujai","ติวทำเพลง",7,10,"Present","เดี่ยว","",""],["101","2026-08-13","19:00","Aoujai","ติวทำเพลง",8,10,"Present","เดี่ยว","",""],["101","2026-08-20","19:00","Aoujai","ติวทำเพลง",9,10,"Present","เดี่ยว","",""],["101","2026-08-27","19:00","Aoujai","ติวทำเพลง",10,10,"","","",""],["102","2026-06-14","17:00","Guy","Mix & Mastering ใหม่",1,4,"Present","เดี่ยว","",""],["102","2026-06-21","17:00","Guy","Mix & Mastering ใหม่",2,4,"Present","เดี่ยว","",""],["102","2026-07-05","17:00","Guy","Mix & Mastering ใหม่",3,4,"Present","เดี่ยว","",""],["102","2026-07-12","17:00","Guy","Mix & Mastering ใหม่",4,4,"Present","เดี่ยว","",""],["103","2026-06-09","19:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["103","2026-07-03","19:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["103","2026-07-07","20:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["103","2026-07-14","20:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["103","2026-07-21","20:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["103","2026-07-28","20:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["103","2026-08-04","20:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["103","2026-08-11","20:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["103","2026-08-18","20:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["103","2026-08-25","20:00","Aoujai","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["104","2026-06-14","19:00","Peem","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","0.7",""],["104","2026-06-19","19:00","Peem","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","0.8",""],["104","2026-06-25","19:00","Peem","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","0.94",""],["104","2026-07-05","13:00","Peem","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","1.0",""],["104","2026-07-12","18:00","Peem","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["104","2026-07-17","19:00","Peem","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["104","2026-07-25","19:00","Peem","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","0.89","100 (2)"],["104","2026-08-12","13:00","Peem","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","0.95","100 (3)"],["104","2026-08-15","19:00","Peem","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["104","2026-08-21","19:00","Peem","ติวเทคโนโลยี",10,10,"","","",""],["090","2026-06-12","20:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["090","2026-06-19","20:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["090","2026-06-26","20:00","Aoujai","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["090","2026-07-03","20:00","Aoujai","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["090","2026-07-10","20:00","Aoujai","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["090","2026-07-18","20:00","Aoujai","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["090","2026-07-31","20:00","Aoujai","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["090","2026-08-21","20:00","Aoujai","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["090","2026-08-28","20:00","Aoujai","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["090","2026-08-14","20:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["105","2026-06-07","11:00","Aoujai","ติวทำเพลง",1,10,"Present","เดี่ยว","",""],["105","2026-06-14","11:00","Aoujai","ติวทำเพลง",2,10,"Present","เดี่ยว","",""],["105","2026-07-09","11:00","Aoujai","ติวทำเพลง",3,10,"Present","เดี่ยว","",""],["105","2026-07-12","11:00","Aoujai","ติวทำเพลง",4,10,"Present","เดี่ยว","",""],["105","2026-07-19","11:00","Aoujai","ติวทำเพลง",5,10,"Present","เดี่ยว","",""],["105","2026-08-16","11:00","Aoujai","ติวทำเพลง",6,10,"Present","เดี่ยว","",""],["105","2026-09-13","11:00","Aoujai","ติวทำเพลง",7,10,"","","",""],["105","2026-07-26","11:00","Aoujai","ติวทำเพลง",8,10,"","","",""],["105","2026-08-02","11:00","Aoujai","ติวทำเพลง",9,10,"","","",""],["105","2026-08-09","11:00","Aoujai","ติวทำเพลง",10,10,"","","",""],["106","2026-06-17","19:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["106","2026-06-24","19:00","Peem","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["106","2026-07-01","19:00","Aoujai","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["106","2026-07-15","19:00","Aoujai","ทำเพลง ใหม่",4,4,"Present","เดี่ยว","",""],["107","2026-06-14","15:00","Aoujai","ทำเพลง",1,10,"Present","เดี่ยว","",""],["107","2026-06-21","15:00","Aoujai","ทำเพลง",2,10,"Present","เดี่ยว","",""],["107","2026-06-28","15:00","Aoujai","ทำเพลง",3,10,"","","",""],["107","2026-07-05","15:00","Aoujai","ทำเพลง",4,10,"","","",""],["107","2026-07-12","15:00","Aoujai","ทำเพลง",5,10,"","","",""],["107","2026-07-19","15:00","Aoujai","ทำเพลง",6,10,"","","",""],["107","2026-07-26","15:00","Aoujai","ทำเพลง",7,10,"","","",""],["107","2026-08-02","15:00","Aoujai","ทำเพลง",8,10,"","","",""],["107","2026-08-09","15:00","Aoujai","ทำเพลง",9,10,"","","",""],["107","2026-08-16","15:00","Aoujai","ทำเพลง",10,10,"","","",""],["072","2026-06-14","20:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["072","2026-06-21","20:00","Peem","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["072","2026-06-28","20:00","Guy","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","",""],["072","2026-07-05","20:00","Guy","ติวเทคโนโลยี",4,10,"Present","เดี่ยว","",""],["072","2026-07-19","20:00","Guy","ติวเทคโนโลยี",5,10,"Present","เดี่ยว","",""],["072","2026-07-26","20:00","Guy","ติวเทคโนโลยี",6,10,"Present","เดี่ยว","",""],["072","2026-08-01","20:00","Guy","ติวเทคโนโลยี",7,10,"Present","เดี่ยว","",""],["072","2026-08-15","20:00","Guy","ติวเทคโนโลยี",8,10,"Present","เดี่ยว","",""],["072","2026-08-23","20:00","Guy","ติวเทคโนโลยี",9,10,"Present","เดี่ยว","",""],["072","2026-08-31","20:00","Guy","ติวเทคโนโลยี",10,10,"Present","เดี่ยว","",""],["108","2026-06-27","13:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["108","2026-07-01","13:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["108","2026-07-06","13:00","Aoujai","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["108","2026-07-11","13:00","Aoujai","ทำเพลง ใหม่",4,4,"Present","เดี่ยว","",""],["109","2026-07-06","20:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["109","2026-07-11","20:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["109","2026-07-28","20:00","Aoujai","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["109","2026-08-04","20:00","Aoujai","ทำเพลง ใหม่",4,4,"Present","เดี่ยว","",""],["102","2026-06-26","17:00","Guy","Mix & Mastering ใหม่",1,4,"Present","เดี่ยว","",""],["102","2026-08-23","17:00","Guy","Mix & Mastering ใหม่",2,4,"Present","เดี่ยว","",""],["102","2026-08-31","17:00","Guy","Mix & Mastering ใหม่",3,4,"Present","เดี่ยว","",""],["102","2026-09-06","17:00","Guy","Mix & Mastering ใหม่",4,4,"Present","เดี่ยว","",""],["110","2026-07-27","22:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["110","2026-07-19","22:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["110","2026-08-23","22:00","Guy","ทำเพลง ใหม่",3,4,"","","",""],["110","2026-08-02","22:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["111","2026-08-01","20:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["111","2026-08-16","21:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["111","2026-08-15","19:00","Aoujai","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["111","2026-09-04","19:00","Aoujai","ทำเพลง ใหม่",4,4,"Present","เดี่ยว","",""],["108","2026-08-01","13:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["108","2026-08-09","13:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["108","2026-08-15","13:00","Aoujai","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["108","2026-08-29","13:00","Aoujai","ทำเพลง ใหม่",4,4,"Present","เดี่ยว","",""],["106","2026-07-31","19:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["106","2026-08-26","19:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["106","2026-09-02","19:00","Aoujai","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["106","2026-09-09","19:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["072","2026-07-26","","Aoujai","ทำเพลง ใหม่",1,4,"","","",""],["072","2026-08-02","","Aoujai","ทำเพลง ใหม่",2,4,"","","",""],["072","2026-08-09","","Aoujai","ทำเพลง ใหม่",3,4,"","","",""],["072","2026-08-16","","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["112","2026-07-26","19:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["112","2026-07-28","19:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["112","2026-08-02","19:00","Aoujai","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["112","2026-08-09","19:00","Aoujai","ทำเพลง ใหม่",4,4,"Present","เดี่ยว","",""],["113","2026-08-08","16:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["113","2026-08-14","16:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["113","2026-08-28","16:00","Aoujai","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["113","2026-09-04","16:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["114","2026-08-15","20:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["114","2026-08-22","20:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["114","2026-08-29","20:00","Aoujai","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["114","2026-09-08","20:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["115","2026-08-29","10:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["115","2026-09-05","10:00","Aoujai","ทำเพลง ใหม่",2,4,"","","",""],["115","2026-09-12","10:00","Aoujai","ทำเพลง ใหม่",3,4,"","","",""],["115","2026-09-19","10:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["116","2026-08-26","20:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["116","2026-09-02","20:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["116","2026-09-09","20:00","Aoujai","ทำเพลง ใหม่",3,4,"","","",""],["116","2026-09-16","20:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["118","2026-08-17","20:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["118","2026-08-24","20:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["118","2026-08-31","20:00","Aoujai","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["118","2026-09-07","20:00","Aoujai","ทำเพลง ใหม่",4,4,"Present","เดี่ยว","",""],["119","2026-08-16","19:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["119","2026-08-30","21:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["119","2026-09-06","19:00","Aoujai","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["119","2026-09-06","19:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["121","2026-08-22","13:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["121","2026-08-29","13:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["121","2026-09-05","13:00","Aoujai","ทำเพลง ใหม่",3,4,"","","",""],["121","2026-09-12","13:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["117","2026-08-22","21:00","Guy","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["117","2026-08-29","21:00","Guy","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["117","2026-09-05","21:00","Guy","ทำเพลง ใหม่",3,4,"","","",""],["117","2026-09-12","21:00","Guy","ทำเพลง ใหม่",4,4,"","","",""],["109","2026-08-14","20:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["109","2026-08-23","20:00","Guy","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["109","2026-08-31","20:00","Guy","ทำเพลง ใหม่",3,4,"Present","เดี่ยว","",""],["109","2026-09-04","20:00","Guy","ทำเพลง ใหม่",4,4,"","","",""],["117","2026-08-30","20:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["117","2026-09-06","20:00","Aoujai","ติวเทคโนโลยี",2,10,"","","",""],["117","2026-09-13","20:00","Aoujai","ติวเทคโนโลยี",3,10,"","","",""],["117","2026-09-20","20:00","Aoujai","ติวเทคโนโลยี",4,10,"","","",""],["117","2026-09-27","20:00","Aoujai","ติวเทคโนโลยี",5,10,"","","",""],["117","2026-10-04","20:00","Aoujai","ติวเทคโนโลยี",6,10,"","","",""],["117","2026-10-11","20:00","Aoujai","ติวเทคโนโลยี",7,10,"","","",""],["117","2026-10-18","20:00","Aoujai","ติวเทคโนโลยี",8,10,"","","",""],["117","2026-10-25","20:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["117","2026-11-01","20:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["122","2026-08-27","19:00","Aoujai","ทำเพลง ใหม่",1,4,"","","",""],["122","2026-09-03","19:00","Aoujai","ทำเพลง ใหม่",2,4,"","","",""],["122","2026-09-10","19:00","Aoujai","ทำเพลง ใหม่",3,4,"","","",""],["122","2026-09-17","19:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["123","2026-08-28","18:00","Aoujai","ติวเทคโนโลยี กลุ่ม",1,10,"Present","กลุ่ม","",""],["123","2026-09-04","18:00","Aoujai","ติวเทคโนโลยี กลุ่ม",2,10,"Present","กลุ่ม","",""],["123","2026-09-11","18:00","Aoujai","ติวเทคโนโลยี กลุ่ม",3,10,"","","",""],["123","2026-09-18","18:00","Aoujai","ติวเทคโนโลยี กลุ่ม",4,10,"","","",""],["123","2026-09-25","18:00","Aoujai","ติวเทคโนโลยี กลุ่ม",5,10,"","","",""],["123","2026-10-02","18:00","Aoujai","ติวเทคโนโลยี กลุ่ม",6,10,"","","",""],["123","2026-10-09","18:00","Aoujai","ติวเทคโนโลยี กลุ่ม",7,10,"","","",""],["123","2026-10-16","18:00","Aoujai","ติวเทคโนโลยี กลุ่ม",8,10,"","","",""],["123","2026-10-23","18:00","Aoujai","ติวเทคโนโลยี กลุ่ม",9,10,"","","",""],["123","2026-10-30","18:00","Aoujai","ติวเทคโนโลยี กลุ่ม",10,10,"","","",""],["119","2026-08-30","10:00","Peem","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","0.56",""],["119","2026-09-02","10:00","Peem","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","0.8",""],["119","2026-09-06","10:00","Peem","ติวเทคโนโลยี",3,10,"Present","เดี่ยว","0.93",""],["119","2026-09-09","10:00","Peem","ติวเทคโนโลยี",4,10,"","","",""],["119","2026-09-13","10:00","Peem","ติวเทคโนโลยี",5,10,"","","",""],["119","2026-09-16","10:00","Peem","ติวเทคโนโลยี",6,10,"","","",""],["119","2026-09-20","10:00","Peem","ติวเทคโนโลยี",7,10,"","","",""],["119","2026-09-23","10:00","Peem","ติวเทคโนโลยี",8,10,"","","",""],["119","2026-09-27","10:00","Peem","ติวเทคโนโลยี",9,10,"","","",""],["119","2026-09-30","10:00","Peem","ติวเทคโนโลยี",10,10,"","","",""],["124","2026-08-23","10:00","Japan","ทำเพลง Advance",1,4,"Present","เดี่ยว","",""],["124","2026-09-06","10:00","Japan","ทำเพลง Advance",2,4,"Present","เดี่ยว","",""],["124","2026-09-06","10:00","Japan","ทำเพลง Advance",3,4,"","","",""],["124","2026-09-13","10:00","Japan","ทำเพลง Advance",4,4,"","","",""],["103","2026-09-01","19:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["103","2026-09-08","19:00","Aoujai","ทำเพลง ใหม่",2,4,"","","",""],["103","2026-09-15","19:00","Aoujai","ทำเพลง ใหม่",3,4,"","","",""],["103","2026-09-22","19:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["125","2026-09-01","19:00","Peem","ติวเทคโนโลยี 2 ชม.",1,5,"Present","เดี่ยว","",""],["125","2026-09-08","19:00","Peem","ติวเทคโนโลยี 2 ชม.",2,5,"","","",""],["125","2026-09-15","19:00","Peem","ติวเทคโนโลยี 2 ชม.",3,5,"","","",""],["125","2026-09-22","19:00","Peem","ติวเทคโนโลยี 2 ชม.",4,5,"","","",""],["125","2026-09-29","19:00","Peem","ติวเทคโนโลยี 2 ชม.",5,5,"","","",""],["126","2026-08-30","17:00","Aoujai","ติวเทคโนโลยี",1,10,"","","",""],["126","2026-09-06","17:00","Aoujai","ติวเทคโนโลยี",2,10,"","","",""],["126","2026-09-13","17:00","Aoujai","ติวเทคโนโลยี",3,10,"","","",""],["126","2026-09-20","17:00","Aoujai","ติวเทคโนโลยี",4,10,"","","",""],["126","2026-09-27","17:00","Aoujai","ติวเทคโนโลยี",5,10,"","","",""],["126","2026-10-04","17:00","Aoujai","ติวเทคโนโลยี",6,10,"","","",""],["126","2026-10-11","17:00","Aoujai","ติวเทคโนโลยี",7,10,"","","",""],["126","2026-10-18","17:00","Aoujai","ติวเทคโนโลยี",8,10,"","","",""],["126","2026-10-25","17:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["126","2026-11-01","17:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["104","2026-08-30","13:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["104","2026-09-03","17:00","Aoujai","ทำเพลง ใหม่",2,4,"","","",""],["104","2026-09-13","13:00","Aoujai","ทำเพลง ใหม่",3,4,"","","",""],["104","2026-09-20","13:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["098","2026-08-30","14:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["098","2026-09-06","20:00","Peem","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","0.8",""],["098","2026-09-13","14:00","Aoujai","ติวเทคโนโลยี",3,10,"","","",""],["098","2026-09-20","14:00","Aoujai","ติวเทคโนโลยี",4,10,"","","",""],["098","2026-09-27","14:00","Aoujai","ติวเทคโนโลยี",5,10,"","","",""],["098","2026-10-04","14:00","Aoujai","ติวเทคโนโลยี",6,10,"","","",""],["098","2026-10-11","14:00","Aoujai","ติวเทคโนโลยี",7,10,"","","",""],["098","2026-10-18","14:00","Aoujai","ติวเทคโนโลยี",8,10,"","","",""],["098","2026-10-25","14:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["098","2026-11-01","14:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["127","2026-09-17","18:00","Aoujai","ทำเพลง 1",1,8,"","","",""],["127","2026-09-24","18:00","Aoujai","ทำเพลง 1",2,8,"","","",""],["127","2026-10-01","18:00","Aoujai","ทำเพลง 1",3,8,"","","",""],["127","2026-10-08","18:00","Aoujai","ทำเพลง 1",4,8,"","","",""],["127","2026-10-15","18:00","Aoujai","ทำเพลง 1",5,8,"","","",""],["127","2026-10-22","18:00","Aoujai","ทำเพลง 1",6,8,"","","",""],["127","2026-10-29","18:00","Aoujai","ทำเพลง 1",7,8,"","","",""],["127","2026-11-05","18:00","Aoujai","ทำเพลง 1",8,8,"","","",""],["128","2026-09-08","21:00","Aoujai","ติวเทคโนโลยี",1,10,"","","",""],["128","2026-09-09","21:00","Aoujai","ติวเทคโนโลยี",2,10,"","","",""],["128","2026-09-15","21:00","Aoujai","ติวเทคโนโลยี",3,10,"","","",""],["128","2026-09-16","21:00","Aoujai","ติวเทคโนโลยี",4,10,"","","",""],["128","2026-09-22","21:00","Aoujai","ติวเทคโนโลยี",5,10,"","","",""],["128","2026-09-23","21:00","Aoujai","ติวเทคโนโลยี",6,10,"","","",""],["128","2026-09-29","21:00","Aoujai","ติวเทคโนโลยี",7,10,"","","",""],["128","2026-09-30","21:00","Aoujai","ติวเทคโนโลยี",8,10,"","","",""],["128","2026-10-06","21:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["128","2026-10-07","21:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["128","2026-09-06","15:00","Aoujai","ทำเพลง ใหม่",1,4,"","","",""],["128","2026-09-13","15:00","Aoujai","ทำเพลง ใหม่",2,4,"","","",""],["128","2026-09-20","15:00","Aoujai","ทำเพลง ใหม่",3,4,"","","",""],["128","2026-09-27","15:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["125","2026-08-29","20:00","Aoujai","ทำเพลง ใหม่",1,4,"Present","เดี่ยว","",""],["125","2026-09-03","20:00","Aoujai","ทำเพลง ใหม่",2,4,"Present","เดี่ยว","",""],["125","2026-09-12","20:00","Aoujai","ทำเพลง ใหม่",3,4,"","","",""],["125","2026-09-19","20:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""],["130","2026-08-26","18:00","Aoujai","ติวเทคโนโลยี",1,10,"Present","เดี่ยว","",""],["130","2026-09-02","18:00","Aoujai","ติวเทคโนโลยี",2,10,"Present","เดี่ยว","",""],["130","2026-09-09","18:00","Aoujai","ติวเทคโนโลยี",3,10,"","","",""],["130","2026-09-16","18:00","Aoujai","ติวเทคโนโลยี",4,10,"","","",""],["130","2026-09-23","18:00","Aoujai","ติวเทคโนโลยี",5,10,"","","",""],["130","2026-09-30","18:00","Aoujai","ติวเทคโนโลยี",6,10,"","","",""],["130","2026-10-07","18:00","Aoujai","ติวเทคโนโลยี",7,10,"","","",""],["130","2026-10-14","18:00","Aoujai","ติวเทคโนโลยี",8,10,"","","",""],["130","2026-10-21","18:00","Aoujai","ติวเทคโนโลยี",9,10,"","","",""],["130","2026-10-28","18:00","Aoujai","ติวเทคโนโลยี",10,10,"","","",""],["130","2026-09-08","18:00","Aoujai","ทำเพลง ใหม่",1,4,"","","",""],["130","2026-09-13","18:00","Aoujai","ทำเพลง ใหม่",2,4,"","","",""],["130","2026-09-15","18:00","Aoujai","ทำเพลง ใหม่",3,4,"","","",""],["130","2026-09-17","18:00","Aoujai","ทำเพลง ใหม่",4,4,"","","",""]],"avail":[["Monday","Aoujai","18:00","21:00"],["Tuesday","Aoujai","18:00","21:00"],["Wednesday","Aoujai","18:00","21:00"],["Thursday","Aoujai","18:00","21:00"],["Friday","Aoujai","18:00","21:00"],["Saturday","Aoujai","11:00","21:00"],["Sunday","Aoujai","11:00","21:00"],["Monday","Jingle","08:00","23:00"],["Tuesday","Jingle","08:00","23:00"],["Wednesday","Jingle","08:00","23:00"],["Thursday","Jingle","08:00","23:00"],["Friday","Jingle","08:00","23:00"],["Saturday","Jingle","08:00","23:00"],["Sunday","Jingle","08:00","23:00"],["Monday","Peem","17:00","22:00"],["Tuesday","Peem","19:00","22:00"],["Wednesday","Peem","10:00","22:00"],["Thursday","Peem","10:00","22:00"],["Friday","Peem","20:00","22:00"],["Saturday","Peem","12:00","22:00"],["Sunday","Peem","12:00","19:00"],["Monday","Miu","18:00","22:00"],["Tuesday","Miu","18:00","22:00"],["Wednesday","Miu","18:00","22:00"],["Thursday","Miu","18:00","22:00"],["Friday","Miu","18:00","22:00"],["Saturday","Miu","13:00","22:00"],["Sunday","Miu","15:00","22:00"],["Monday","Guy","",""],["Tuesday","Guy","",""],["Wednesday","Guy","",""],["Thursday","Guy","",""],["Friday","Guy","",""],["Saturday","Guy","",""],["Sunday","Guy","",""]]};

// ใบเซอร์: ค่าตั้งต้นนับคอร์ส "ทำเพลง" กับ "Mix & Mastering" (คอร์สติวไม่นับ) — แก้เองได้ในหลังบ้าน
const certEligible = (name = "") => !name.includes("ติว") && (name.includes("ทำเพลง") || name.toLowerCase().includes("mix"));
const CERT_TARGET = 3;
const COURSES = DATA.courses.map(([name, price, sessions, rate]) => ({ id: name, name, price, sessions, rate, cost: 0, cert: certEligible(name), discount: 0 }));
const TEACHERS = DATA.teachers.map(([name, status]) => ({ id: name, name, status }));
const AVAIL = DATA.avail; // [DOW, ครู, from, to]

const today = new Date(); today.setHours(0, 0, 0, 0);
const d = (offset, h) => { const x = new Date(today); x.setDate(x.getDate() + offset); x.setHours(h, 0, 0, 0); return x; };
const mkDate = (ymd, hm) => { const [y, m, dd] = ymd.split("-").map(Number); const [h, mi] = (hm || "0:00").split(":").map(Number); return new Date(y, m - 1, dd, h, mi, 0, 0); };

let seq = 10000 + Math.floor(Date.now() % 1e7);
const INITIAL_SESSIONS = DATA.sessions.map(([id, date, time, teacher, course, n, total, status, cls, score, note]) => ({
  id: "x" + seq++, studentId: id, at: mkDate(date, time), done: status === "Present", absent: status === "Absent",
  teacher, course, n, total, cls, score, note, noTime: !time,
}));

const PURCHASES = DATA.purchases.map(([id, date, course, price, status, start, teacher, total, time]) => ({ studentId: id, date, course, price, status, start, teacher, total, time }));

const INITIAL_STUDENTS = DATA.students.map(([id, nick, first, last, phone, line, fb, ig]) => {
  const buys = PURCHASES.filter((b) => b.studentId === id).sort((a, b) => a.date.localeCompare(b.date));
  const own = INITIAL_SESSIONS.filter((x) => x.studentId === id).sort((a, b) => a.at - b.at);
  const latest = own.at(-1);
  const lastBuy = buys.at(-1);
  return {
    id, nick: nick || "-", first, last, phone, line, fb, ig,
    teacher: latest?.teacher || lastBuy?.teacher || "",
    course: latest?.course || lastBuy?.course || "",
    cls: latest?.cls || "",
    purchases: buys,
  };
});

const thDate = (x) => x.toLocaleDateString("th-TH", { weekday: "short", day: "numeric", month: "short" });
const thTime = (x) => x.toLocaleTimeString("th-TH", { hour: "2-digit", minute: "2-digit" }) + " น.";
const baht = (n) => "฿" + n.toLocaleString("th-TH");

// ─── โลโก้ ─────────────────────────────────────────────────────
function Logo({ size = 22 }) {
  const O = ({ Icon }) => (
    <span className="inline-flex items-center justify-center rounded-full bg-white align-middle"
      style={{ width: size * 1.05, height: size * 1.05, color: BLUE, margin: "0 1px" }}>
      <Icon size={size * 0.6} strokeWidth={2.6} />
    </span>
  );
  return (
    <div className="font-black leading-none text-white select-none" style={{ fontSize: size, letterSpacing: "-0.02em" }}>
      <div>T<O Icon={Volume2} />DAY</div>
      <div>WHAT</div>
      <div>T<O Icon={Volume2} />D<O Icon={SlidersVertical} /></div>
    </div>
  );
}

// ─── App ───────────────────────────────────────────────────────
const PIN = import.meta.env.VITE_ADMIN_PIN || "";

export default function App() {
  if (typeof window !== "undefined" && window.location.pathname.replace(/\/$/, "") === "/join") return <JoinPage />;
  return <AdminApp />;
}

// ─── หน้าสมัครสำหรับเด็ก (ไม่ต้องใส่ PIN) ─────────────────────────
function JoinPage() {
  const [f, setF] = useState({ nick: "", first: "", last: "", phone: "", line: "", fb: "", ig: "", note: "" });
  const [state, setState] = useState("idle"); // idle | sending | done | error
  const set = (k) => (e) => setF({ ...f, [k]: e.target.value });
  const submit = async () => {
    if (!f.nick.trim() || !f.phone.trim()) { setState("missing"); return; }
    setState("sending");
    try { await submitRegistration(f); setState("done"); } catch (e) { console.error(e); setState("error"); }
  };
  const inp = (k, label, ph, extra = {}) => (
    <label className="block">
      <div className="mb-1 text-xs font-medium text-slate-600">{label}</div>
      <input value={f[k]} onChange={set(k)} placeholder={ph} className="w-full rounded-lg px-3 py-2 text-sm" style={{ ...font, border: "1px solid #D7E0F3", background: "#FAFBFF" }} {...extra} />
    </label>
  );
  return (
    <div className="min-h-screen" style={{ ...font, background: BLUE, color: INK }}>
      <div className="mx-auto max-w-md px-4 py-6">
        <div className="text-white"><Logo size={18} /></div>
        <div className="mt-4 overflow-hidden rounded-3xl bg-white">
          <div className="px-5 pt-5 text-white" style={{ background: BLUE }}>
            <div className="text-lg font-bold">ยินดีต้อนรับ 🎧</div>
            <div className="pb-5 text-sm text-white/80">กรอกข้อมูลนิดหน่อยแล้วเจอกันในคลาสครับ</div>
          </div>
          {state === "done" ? (
            <div className="p-6 text-center">
              <div className="mx-auto mb-3 flex h-14 w-14 items-center justify-center rounded-full" style={{ background: "#E6F6EA", color: "#1B7A3A" }}><Check size={28} /></div>
              <div className="text-lg font-bold">ส่งข้อมูลเรียบร้อย</div>
              <div className="mt-1 text-sm text-slate-500">ขอบคุณครับ {f.nick} เดี๋ยวทางโรงเรียนจะติดต่อกลับเพื่อนัดวันเวลาเรียน</div>
            </div>
          ) : (
            <div className="space-y-3 p-5">
              {inp("nick", "ชื่อเล่น *", "เช่น ซี")}
              <div className="grid grid-cols-2 gap-2">{inp("first", "ชื่อจริง", "")}{inp("last", "นามสกุล", "")}</div>
              {inp("phone", "เบอร์โทร *", "08x-xxx-xxxx", { inputMode: "tel" })}
              {inp("line", "LINE ID", "")}
              {inp("fb", "Facebook", "ชื่อหรือลิงก์")}
              {inp("ig", "Instagram", "@")}
              {inp("note", "อยากเรียนอะไร / วันเวลาที่สะดวก", "เช่น ทำเพลง เสาร์บ่าย")}
              {state === "missing" && <div className="text-xs" style={{ color: "#B42318" }}>กรอกชื่อเล่นและเบอร์โทรด้วยนะครับ</div>}
              {state === "error" && <div className="text-xs" style={{ color: "#B42318" }}>ส่งไม่สำเร็จ ลองใหม่อีกครั้ง หรือทักไลน์โรงเรียนได้เลยครับ</div>}
              <button onClick={submit} disabled={state === "sending"} className="mt-1 w-full rounded-xl py-3 font-semibold text-white disabled:opacity-60" style={{ background: BLUE }}>
                {state === "sending" ? "กำลังส่ง…" : "ส่งข้อมูล"}
              </button>
            </div>
          )}
        </div>
        <div className="mt-4 text-center text-xs text-white/70">Today What Todo · Sound With Today</div>
      </div>
    </div>
  );
}

function AdminApp() {
  const [ok, setOk] = useState(() => !PIN || sessionStorage.getItem("twt-ok") === "1");
  const [pin, setPin] = useState("");
  const [err, setErr] = useState(false);
  const [initial, setInitial] = useState(undefined); // undefined = กำลังโหลด, null = ยังไม่มีข้อมูลบนคลาวด์
  const [loadErr, setLoadErr] = useState("");

  useEffect(() => {
    if (!ok) return;
    loadState().then((st) => setInitial(st)).catch((e) => { setLoadErr(String(e.message || e)); setInitial(null); });
  }, [ok]);

  if (!ok) return (
    <div className="flex min-h-screen items-center justify-center p-6" style={{ ...font, background: BLUE }}>
      <div className="w-full max-w-xs rounded-2xl bg-white p-6 text-center" style={{ color: INK }}>
        <div className="mx-auto mb-3 flex h-12 w-12 items-center justify-center rounded-full" style={{ background: BLUE_SOFT, color: BLUE }}><Lock size={22} /></div>
        <div className="text-lg font-bold">Today What Todo</div>
        <div className="mb-4 text-sm text-slate-500">ใส่รหัสเพื่อเข้าหลังบ้าน</div>
        <input type="password" inputMode="numeric" value={pin} onChange={(e) => { setPin(e.target.value); setErr(false); }}
          onKeyDown={(e) => { if (e.key === "Enter") { if (pin === PIN) { sessionStorage.setItem("twt-ok", "1"); setOk(true); } else setErr(true); } }}
          className="w-full rounded-xl px-3 py-2 text-center text-lg tracking-widest" style={{ border: `2px solid ${err ? "#B42318" : "#D7E0F3"}` }} autoFocus />
        <button onClick={() => { if (pin === PIN) { sessionStorage.setItem("twt-ok", "1"); setOk(true); } else setErr(true); }}
          className="mt-3 w-full rounded-xl py-2.5 font-semibold text-white" style={{ background: BLUE }}>เข้าใช้งาน</button>
        {err && <div className="mt-2 text-xs" style={{ color: "#B42318" }}>รหัสไม่ถูกต้อง</div>}
      </div>
    </div>
  );

  if (initial === undefined) return (
    <div className="flex min-h-screen items-center justify-center" style={{ ...font, background: "#F4F7FD", color: INK }}>
      <div className="text-sm text-slate-500">กำลังโหลดข้อมูล…</div>
    </div>
  );

  return <Dashboard initial={initial} loadErr={loadErr} />;
}

function Dashboard({ initial, loadErr }) {
  const [tab, setTab] = useState("schedule");
  const [rawStudents, setStudents] = useState(initial?.students || INITIAL_STUDENTS);
  const [sessions, setSessions] = useState(initial?.sessions || INITIAL_SESSIONS);
  const [courses, setCourses] = useState(initial?.courses || COURSES);
  const [teachers, setTeachers] = useState(initial?.teachers || TEACHERS);
  const [saveStatus, setSaveStatus] = useState(loadErr ? "error" : "saved"); // saved | saving | error
  const firstRun = useRef(true);

  const addTeacher = (name) => {
    const n = name.trim();
    if (!n) return;
    if (teachers.some((t) => t.id.toLowerCase() === n.toLowerCase())) { say("มีครูชื่อนี้อยู่แล้ว"); return; }
    setTeachers((all) => [...all, { id: n, name: n, status: "Active" }]);
    say(`เพิ่มครู ${n} แล้ว`);
  };
  const removeTeacher = (id) => {
    const used = sessions.some((x) => x.teacher === id);
    if (used) {
      setTeachers((all) => all.map((t) => (t.id === id ? { ...t, status: t.status === "Active" ? "Inactive" : "Active" } : t)));
      say("ครูคนนี้มีประวัติสอนอยู่ ลบไม่ได้ จึงสลับสถานะใช้งาน/พักไว้แทน");
    } else {
      setTeachers((all) => all.filter((t) => t.id !== id));
      say("ลบครูแล้ว");
    }
  };
  const removeStudent = (id) => {
    setSessions((all) => all.filter((x) => x.studentId !== id));
    setStudents((all) => all.filter((x) => x.id !== id));
    setOpen(null);
    say("ลบนักเรียนและคาบเรียนทั้งหมดของเขาแล้ว");
  };
  const addStudent = (f, openAfter = false) => {
    const nums = rawStudents.map((x) => Number(x.id)).filter((n) => !isNaN(n));
    const id = String((nums.length ? Math.max(...nums) : 0) + 1).padStart(3, "0");
    setStudents((all) => [{ id, nick: f.nick || "-", first: f.first || "", last: f.last || "", phone: f.phone || "", line: f.line || "", fb: f.fb || "", ig: f.ig || "", teacher: "", course: "", cls: "", purchases: [] }, ...all]);
    say(`เพิ่มนักเรียน ${f.nick} (#${id}) แล้ว`);
    if (openAfter) { setTab("students"); setOpen(id); }
    return id;
  };
  const certOf = (courseId) => !!courses.find((c) => c.id === courseId)?.cert;
  // นับต่อคอร์ส/ใบเซอร์จากประวัติซื้อ + ตั้งค่าคอร์สปัจจุบัน (เปลี่ยนติ๊กในหลังบ้านแล้วอัปเดตทันที)
  const students = useMemo(() => rawStudents.map((st) => ({
    ...st,
    renewCount: Math.max(0, (st.purchases?.length || 0) - 1),
    certCount: (st.purchases || []).filter((b) => certOf(b.course)).length,
  })), [rawStudents, courses]);

  // เปลี่ยนครูสอนแทนเฉพาะคาบเดียว (จำครูเดิมไว้ใน origTeacher)
  const setSessionTeacher = (sessionId, teacher) => {
    setSessions((all) => all.map((x) => {
      if (x.id !== sessionId) return x;
      const orig = x.origTeacher ?? x.teacher;
      return { ...x, teacher, origTeacher: teacher === orig ? undefined : orig };
    }));
    say(`เปลี่ยนครูสอนคาบนี้เป็น ${teacher}`);
  };
  const [open, setOpen] = useState(null); // student id
  const [teacherFilter, setTeacherFilter] = useState("all");
  const [studentFilter, setStudentFilter] = useState("all");
  const [jumpTo, setJumpTo] = useState(null); // วันที่ให้ตารางกระโดดไป

  const [schedOpen, setSchedOpen] = useState(false);
  const openWithSchedule = (id) => { setSchedOpen(true); setOpen(id); };

  // จัดคาบเรียนใหม่ให้เด็ก: สร้างคาบสัปดาห์ละครั้งตามจำนวนที่เลือก
  const scheduleCourse = (id, { course, teacher, date, time, count }) => {
    const [h, m] = time.split(":").map(Number);
    const start = new Date(date + "T00:00:00");
    const already = sessions.filter((x) => x.studentId === id && x.course === course).length;
    const added = Array.from({ length: count }, (_, i) => {
      const at = new Date(start); at.setDate(at.getDate() + 7 * i); at.setHours(h, m, 0, 0);
      return { id: "x" + seq++, studentId: id, at, done: false, teacher, course, n: already + i + 1, total: already + count, cls: "เดี่ยว" };
    });
    setSessions((all) => [...all, ...added]);
    setStudents((all) => all.map((x) => (x.id === id ? { ...x, course, teacher } : x)));
    setSchedOpen(false);
    say(`จัดคาบ ${course} ให้แล้ว ${count} คาบ เริ่ม ${thDate(start)} ${time} น.`);
  };

  const showStudentSchedule = (id) => {
    const own = sessions.filter((x) => x.studentId === id).sort((a, b) => a.at - b.at);
    const next = own.find((x) => !x.done && x.at >= today) || own.at(-1);
    setStudentFilter(id); setTeacherFilter("all"); setJumpTo(next ? next.at : today); setTab("schedule"); setOpen(null);
  };
  const [toast, setToast] = useState("");
  // กติกาส่วนกลาง: ไม่มาเรียนเกิน N เดือน → คาบที่เหลือถูกยกเข้าส่วนกลาง คาบละ 400
  const [rule, setRule] = useState(initial?.rule || { months: 3, perSession: 400 });

  // บันทึกอัตโนมัติทุกครั้งที่ข้อมูลเปลี่ยน (หน่วง 0.8 วิ)
  useEffect(() => {
    if (firstRun.current) { firstRun.current = false; return; }
    setSaveStatus("saving");
    const t = setTimeout(() => {
      saveState({ students: rawStudents, sessions, courses, teachers, rule })
        .then(() => setSaveStatus("saved"))
        .catch((e) => { console.error(e); setSaveStatus("error"); });
    }, 800);
    return () => clearTimeout(t);
  }, [rawStudents, sessions, courses, teachers, rule]);

  const pool = useMemo(() => {
    const m = new Map();
    students.forEach((st) => {
      const own = sessions.filter((x) => x.studentId === st.id);
      const doneList = own.filter((x) => x.done);
      const lastDone = doneList.length ? new Date(Math.max(...doneList.map((x) => x.at))) : null;
      const remaining = own.filter((x) => !x.done);
      const monthsIdle = lastDone ? (today - lastDone) / (1000 * 60 * 60 * 24 * 30.44) : 0;
      const auto = lastDone && monthsIdle >= rule.months && remaining.length > 0;
      const forfeited = !st.exempt && (st.forced || auto) ? remaining : [];
      m.set(st.id, { lastDone, monthsIdle: Math.floor(monthsIdle), remaining: remaining.length, forfeited, auto,
        amount: forfeited.length * rule.perSession });
    });
    return m;
  }, [students, sessions, rule]);
  // เด็กที่ยังไม่มีคาบล่วงหน้า แต่ยังถือว่าเรียนอยู่ (ซื้อคอร์ส/เรียนล่าสุดภายใน 3 เดือน)
  const needSchedule = useMemo(() => {
    const cutoff = new Date(today); cutoff.setMonth(cutoff.getMonth() - 3);
    const cutoffStr = toInput(cutoff);
    return students.filter((st) => {
      if (st.forced || pool.get(st.id)?.forfeited.length > 0) return false; // ยกเข้าส่วนกลางแล้ว = ไม่ต้องจัดคาบ
      const own = sessions.filter((x) => x.studentId === st.id);
      if (own.some((x) => !x.done && x.at >= today)) return false;
      const doneList = own.filter((x) => x.done);
      const lastDone = doneList.length ? new Date(Math.max(...doneList.map((x) => x.at))) : null;
      const recentBuy = st.purchases?.some((b) => b.date >= cutoffStr);
      const recentBuyUnfinished = st.purchases?.some((b) => b.date >= cutoffStr && own.filter((x) => x.course === b.course && x.done).length < (b.total || 0));
      return recentBuyUnfinished || (lastDone && lastDone >= cutoff && own.some((x) => !x.done));
    });
  }, [students, sessions, pool]);

  const forfeitedIds = useMemo(() => new Set([...pool.values()].flatMap((v) => v.forfeited.map((x) => x.id))), [pool]);
  const setFlag = (id, patch) => setStudents((all) => all.map((x) => (x.id === id ? { ...x, ...patch } : x)));

  const say = (m) => { setToast(m); setTimeout(() => setToast(""), 2200); };

  const student = students.find((s) => s.id === open);
  const byStudent = (id) => sessions.filter((s) => s.studentId === id).sort((a, b) => a.at - b.at);

  // ปุ่มลา: เลื่อนคาบถัดไปที่ยังไม่เรียน ไปอีก 7 วัน
  const leave = (id, course) => {
    const next = byStudent(id).find((s) => !s.done && (!course || s.course === course));
    if (!next) return;
    setSessions((all) => all.map((s) => {
      if (s.id !== next.id) return s;
      const at = new Date(s.at); at.setDate(at.getDate() + 7);
      return { ...s, at };
    }));
    say("ลาแล้ว เลื่อนคาบไปสัปดาห์หน้า");
  };

  const changeDate = (sessionId, dateValue, timeValue) => {
    setSessions((all) => all.map((s) => {
      if (s.id !== sessionId) return s;
      const at = dateValue ? new Date(dateValue + "T00:00:00") : new Date(s.at);
      const [h, m] = (timeValue || `${s.at.getHours()}:${s.at.getMinutes()}`).split(":").map(Number);
      at.setHours(h, m, 0, 0);
      return { ...s, at, noTime: false };
    }));
    say("เปลี่ยนวัน/เวลาแล้ว");
  };

  const deleteSession = (sessionId) => { setSessions((all) => all.filter((x) => x.id !== sessionId)); say("ลบคาบแล้ว"); };
  const deleteRemaining = (id, course) => {
    const n = sessions.filter((x) => x.studentId === id && x.course === course && !x.done).length;
    setSessions((all) => all.filter((x) => !(x.studentId === id && x.course === course && !x.done)));
    say(`ลบคาบที่ยังไม่เรียนของ ${course} แล้ว ${n} คาบ`);
  };
  const deletePurchase = (id, index) => {
    setStudents((all) => all.map((x) => (x.id === id ? { ...x, purchases: x.purchases.filter((_, i) => i !== index) } : x)));
    say("ลบรายการซื้อคอร์สแล้ว");
  };
  const markDone = (sessionId) =>
    setSessions((all) => all.map((s) => (s.id === sessionId ? { ...s, done: !s.done } : s)));

  // ต่อคอร์ส: สร้างคาบใหม่ต่อจากคาบสุดท้าย สัปดาห์ละครั้ง
  const renew = (id, courseId, discountPct = 0) => {
    const course = courses.find((c) => c.id === courseId);
    const price = Math.round((course.price || 0) * (1 - discountPct / 100));
    const last = byStudent(id).at(-1);
    const base = last ? last.at : today;
    const added = Array.from({ length: course.sessions }, (_, i) => {
      const at = new Date(base); at.setDate(at.getDate() + 7 * (i + 1));
      const st = students.find((x) => x.id === id);
      return { id: "x" + seq++, studentId: id, at, done: false, teacher: st.teacher, course: courseId, n: i + 1, total: course.sessions };
    });
    setSessions((all) => [...all, ...added]);
    setStudents((all) => all.map((s) => (s.id === id ? {
      ...s, course: courseId,
      purchases: [...(s.purchases || []), { studentId: id, date: toInput(today), course: courseId, price, status: "Confirmed", start: toInput(added[0].at), teacher: s.teacher, total: course.sessions, time: "", discount: discountPct }],
    } : s)));
    say(`ต่อคอร์ส ${course.name} ${discountPct ? `ลด ${discountPct}% ` : ""}= ${baht(price)} เพิ่ม ${course.sessions} คาบแล้ว`);
  };

  return (
    <div className="min-h-screen" style={{ ...font, background: "#F4F7FD", color: INK }}>
      <link href="https://fonts.googleapis.com/css2?family=Prompt:wght@400;500;600;800&display=swap" rel="stylesheet" />

      {/* Header */}
      <header className="px-4 pt-5 pb-4" style={{ background: BLUE }}>
        <div className="mx-auto flex max-w-6xl items-end justify-between">
          <Logo />
          <div className="text-right text-white/80 text-sm">
            <div className="font-semibold text-white">Sound With Today</div>
            <div>สอนทำเพลง · นักเรียนทั้งหมด {students.length} คน</div>
            <div className="mt-0.5 flex items-center justify-end gap-1 text-xs">
              {saveStatus === "error" ? <><CloudOff size={12} /> บันทึกไม่สำเร็จ</> : saveStatus === "saving" ? <><Cloud size={12} /> กำลังบันทึก…</> : <><Cloud size={12} /> {mode === "supabase" ? "บันทึกบนคลาวด์แล้ว" : "บันทึกในเครื่องนี้"}</>}
            </div>
          </div>
        </div>
      </header>

      {/* Tabs */}
      <nav className="sticky top-0 z-10 px-4" style={{ background: BLUE_DARK }}>
        <div className="mx-auto flex max-w-6xl">
          {[
            ["schedule", CalendarDays, "ตารางสอน"],
            ["students", Users, "นักเรียน"],
            ["admin", Wallet, "หลังบ้าน"],
            ["form", Link2, "ลิงก์สมัคร"],
          ].map(([k, Icon, label]) => (
            <button key={k} onClick={() => setTab(k)}
              className="flex flex-1 flex-col items-center gap-1 py-2.5 text-xs font-medium text-white/70"
              style={tab === k ? { color: "#fff", boxShadow: "inset 0 -3px 0 #fff" } : {}}>
              <Icon size={18} />{label}
            </button>
          ))}
        </div>
      </nav>

      <main className="mx-auto max-w-6xl px-4 py-5 pb-24">
        {tab === "schedule" && (
          <WeekGrid sessions={sessions} students={students} forfeitedIds={forfeitedIds}
            teacherFilter={teacherFilter} setTeacherFilter={setTeacherFilter}
            studentFilter={studentFilter} setStudentFilter={setStudentFilter}
            jumpTo={jumpTo} onPick={setOpen} needSchedule={needSchedule} onSchedule={openWithSchedule} teachers={teachers.filter((t) => t.status === "Active")} />
        )}

        {tab === "students" && (
          <StudentsTab students={students} sessions={sessions} pool={pool} onPick={setOpen} onAdd={(f, open) => addStudent(f, open)} />
        )}

        {tab === "admin" && <Admin students={students} sessions={sessions} courses={courses} setCourses={setCourses} teachers={teachers} onAddTeacher={addTeacher} onRemoveTeacher={removeTeacher} pool={pool} rule={rule} setRule={setRule} onPick={setOpen} say={say} />}
        {tab === "form" && <FormPreview say={say} onImport={(r) => addStudent(r, true)} />}
      </main>

      {student && (
        <Profile student={student} sessions={byStudent(student.id)} info={pool.get(student.id)} rule={rule} courses={courses} teachers={teachers}
          onRemove={() => removeStudent(student.id)}
          needsSchedule={needSchedule.some((x) => x.id === student.id)} schedOpen={schedOpen} setSchedOpen={setSchedOpen}
          onSchedule={(form) => scheduleCourse(student.id, form)}
          onTeacher={setSessionTeacher} onShowSchedule={() => showStudentSchedule(student.id)}
          onDeleteSession={deleteSession} onDeleteRemaining={(c) => deleteRemaining(student.id, c)} onDeletePurchase={(i) => deletePurchase(student.id, i)}
          onExempt={() => { setFlag(student.id, { exempt: !student.exempt, forced: false }); say(student.exempt ? "กลับมาใช้กติกาส่วนกลางตามปกติ" : "คืนคาบให้แล้ว ไม่หักเข้าส่วนกลาง"); }}
          onForce={() => { setFlag(student.id, { forced: !student.forced, exempt: false }); say(student.forced ? "ยกเลิกการยกเข้าส่วนกลาง" : "ยกคาบที่เหลือเข้าส่วนกลางแล้ว"); }}
          onClose={() => { setOpen(null); setSchedOpen(false); }}
          onLeave={(course) => leave(student.id, course)} onChangeDate={changeDate} onDone={markDone} onRenew={(c, disc) => renew(student.id, c, disc)} />
      )}

      {toast && (
        <div className="fixed bottom-6 left-1/2 z-30 -translate-x-1/2 rounded-full px-4 py-2 text-sm font-medium text-white shadow-lg" style={{ background: INK }}>
          {toast}
        </div>
      )}
    </div>
  );
}


// ─── ตารางสอนรายสัปดาห์ ─────────────────────────────────────────
const DAY_TH = ["จันทร์", "อังคาร", "พุธ", "พฤหัส", "ศุกร์", "เสาร์", "อาทิตย์"];
// สีประจำวันแบบไทย: หัวคอลัมน์ / ตัวหนังสือบนหัว / สีพื้นจางในช่อง
const DAY_COLORS = [
  { head: "#F7C948", text: "#3D2E00", tint: "#FFFBEB" }, // จันทร์ เหลือง
  { head: "#F48FB1", text: "#4A0F2A", tint: "#FFF1F6" }, // อังคาร ชมพู
  { head: "#5CB85C", text: "#0B3A0B", tint: "#EEF9EE" }, // พุธ เขียว
  { head: "#F5923E", text: "#3F1E00", tint: "#FFF4EA" }, // พฤหัส ส้ม
  { head: "#4FB3E8", text: "#032B44", tint: "#EDF7FD" }, // ศุกร์ ฟ้า
  { head: "#9C6ADE", text: "#26074A", tint: "#F4EEFC" }, // เสาร์ ม่วง
  { head: "#E5533D", text: "#3F0A03", tint: "#FDEEEC" }, // อาทิตย์ แดง
];
const mondayOf = (x) => { const m = new Date(x); const wd = (m.getDay() + 6) % 7; m.setDate(m.getDate() - wd); m.setHours(0, 0, 0, 0); return m; };
const toInput = (x) => `${x.getFullYear()}-${String(x.getMonth() + 1).padStart(2, "0")}-${String(x.getDate()).padStart(2, "0")}`;
const slotKey = (x) => `${x.getHours()}:${x.getMinutes() < 30 ? "00" : "30"}`;

function WeekGrid({ sessions, students, forfeitedIds, teacherFilter, setTeacherFilter, studentFilter, setStudentFilter, jumpTo, onPick, needSchedule, onSchedule, teachers }) {
  const [weekStart, setWeekStart] = useState(() => mondayOf(today));
  const [q, setQ] = useState("");
  useEffect(() => { if (jumpTo) setWeekStart(mondayOf(jumpTo)); }, [jumpTo]);
  const focus = students.find((x) => x.id === studentFilter);
  const focusSessions = useMemo(() => focus ? sessions.filter((x) => x.studentId === focus.id).sort((a, b) => a.at - b.at) : [], [sessions, focus]);
  const byTeacher = useMemo(() => { const m = {}; focusSessions.forEach((x) => { m[x.teacher || "-"] = (m[x.teacher || "-"] || 0) + 1; }); return m; }, [focusSessions]);
  const jumpSession = (dir) => {
    const list = dir > 0 ? focusSessions.filter((x) => x.at >= weekEnd) : [...focusSessions].reverse().filter((x) => x.at < weekStart);
    if (list[0]) setWeekStart(mondayOf(list[0].at));
  };
  const options = students.filter((x) => !q || `${x.id} ${x.nick} ${x.first}`.toLowerCase().includes(q.toLowerCase()));
  const [range, setRange] = useState("full"); // full | evening
  const days = Array.from({ length: 7 }, (_, i) => { const x = new Date(weekStart); x.setDate(x.getDate() + i); return x; });
  const weekEnd = new Date(days[6]); weekEnd.setDate(weekEnd.getDate() + 1);

  const startHour = range === "evening" ? 16 : 8;
  const slots = [];
  for (let h = startHour; h <= 22; h++) { slots.push(`${h}:00`); slots.push(`${h}:30`); }

  const cell = useMemo(() => {
    const m = new Map();
    sessions.forEach((s) => {
      if (s.at < weekStart || s.at >= weekEnd) return;
      const st = students.find((x) => x.id === s.studentId);
      if (!st || s.noTime || (teacherFilter !== "all" && (s.teacher || st.teacher) !== teacherFilter)) return;
      if (studentFilter !== "all" && s.studentId !== studentFilter) return;
      const k = `${(s.at.getDay() + 6) % 7}|${slotKey(s.at)}`; // ครูที่ใช้กรองคือครูของคาบนั้น (รวมสอนแทน)
      m.set(k, [...(m.get(k) || []), { ...s, student: st }]);
    });
    return m;
  }, [sessions, students, teacherFilter, studentFilter, weekStart]);

  const shift = (n) => setWeekStart((w) => { const x = new Date(w); x.setDate(x.getDate() + 7 * n); return x; });
  const isToday = (x) => x.toDateString() === today.toDateString();
  const fmt = (x) => x.toLocaleDateString("th-TH", { day: "numeric", month: "short" });

  return (
    <div>
      {needSchedule.length > 0 && (
        <div className="mb-3 rounded-2xl px-3 py-2.5" style={{ background: "#FFF3D6", border: "1px solid #F5D488" }}>
          <div className="text-sm font-semibold" style={{ color: "#7A4B00" }}>ยังไม่ได้จัดคาบเรียน {needSchedule.length} คน — แตะชื่อเพื่อเลือกคอร์ส วัน เวลา</div>
          <div className="mt-1.5 flex flex-wrap gap-1.5">
            {needSchedule.map((st) => (
              <button key={st.id} onClick={() => onSchedule(st.id)} className="rounded-full bg-white px-2.5 py-1 text-xs font-medium" style={{ border: "1px solid #F5D488", color: "#7A4B00" }}>
                {st.nick} {st.first} <span className="opacity-60">#{st.id}</span>
              </button>
            ))}
          </div>
        </div>
      )}
      {/* แถบควบคุม */}
      <div className="mb-3 flex flex-wrap items-center gap-2">
        <div className="flex items-center overflow-hidden rounded-xl bg-white" style={{ border: "1px solid #D7E0F3" }}>
          <button onClick={() => shift(-1)} className="px-3 py-2 text-sm font-semibold" style={{ color: BLUE }}>‹</button>
          <input type="date" value={toInput(weekStart)} onChange={(e) => e.target.value && setWeekStart(mondayOf(new Date(e.target.value)))}
            className="px-2 py-1.5 text-sm outline-none" style={{ ...font, borderLeft: "1px solid #D7E0F3", borderRight: "1px solid #D7E0F3" }} />
          <button onClick={() => shift(1)} className="px-3 py-2 text-sm font-semibold" style={{ color: BLUE }}>›</button>
        </div>
        <button onClick={() => setWeekStart(mondayOf(today))} className="rounded-xl bg-white px-3 py-2 text-sm font-medium" style={{ border: "1px solid #D7E0F3", color: BLUE }}>สัปดาห์นี้</button>
        <button onClick={() => { const last = [...sessions].sort((a, b) => b.at - a.at)[0]; if (last) setWeekStart(mondayOf(last.at)); }}
          className="rounded-xl bg-white px-3 py-2 text-sm font-medium" style={{ border: "1px solid #D7E0F3", color: BLUE }}>คาบล่าสุดในชีต</button>

        <select value={teacherFilter} onChange={(e) => setTeacherFilter(e.target.value)}
          className="rounded-xl bg-white px-3 py-2 text-sm font-medium" style={{ ...font, border: "1px solid #D7E0F3" }}>
          <option value="all">ครูทุกคน</option>
          {teachers.map((t) => <option key={t.id} value={t.id}>{t.name}</option>)}
        </select>

        <select value={range} onChange={(e) => setRange(e.target.value)}
          className="rounded-xl px-3 py-2 text-sm font-medium" style={{ ...font, background: "#E6F6EA", color: "#1B7A3A", border: "1px solid #BFE6C9" }}>
          <option value="full">เต็มวัน 08:00–22:30</option>
          <option value="evening">ช่วงเย็น 16:00–22:30</option>
        </select>

        <div className="ml-auto text-sm text-slate-500">{fmt(days[0])} – {fmt(days[6])}</div>
      </div>

      {/* ดูตารางรายคน */}
      <div className="mb-3 rounded-2xl bg-white p-3" style={{ border: "1px solid #D7E0F3" }}>
        <div className="flex flex-wrap items-center gap-2">
          <span className="text-sm font-semibold" style={{ color: BLUE }}>ตารางของเด็ก</span>
          <input value={q} onChange={(e) => setQ(e.target.value)} placeholder="พิมพ์ชื่อ/รหัส" className="rounded-full px-3 py-1.5 text-sm" style={{ ...font, border: "1px solid #D7E0F3", width: 140 }} />
          <select value={studentFilter} onChange={(e) => setStudentFilter(e.target.value)} className="rounded-full px-3 py-1.5 text-sm font-medium" style={{ ...font, border: "1px solid #D7E0F3", maxWidth: 220 }}>
            <option value="all">ทุกคน (ตารางครู)</option>
            {options.map((x) => <option key={x.id} value={x.id}>{x.nick}-{x.first} #{x.id}</option>)}
          </select>
          {focus && <button onClick={() => { setStudentFilter("all"); setQ(""); }} className="rounded-full px-3 py-1.5 text-sm" style={{ background: "#EEF2FA", color: INK }}>ล้าง</button>}
        </div>
        {focus && (
          <div className="mt-2 text-sm">
            <div className="flex flex-wrap items-center gap-2">
              <span className="font-semibold">{focus.nick}-{focus.first}</span>
              <span className="text-slate-500">{focusSessions.length} คาบ · เรียนแล้ว {focusSessions.filter((x) => x.done).length}</span>
              {Object.entries(byTeacher).map(([t, n]) => <span key={t} className="rounded-full px-2 py-0.5 text-xs" style={{ background: BLUE_SOFT, color: BLUE }}>{t} {n} คาบ</span>)}
              <span className="ml-auto flex gap-1">
                <button onClick={() => jumpSession(-1)} className="rounded-lg px-2 py-1 text-xs" style={{ background: "#EEF2FA" }}>‹ คาบก่อน</button>
                <button onClick={() => jumpSession(1)} className="rounded-lg px-2 py-1 text-xs" style={{ background: "#EEF2FA" }}>คาบถัดไป ›</button>
              </span>
            </div>
            <div className="mt-2 flex gap-1.5 overflow-x-auto pb-1">
              {focusSessions.filter((x) => !x.done && x.at >= today).slice(0, 12).map((x) => {
                const di = (x.at.getDay() + 6) % 7;
                return (
                  <button key={x.id} onClick={() => setWeekStart(mondayOf(x.at))} className="shrink-0 rounded-lg px-2 py-1 text-left text-xs" style={{ background: DAY_COLORS[di].tint, borderLeft: `3px solid ${DAY_COLORS[di].head}` }}>
                    <div className="font-semibold">{DAY_TH[di]} {fmt(x.at)}</div>
                    <div className="text-slate-600">{x.noTime ? "" : thTime(x.at)} · {x.teacher || "-"}</div>
                  </button>
                );
              })}
              {focusSessions.filter((x) => !x.done && x.at >= today).length === 0 && <span className="text-xs text-slate-500">ไม่มีคาบล่วงหน้า</span>}
            </div>
          </div>
        )}
      </div>

      {/* ตาราง */}
      <div className="overflow-auto rounded-2xl bg-white" style={{ border: "1px solid #D7E0F3", maxHeight: "72vh" }}>
        <table className="border-collapse text-sm" style={{ minWidth: 980 }}>
          <thead className="sticky top-0 z-10">
            <tr>
              <th className="sticky left-0 z-20 w-16 px-2 py-2 text-left font-semibold" style={{ background: BLUE, color: "#fff" }}>เวลา</th>
              {days.map((x, i) => (
                <th key={i} className="px-2 py-2 text-center font-semibold"
                  style={{ background: DAY_COLORS[i].head, color: DAY_COLORS[i].text, borderLeft: "1px solid rgba(255,255,255,.5)", minWidth: 128, boxShadow: isToday(x) ? `inset 0 -4px 0 ${DAY_COLORS[i].text}` : "none" }}>
                  <div>{DAY_TH[i]}{isToday(x) ? " · วันนี้" : ""}</div>
                  <div className="text-xs font-normal opacity-80">{fmt(x)}</div>
                </th>
              ))}
            </tr>
          </thead>
          <tbody>
            {slots.map((slot) => {
              const half = slot.endsWith(":30");
              return (
                <tr key={slot} style={{ borderTop: half ? "1px dashed #E5EBF7" : "1px solid #D7E0F3" }}>
                  <td className="sticky left-0 z-10 px-2 py-1 font-semibold" style={{ background: "#F4F7FD", color: half ? "#94A3B8" : INK, fontSize: 12 }}>
                    {slot.padStart(5, "0")}
                  </td>
                  {days.map((x, di) => {
                    const items = cell.get(`${di}|${slot}`) || [];
                    return (
                      <td key={di} className="px-1 py-0.5 align-top" style={{ borderLeft: "1px solid #EEF2FA", background: DAY_COLORS[di].tint, height: 34 }}>
                        {items.length === 0 ? <span className="block text-center text-slate-300">-</span> : items.map((s) => (
                          <button key={s.id} onClick={() => onPick(s.studentId)}
                            className="mb-0.5 block w-full rounded-lg px-2 py-1 text-left leading-tight"
                            style={forfeitedIds.has(s.id)
                              ? { background: "#FDE8E8", color: "#B42318", borderLeft: "3px solid #B42318" }
                              : { background: s.done ? "#EEF2FA" : "#fff", color: s.done ? "#64748B" : INK, borderLeft: `3px solid ${s.done ? "#94A3B8" : DAY_COLORS[di].head}`, boxShadow: "0 1px 0 rgba(0,0,0,.04)" }}>
                            <div className="font-semibold">{s.student.nick}-{s.student.first}{forfeitedIds.has(s.id) ? " · ส่วนกลาง" : ""}{s.origTeacher ? <span className="ml-1 rounded px-1 text-xs font-normal" style={{ background: "#FFF3D6", color: "#7A4B00" }}>แทน</span> : null}</div>
                            <div className="text-xs opacity-80">{s.course || s.student.course}{s.total ? ` (${s.n}/${s.total})` : ""}{teacherFilter === "all" || studentFilter !== "all" ? ` · ${s.teacher || s.student.teacher}` : ""}</div>
                          </button>
                        ))}
                      </td>
                    );
                  })}
                </tr>
              );
            })}
          </tbody>
        </table>
      </div>
      <p className="mt-2 text-xs text-slate-500">แตะชื่อนักเรียนเพื่อดูโปรไฟล์ · ลา · เปลี่ยนวัน · ต่อคอร์ส</p>
    </div>
  );
}

// ─── โปรไฟล์นักเรียน ────────────────────────────────────────────
function Profile({ student, sessions, info, rule, courses, teachers, onRemove, onDeleteSession, onDeleteRemaining, onDeletePurchase, needsSchedule, schedOpen, setSchedOpen, onSchedule, onTeacher, onShowSchedule, onExempt, onForce, onClose, onLeave, onChangeDate, onDone, onRenew }) {
  const [renewOpen, setRenewOpen] = useState(false);
  const [disc, setDisc] = useState(0);
  const [pickDate, setPickDate] = useState(null);
  const [confirmDel, setConfirmDel] = useState(false);
  const [newDate, setNewDate] = useState("");
  const [newTime, setNewTime] = useState("");

  // คอร์สทั้งหมดที่เด็กคนนี้มี (เด็กคนเดียวอาจเรียน 2–3 คอร์สพร้อมกัน)
  const courseList = useMemo(() => {
    const seen = [];
    sessions.forEach((x) => { if (x.course && !seen.includes(x.course)) seen.push(x.course); });
    if (student.course && !seen.includes(student.course)) seen.push(student.course);
    return seen;
  }, [sessions, student.course]);
  const defaultCourse = sessions.find((x) => !x.done && x.at >= today)?.course || sessions.at(-1)?.course || courseList[0] || "";
  const [activeCourse, setActiveCourse] = useState(defaultCourse);
  const cur = courseList.includes(activeCourse) ? activeCourse : courseList[0] || "";

  const inCourse = sessions.filter((x) => !cur || x.course === cur);
  const done = inCourse.filter((s) => s.done).length;
  const next = inCourse.find((s) => !s.done);
  const course = courses.find((c) => c.id === cur) || { name: cur || "ยังไม่มีคอร์ส" };
  const TIMES = []; for (let h = 8; h <= 22; h++) { TIMES.push(`${String(h).padStart(2, "0")}:00`); TIMES.push(`${String(h).padStart(2, "0")}:30`); }
  const openPicker = () => {
    if (!next) return;
    setNewDate(toInput(next.at));
    setNewTime(`${String(next.at.getHours()).padStart(2, "0")}:${next.at.getMinutes() < 30 ? "00" : "30"}`);
    setPickDate(next.id);
  };
  const teacher = teachers.find((t) => t.id === student.teacher) || { name: student.teacher || "-" };

  const links = [
    student.phone && { Icon: Phone, label: student.phone, href: "tel:" + student.phone.replace(/-/g, "") },
    student.line && { Icon: MessageCircle, label: "LINE: " + student.line, href: "https://line.me/ti/p/~" + student.line },
    student.fb && { Icon: Facebook, label: student.fb, href: "https://facebook.com/" + student.fb },
    student.ig && { Icon: Instagram, label: "@" + student.ig, href: "https://instagram.com/" + student.ig },
  ].filter(Boolean);

  return (
    <div className="fixed inset-0 z-20 flex items-end justify-center bg-black/40 sm:items-center sm:p-4" onClick={onClose}>
      <div className="w-full max-w-md overflow-y-auto rounded-t-2xl bg-white text-sm sm:rounded-2xl" style={{ maxHeight: "92vh" }} onClick={(e) => e.stopPropagation()}>
        <div className="px-4 pt-3 pb-3 text-white" style={{ background: BLUE }}>
          <div className="flex items-start justify-between">
            <div>
              <div className="text-xl font-extrabold leading-tight">{student.nick} <span className="text-sm font-normal text-white/85">{student.first} {student.last}</span></div>
              <div className="text-xs text-white/75">{teacher.name} · {student.cls || "เดี่ยว"} · {courseList.length} คอร์ส</div>
            </div>
            <button onClick={onClose} className="rounded-full bg-white/15 p-1.5"><X size={16} /></button>
          </div>

          {courseList.length > 0 && (
            <div className="mt-2 flex gap-1.5 overflow-x-auto pb-0.5">
              {courseList.map((c) => {
                const own = sessions.filter((x) => x.course === c);
                const dn = own.filter((x) => x.done).length;
                const on = c === cur;
                return (
                  <button key={c} onClick={() => setActiveCourse(c)} className="shrink-0 rounded-lg px-2.5 py-1 text-left text-xs leading-tight"
                    style={on ? { background: "#fff", color: BLUE } : { background: "rgba(255,255,255,.15)", color: "#fff" }}>
                    <div className="font-semibold">{c}</div>
                    <div style={{ opacity: .8 }}>เหลือ {own.length - dn}/{own.length}</div>
                  </button>
                );
              })}
            </div>
          )}

          <div className="mt-2 grid grid-cols-3 gap-1.5 text-center">
            {[[done, "เรียนแล้ว"], [inCourse.length - done, "เหลือ"], [`${student.certCount}/${CERT_TARGET}`, "คอร์สนับใบเซอร์"]].map(([n, l]) => (
              <div key={l} className="rounded-lg bg-white/15 py-1"><div className="text-base font-bold leading-tight">{n}</div><div className="text-xs text-white/80">{l}</div></div>
            ))}
          </div>
          {info?.forfeited.length > 0 && (
            <div className="mt-2 rounded-lg px-3 py-1.5 text-xs" style={{ background: "#FDE8E8", color: "#B42318" }}>
              <div className="font-semibold">ไม่มาเรียน {info.monthsIdle} เดือน (ล่าสุด {info.lastDone ? thDate(info.lastDone) : "-"})</div>
              <div>ยก {info.forfeited.length} คาบที่เหลือเข้าส่วนกลาง = {baht(info.amount)}</div>
            </div>
          )}
          {student.certCount >= CERT_TARGET && (
            <div className="mt-2 flex items-center gap-2 rounded-lg px-3 py-1.5 text-xs font-medium" style={{ background: "#FFE8B8", color: "#7A4B00" }}>
              <Award size={16} /> เรียนคอร์สทำเพลง/Mix & Mastering ครบ {CERT_TARGET} คอร์สแล้ว ส่งใบเซอร์ให้น้องได้เลย
            </div>
          )}
          {needsSchedule && (
            <button onClick={() => setSchedOpen(true)} className="mt-2 flex w-full items-center justify-between rounded-lg px-3 py-1.5 text-xs font-medium" style={{ background: "#FFF3D6", color: "#7A4B00" }}>
              <span>ยังไม่มีคาบเรียนล่วงหน้า</span><span className="font-semibold">จัดคาบเลย ›</span>
            </button>
          )}
        </div>

        <div className="px-4 py-3">
          {links.length === 0 && (
            <div className="rounded-xl px-3 py-2.5 text-sm text-slate-500" style={{ background: BLUE_SOFT }}>ยังไม่มีข้อมูลติดต่อ ส่งลิงก์สมัครให้น้องกรอกได้เลย</div>
          )}
          <div className="grid grid-cols-2 gap-1.5">
            {links.map(({ Icon, label, href }) => (
              <a key={label} href={href} target="_blank" rel="noreferrer"
                className="flex items-center gap-1.5 rounded-lg px-2.5 py-1.5 text-xs font-medium" style={{ background: BLUE_SOFT, color: BLUE }}>
                <Icon size={14} /> <span className="truncate">{label}</span>
              </a>
            ))}
          </div>

          <button onClick={onShowSchedule} className="mt-2 flex w-full items-center justify-center gap-1.5 rounded-lg py-1.5 text-xs font-semibold" style={{ background: BLUE_SOFT, color: BLUE }}>
            <CalendarDays size={14} /> ดูตารางเรียนของ {student.nick} ทั้งสัปดาห์
          </button>
          {!needsSchedule && !schedOpen && (
            <button onClick={() => setSchedOpen(true)} className="mt-1.5 w-full rounded-lg py-1.5 text-xs" style={{ background: "#fff", color: INK, border: "1px solid #D7E0F3" }}>+ จัดคาบเรียนเพิ่ม (คอร์สใหม่ / วันเวลาใหม่)</button>
          )}

          <div className="mt-2 grid grid-cols-3 gap-1.5">
            <button onClick={() => onLeave(cur)} disabled={!next} className="rounded-lg py-2 text-sm font-semibold text-white disabled:opacity-40" style={{ background: BLUE }}>ลา</button>
            <button onClick={openPicker} disabled={!next} className="rounded-lg py-2 text-sm font-semibold disabled:opacity-40" style={{ background: "#fff", color: BLUE, border: `2px solid ${BLUE}` }}>เปลี่ยนวัน/เวลา</button>
            <button onClick={() => setRenewOpen((v) => !v)} className="rounded-lg py-2 text-sm font-semibold text-white" style={{ background: INK }}>ต่อคอร์ส</button>
          </div>
          {next && <p className="mt-1 text-center text-xs text-slate-500">ปุ่มลา/เปลี่ยนวัน ใช้กับคาบถัดไป: {thDate(next.at)} {thTime(next.at)}</p>}

          {info?.remaining > 0 && (
            <div className="mt-2 flex gap-2">
              {info.forfeited.length > 0 ? (
                <button onClick={onExempt} className="flex-1 rounded-lg py-1.5 text-xs font-medium" style={{ background: "#fff", color: "#B42318", border: "1.5px solid #B42318" }}>
                  คืนคาบให้ (ไม่หักส่วนกลาง)
                </button>
              ) : (
                <button onClick={onForce} className="flex-1 rounded-lg py-1.5 text-xs font-medium" style={{ background: "#fff", color: "#64748B", border: "1.5px solid #CBD5E1" }}>
                  ยก {info.remaining} คาบเข้าส่วนกลางเลย
                </button>
              )}
              {student.exempt && (
                <button onClick={onExempt} className="rounded-xl px-3 py-2 text-xs" style={{ background: BLUE_SOFT, color: BLUE }}>ยกเลิกยกเว้น</button>
              )}
            </div>
          )}

          {pickDate && (
            <div className="mt-3 flex items-center gap-2 rounded-xl p-3" style={{ background: BLUE_SOFT }}>
              <span className="text-sm">เลือกวันใหม่</span>
              <input type="date" className="flex-1 rounded-lg border px-2 py-1.5 text-sm" onChange={(e) => { onChangeDate(pickDate, e.target.value); setPickDate(null); }} />
            </div>
          )}

          {renewOpen && (
            <div className="mt-2 rounded-lg p-2.5" style={{ background: BLUE_SOFT }}>
              <div className="mb-1.5 flex flex-wrap items-center gap-1 text-xs font-semibold">
                <span className="mr-1">ส่วนลด</span>
                {[0, 5, 10, 15, 20].map((v) => (
                  <button key={v} onClick={() => setDisc(v)} className="rounded-full px-2 py-0.5 font-medium"
                    style={disc === v ? { background: BLUE, color: "#fff" } : { background: "#fff", color: INK, border: "1px solid #D7E0F3" }}>{v ? `${v}%` : "ไม่ลด"}</button>
                ))}
                <input type="number" min="0" max="100" value={disc} onChange={(e) => setDisc(Math.min(100, Math.max(0, Number(e.target.value) || 0)))}
                  className="w-14 rounded-md px-1.5 py-0.5 text-right font-normal" style={{ ...font, border: "1px solid #D7E0F3" }} /> %
              </div>
              <div className="mb-1 text-xs font-semibold">เลือกคอร์ส</div>
              {courses.map((c) => {
                const p = Math.round((c.price || 0) * (1 - disc / 100));
                return (
                  <button key={c.id} onClick={() => { onRenew(c.id, disc); setRenewOpen(false); }}
                    className="mb-1 flex w-full items-center justify-between rounded-md bg-white px-2.5 py-1.5 text-left text-xs">
                    <span className="font-medium">{c.name}{c.cert ? " ★" : ""}</span>
                    <span className="text-slate-500">{c.sessions} คาบ · {disc ? <><s className="opacity-60">{baht(c.price)}</s> {baht(p)}</> : baht(c.price)}</span>
                  </button>
                );
              })}
            </div>
          )}

          {schedOpen && <SchedulePanel student={student} sessions={sessions} courses={courses} teachers={teachers.filter((t) => t.status === "Active")} onSubmit={onSchedule} onClose={() => setSchedOpen(false)} />}

          {student.purchases?.length > 0 && (
            <>
              <h3 className="mb-1 mt-3 text-xs font-semibold text-slate-600">คอร์สที่ซื้อ ({student.purchases.length} ครั้ง)</h3>
              <div className="overflow-hidden rounded-xl" style={{ border: "1px solid #D7E0F3" }}>
                {student.purchases.map((b, i) => (
                  <div key={i} className="flex items-center px-2.5 py-1 text-xs" style={i ? { borderTop: "1px solid #EEF2FA" } : {}}>
                    <div className="flex-1"><span className="font-medium">{b.course}</span><span className="text-slate-500"> · {b.date} · {b.teacher} · {b.total} คาบ{b.time ? ` · ${b.time}` : ""}{b.discount ? ` · ลด ${b.discount}%` : ""}</span></div>
                    <div className="font-semibold">{b.price ? baht(b.price) : "-"}</div>
                    <button onClick={() => onDeletePurchase(i)} className="ml-2 text-slate-300 hover:text-red-600" title="ลบรายการซื้อนี้"><X size={14} /></button>
                  </div>
                ))}
              </div>
            </>
          )}
          <div className="mb-1 mt-3 flex items-center justify-between">
            <h3 className="text-xs font-semibold text-slate-600">ประวัติคาบเรียน · {cur || "ทุกคอร์ส"} ({inCourse.length} คาบ)</h3>
            {inCourse.some((x) => !x.done) && (
              <button onClick={() => { if (window.confirm(`ลบคาบที่ยังไม่เรียนของ ${cur} ทั้งหมด ${inCourse.filter((x) => !x.done).length} คาบ?`)) onDeleteRemaining(cur); }}
                className="text-xs" style={{ color: "#B42318" }}>ลบคาบที่ยังไม่เรียนทั้งหมด</button>
            )}
          </div>
          <div className="overflow-hidden rounded-xl" style={{ border: "1px solid #D7E0F3" }}>
            {inCourse.map((s, i) => (
              <div key={s.id} className="flex items-center gap-2 px-2.5 py-1 text-xs" style={i ? { borderTop: "1px solid #EEF2FA" } : {}}>
                <input type="checkbox" checked={s.done} onChange={() => onDone(s.id)} className="h-3.5 w-3.5 shrink-0" />
                <span className={"flex min-w-0 flex-1 flex-wrap items-center gap-x-1.5 " + (s.done ? "text-slate-400" : "")}>
                  <span className="whitespace-nowrap">{s.n || i + 1}{s.total ? `/${s.total}` : ""} · {thDate(s.at)} {s.noTime ? "" : thTime(s.at)}</span>
                  <span className="flex items-center gap-1 text-xs">
                    <select value={s.teacher || ""} onChange={(e) => onTeacher(s.id, e.target.value)}
                      className="rounded px-1 py-0" style={{ ...font, border: "1px solid #D7E0F3", background: s.origTeacher ? "#FFF3D6" : "#fff", color: INK }}>
                      <option value="">— ครู —</option>
                      {teachers.map((t) => <option key={t.id} value={t.id}>{t.name}</option>)}
                    </select>
                    {s.origTeacher && <span className="rounded px-1" style={{ background: "#FFF3D6", color: "#7A4B00" }}>สอนแทน {s.origTeacher}</span>}
                  </span>
                  {s.score && <span className="rounded px-1 text-xs" style={{ background: "#FFF3D6", color: "#7A4B00" }}>{s.score}</span>}
                  {s.note && <span className="w-full text-xs text-slate-400">{s.note}</span>}
                </span>
                {s.absent && <span className="shrink-0 rounded-full px-1.5 py-0 text-xs" style={{ background: "#FDE8E8", color: "#B42318" }}>ขาด</span>}
                {s === next && <span className="shrink-0 rounded-full px-1.5 py-0 text-xs font-medium text-white" style={{ background: BLUE }}>ถัดไป</span>}
                {!s.done && (
                  <button onClick={() => { setNewDate(toInput(s.at)); setNewTime(`${String(s.at.getHours()).padStart(2, "0")}:${s.at.getMinutes() < 30 ? "00" : "30"}`); setPickDate(s.id); window.scrollTo?.(0, 0); }}
                    className="shrink-0 rounded px-1.5 py-0 text-xs" style={{ background: BLUE_SOFT, color: BLUE }}>เลื่อน</button>
                )}
                {!s.done && <button onClick={() => onDeleteSession(s.id)} className="shrink-0 text-slate-300 hover:text-red-600" title="ลบคาบนี้"><X size={13} /></button>}
              </div>
            ))}
          </div>

          <div className="mt-4 text-right">
            {!confirmDel ? (
              <button onClick={() => setConfirmDel(true)} className="text-xs text-slate-400 underline">ลบนักเรียนคนนี้</button>
            ) : (
              <div className="rounded-lg p-2.5 text-xs" style={{ background: "#FDE8E8", color: "#B42318" }}>
                ลบ {student.nick}-{student.first} และคาบเรียน {sessions.length} คาบทั้งหมด? ย้อนกลับไม่ได้
                <div className="mt-1.5 flex justify-end gap-2">
                  <button onClick={() => setConfirmDel(false)} className="rounded-md bg-white px-3 py-1" style={{ border: "1px solid #D7E0F3", color: INK }}>ยกเลิก</button>
                  <button onClick={onRemove} className="rounded-md px-3 py-1 font-semibold text-white" style={{ background: "#B42318" }}>ลบเลย</button>
                </div>
              </div>
            )}
          </div>
        </div>
      </div>
    </div>
  );
}
// ─── จัดคาบเรียนใหม่ ──────────────────────────────────────────────
function SchedulePanel({ student, sessions, courses, teachers, onSubmit, onClose }) {
  const lastBuy = student.purchases?.at(-1);
  const lastSess = [...sessions].sort((a, b) => a.at - b.at).at(-1);
  const guessCourse = lastBuy?.course || student.course || courses[0]?.id || "";
  const [course, setCourse] = useState(guessCourse);
  const [teacher, setTeacher] = useState(lastBuy?.teacher || student.teacher || teachers[0]?.id || "");
  const nextWeek = new Date(today); nextWeek.setDate(nextWeek.getDate() + ((7 - nextWeek.getDay() + (lastSess ? lastSess.at.getDay() : nextWeek.getDay())) % 7 || 7));
  const [date, setDate] = useState(toInput(lastSess && lastSess.at >= today ? lastSess.at : nextWeek));
  const [time, setTime] = useState(lastBuy?.time || (lastSess && !lastSess.noTime ? `${String(lastSess.at.getHours()).padStart(2, "0")}:${lastSess.at.getMinutes() < 30 ? "00" : "30"}` : "18:00"));
  const cInfo = courses.find((c) => c.id === course);
  const logged = sessions.filter((x) => x.course === course).length;
  const bought = student.purchases?.filter((b) => b.course === course).reduce((a, b) => a + (b.total || 0), 0) || 0;
  const suggested = Math.max(1, bought - logged || cInfo?.sessions || 4);
  const [count, setCount] = useState(suggested);
  useEffect(() => { setCount(suggested); }, [course]);
  const TIMES = []; for (let h = 8; h <= 22; h++) { TIMES.push(`${String(h).padStart(2, "0")}:00`); TIMES.push(`${String(h).padStart(2, "0")}:30`); }
  const sel = { ...font, border: "1px solid #D7E0F3" };
  return (
    <div className="mt-2 rounded-lg p-2.5" style={{ background: "#FFF3D6", border: "1px solid #F5D488" }}>
      <div className="mb-1.5 flex items-center justify-between text-xs font-semibold" style={{ color: "#7A4B00" }}>
        <span>จัดคาบเรียนให้ {student.nick}</span>
        <button onClick={onClose} className="opacity-60"><X size={14} /></button>
      </div>
      <div className="grid grid-cols-2 gap-1.5 text-xs">
        <label className="col-span-2">คอร์ส
          <select value={course} onChange={(e) => setCourse(e.target.value)} className="mt-0.5 w-full rounded-md px-2 py-1" style={sel}>
            {courses.map((c) => <option key={c.id} value={c.id}>{c.name}{c.cert ? " ★" : ""}</option>)}
          </select>
        </label>
        <label>ครู
          <select value={teacher} onChange={(e) => setTeacher(e.target.value)} className="mt-0.5 w-full rounded-md px-2 py-1" style={sel}>
            {teachers.map((t) => <option key={t.id} value={t.id}>{t.name}</option>)}
          </select>
        </label>
        <label>จำนวนคาบ
          <input type="number" min="1" max="30" value={count} onChange={(e) => setCount(Math.max(1, Number(e.target.value) || 1))} className="mt-0.5 w-full rounded-md px-2 py-1" style={sel} />
        </label>
        <label>เริ่มวันที่
          <input type="date" value={date} onChange={(e) => setDate(e.target.value)} className="mt-0.5 w-full rounded-md px-2 py-1" style={sel} />
        </label>
        <label>เวลา
          <select value={time} onChange={(e) => setTime(e.target.value)} className="mt-0.5 w-full rounded-md px-2 py-1" style={sel}>
            {TIMES.map((t) => <option key={t} value={t}>{t} น.</option>)}
          </select>
        </label>
      </div>
      <div className="mt-1.5 text-xs" style={{ color: "#7A4B00" }}>
        {bought > 0 ? `ซื้อคอร์สนี้ไว้ ${bought} คาบ ลงตารางแล้ว ${logged} คาบ` : "ยังไม่มีประวัติซื้อคอร์สนี้"} · จะสร้าง {count} คาบ สัปดาห์ละครั้ง วัน{DAY_TH[(new Date(date + "T00:00:00").getDay() + 6) % 7] || ""} เวลา {time}
        {cInfo?.cert && " · ★ นับใบเซอร์"}
      </div>
      <button onClick={() => date && onSubmit({ course, teacher, date, time, count })} className="mt-2 w-full rounded-lg py-2 text-sm font-semibold text-white" style={{ background: BLUE }}>บันทึกลงตาราง</button>
    </div>
  );
}

// ─── หลังบ้าน ────────────────────────────────────────────────────
function Admin({ students, sessions, courses, setCourses, teachers, onAddTeacher, onRemoveTeacher, pool, rule, setRule, onPick, say }) {
  const ymOf = (x) => `${x.getFullYear()}-${String(x.getMonth() + 1).padStart(2, "0")}`;
  const months = [...new Set([...sessions.map((s) => ymOf(s.at)), ...PURCHASES.map((b) => b.date.slice(0, 7))])].sort().reverse();
  const [ym, setYm] = useState(ymOf(today));
  const inMonth = sessions.filter((s) => s.done && ymOf(s.at) === ym);
  const rateOf = (course) => courses.find((c) => c.id === course)?.rate ?? 400;

  const payroll = teachers.map((t) => {
    const mine = inMonth.filter((s) => s.teacher === t.id);
    return { ...t, taught: mine.length, pay: mine.reduce((a, s) => a + rateOf(s.course), 0) };
  }).filter((t) => t.taught > 0 || t.status === "Active");

  const buys = PURCHASES.filter((b) => b.date.slice(0, 7) === ym && b.status === "Confirmed");
  const revenue = buys.reduce((a, b) => a + (b.price || 0), 0);
  const courseCost = buys.reduce((a, b) => a + (courses.find((c) => c.id === b.course)?.cost || 0), 0);
  const salary = payroll.reduce((a, t) => a + t.pay, 0);
  const profit = revenue - courseCost - salary;

  const editCourse = (id, patch) => setCourses((all) => all.map((c) => (c.id === id ? { ...c, ...patch } : c)));
  const addCourse = () => {
    const id = "new-" + Date.now();
    setCourses((all) => [...all, { id, name: "คอร์สใหม่", sessions: 4, price: 0, cost: 0, rate: 400, cert: false, discount: 0 }]);
    say("เพิ่มคอร์สแล้ว แก้ชื่อและราคาได้เลย");
  };
  const removeCourse = (id) => {
    if (sessions.some((x) => x.course === id) || PURCHASES.some((b) => b.course === id)) { say("คอร์สนี้มีประวัติการเรียนอยู่ ลบไม่ได้"); return; }
    setCourses((all) => all.filter((c) => c.id !== id));
  };

  const lost = students.map((st) => ({ st, ...pool.get(st.id) })).filter((x) => x.forfeited.length > 0);
  const poolTotal = lost.reduce((a, x) => a + x.amount, 0);

  return (
    <div className="space-y-5">
      <section className="rounded-2xl p-5 text-white" style={{ background: BLUE }}>
        <div className="flex flex-wrap items-center gap-2 text-sm text-white/80">สรุปเดือน
          <select value={ym} onChange={(e) => setYm(e.target.value)} className="rounded-lg px-2 py-1 text-sm" style={{ ...font, background: "rgba(255,255,255,.15)", color: "#fff" }}>
            {months.map((m) => <option key={m} value={m} style={{ color: INK }}>{m}</option>)}
          </select>
          · สอนแล้ว {inMonth.length} คาบ · ขายคอร์ส {buys.length} รายการ
        </div>
        <div className="mt-1 text-3xl font-extrabold">{baht(profit)}</div>
        <div className="text-sm text-white/80">รายได้คอร์ส − ต้นทุนคอร์ส − ค่าสอนครู</div>
        <div className="mt-4 grid grid-cols-3 gap-2 text-center text-sm">
          {[[revenue, "รายได้คอร์สที่ขาย"], [courseCost, "ต้นทุนคอร์ส"], [salary, "ค่าสอนครู"]].map(([n, l]) => (
            <div key={l} className="rounded-xl bg-white/15 py-2"><div className="font-bold">{baht(n)}</div><div className="text-xs text-white/80">{l}</div></div>
          ))}
        </div>
      </section>

      <section>
        <h2 className="mb-2 text-sm font-semibold" style={{ color: BLUE }}>เงินเดือนครู — คิดจากคาบที่สอนจริง × ค่าสอนต่อคาบของคอร์สนั้น</h2>
        <div className="overflow-hidden rounded-2xl bg-white" style={{ border: "1px solid #D7E0F3" }}>
          {payroll.map((t, i) => (
            <div key={t.id} className="flex items-center px-4 py-3" style={i ? { borderTop: "1px solid #EEF2FA" } : {}}>
              <div className="flex-1"><div className="font-semibold">{t.name}</div><div className="text-xs text-slate-500">สอนแล้ว {t.taught} คาบ</div></div>
              <div className="font-bold" style={{ color: BLUE }}>{baht(t.pay)}</div>
            </div>
          ))}
        </div>
      </section>

      <TeacherEditor teachers={teachers} sessions={sessions} onAdd={onAddTeacher} onRemove={onRemoveTeacher} />

      <section className="rounded-2xl bg-white p-4" style={{ border: "1px solid #D7E0F3" }}>
        <div className="flex items-start justify-between gap-3">
          <div>
            <div className="text-sm text-slate-500">ส่วนกลาง (คาบที่เด็กหายไปแล้วไม่ได้ใช้)</div>
            <div className="text-2xl font-extrabold" style={{ color: "#B42318" }}>{baht(poolTotal)}</div>
            <div className="text-xs text-slate-500">{lost.reduce((a, x) => a + x.forfeited.length, 0)} คาบ จาก {lost.length} คน</div>
          </div>
          <div className="text-right text-xs text-slate-500">
            <label className="block">ไม่มาเกิน
              <input type="number" min="1" value={rule.months} onChange={(e) => setRule({ ...rule, months: Number(e.target.value) || 1 })}
                className="mx-1 w-12 rounded border px-1 py-0.5 text-center text-sm" style={font} /> เดือน
            </label>
            <label className="mt-1 block">คาบละ
              <input type="number" min="0" step="50" value={rule.perSession} onChange={(e) => setRule({ ...rule, perSession: Number(e.target.value) || 0 })}
                className="mx-1 w-16 rounded border px-1 py-0.5 text-center text-sm" style={font} /> บาท
            </label>
          </div>
        </div>
        {lost.length > 0 && (
          <div className="mt-3 max-h-72 overflow-auto rounded-xl" style={{ border: "1px solid #EEF2FA" }}>
            {lost.map((x, i) => (
              <button key={x.st.id} onClick={() => onPick(x.st.id)} className="flex w-full items-center px-3 py-2 text-left text-sm" style={i ? { borderTop: "1px solid #EEF2FA" } : {}}>
                <div className="flex-1">
                  <div className="font-medium">{x.st.nick}-{x.st.first} <span className="text-xs text-slate-400">#{x.st.id}</span></div>
                  <div className="text-xs text-slate-500">ล่าสุด {x.lastDone ? thDate(x.lastDone) : "-"} · หาย {x.monthsIdle} เดือน · เหลือ {x.forfeited.length} คาบ{x.st.forced ? " · ยกเอง" : ""}</div>
                </div>
                <div className="font-semibold" style={{ color: "#B42318" }}>{baht(x.amount)}</div>
              </button>
            ))}
          </div>
        )}
      </section>

      <section>
        <div className="mb-2 flex items-center justify-between">
          <h2 className="text-sm font-semibold" style={{ color: BLUE }}>ตั้งค่าคอร์ส — แก้ได้ทุกช่อง</h2>
          <button onClick={addCourse} className="rounded-full px-3 py-1 text-sm font-medium text-white" style={{ background: BLUE }}>+ เพิ่มคอร์ส</button>
        </div>
        <div className="overflow-auto rounded-2xl bg-white" style={{ border: "1px solid #D7E0F3" }}>
          <table className="w-full text-sm" style={{ minWidth: 560 }}>
            <thead>
              <tr className="text-left text-xs text-slate-500" style={{ background: "#F4F7FD" }}>
                <th className="px-3 py-2">ชื่อคอร์ส</th><th className="px-2 py-2 text-center">ใบเซอร์</th><th className="px-2 py-2">คาบ</th><th className="px-2 py-2">ราคาขาย</th><th className="px-2 py-2">ต้นทุน</th><th className="px-2 py-2">ค่าสอน/คาบ</th><th className="px-2 py-2">กำไร/คอร์ส</th><th></th>
              </tr>
            </thead>
            <tbody>
              {courses.map((c) => {
                const margin = (c.price || 0) - (c.cost || 0) - (c.sessions || 0) * (c.rate || 0);
                const num = (key, w = 80, step = 1) => (
                  <input type="number" step={step} value={c[key] ?? 0} onChange={(e) => editCourse(c.id, { [key]: Number(e.target.value) || 0 })}
                    className="rounded-md px-2 py-1 text-right" style={{ ...font, width: w, border: "1px solid #D7E0F3" }} />
                );
                return (
                  <tr key={c.id} style={{ borderTop: "1px solid #EEF2FA" }}>
                    <td className="px-3 py-1.5">
                      <input value={c.name} onChange={(e) => editCourse(c.id, { name: e.target.value })}
                        className="w-full rounded-md px-2 py-1 font-medium" style={{ ...font, border: "1px solid #D7E0F3", minWidth: 170 }} />
                    </td>
                    <td className="px-2 py-1.5 text-center">
                      <input type="checkbox" checked={!!c.cert} onChange={(e) => editCourse(c.id, { cert: e.target.checked })} className="h-4 w-4" title="นับเป็นคอร์สที่ให้ใบเซอร์" />
                    </td>
                    <td className="px-2 py-1.5">{num("sessions", 56)}</td>
                    <td className="px-2 py-1.5">{num("price", 90, 50)}</td>
                    <td className="px-2 py-1.5">{num("cost", 80, 50)}</td>
                    <td className="px-2 py-1.5">{num("rate", 70, 50)}</td>
                    <td className="px-2 py-1.5 text-right font-semibold" style={{ color: margin >= 0 ? "#1B7A3A" : "#B42318" }}>{baht(margin)}</td>
                    <td className="px-2 py-1.5"><button onClick={() => removeCourse(c.id)} className="text-slate-400 hover:text-red-600" title="ลบ"><X size={16} /></button></td>
                  </tr>
                );
              })}
            </tbody>
          </table>
        </div>
        <p className="mt-2 text-xs text-slate-500">ติ๊ก "ใบเซอร์" = คอร์สนี้นับรวมใน {CERT_TARGET} คอร์สเพื่อออกใบเซอร์ · ส่วนลดเลือกตอนกดต่อคอร์สในโปรไฟล์เด็ก · ต้นทุน = ค่าใช้จ่ายอื่นต่อคอร์ส (เช่น อุปกรณ์ ค่าที่) ไม่รวมค่าสอนครู · กำไร/คอร์ส = ราคาขาย − ต้นทุน − (คาบ × ค่าสอน)</p>
      </section>
    </div>
  );
}


// ─── จัดการครู ────────────────────────────────────────────────────
function TeacherEditor({ teachers, sessions, onAdd, onRemove }) {
  const [name, setName] = useState("");
  return (
    <section>
      <div className="mb-2 flex items-center justify-between gap-2">
        <h2 className="text-sm font-semibold" style={{ color: BLUE }}>ครูผู้สอน</h2>
        <div className="flex gap-1.5">
          <input value={name} onChange={(e) => setName(e.target.value)} onKeyDown={(e) => { if (e.key === "Enter") { onAdd(name); setName(""); } }}
            placeholder="ชื่อครูใหม่" className="rounded-full px-3 py-1 text-sm" style={{ ...font, border: "1px solid #D7E0F3", width: 140 }} />
          <button onClick={() => { onAdd(name); setName(""); }} className="rounded-full px-3 py-1 text-sm font-medium text-white" style={{ background: BLUE }}>+ เพิ่มครู</button>
        </div>
      </div>
      <div className="overflow-hidden rounded-2xl bg-white" style={{ border: "1px solid #D7E0F3" }}>
        {teachers.map((t, i) => {
          const n = sessions.filter((x) => x.teacher === t.id).length;
          const off = t.status !== "Active";
          return (
            <div key={t.id} className="flex items-center gap-3 px-4 py-2.5 text-sm" style={i ? { borderTop: "1px solid #EEF2FA" } : {}}>
              <div className="flex-1">
                <span className={"font-semibold " + (off ? "text-slate-400 line-through" : "")}>{t.name}</span>
                <span className="ml-2 text-xs text-slate-500">{n ? `สอนแล้ว ${n} คาบ` : "ยังไม่มีคาบ"}{off ? " · พักการสอน" : ""}</span>
              </div>
              <button onClick={() => onRemove(t.id)} className="rounded-md px-2.5 py-1 text-xs"
                style={n ? { background: "#EEF2FA", color: INK } : { background: "#FDE8E8", color: "#B42318" }}>
                {n ? (off ? "เปิดใช้งาน" : "พักการสอน") : "ลบ"}
              </button>
            </div>
          );
        })}
      </div>
      <p className="mt-1.5 text-xs text-slate-500">ครูที่มีประวัติสอนแล้วจะลบไม่ได้ (เพื่อไม่ให้เงินเดือนย้อนหลังหาย) แต่กด "พักการสอน" ให้หายจากตัวเลือกในตารางได้</p>
    </section>
  );
}

// ─── รายชื่อนักเรียน ──────────────────────────────────────────────
function StudentsTab({ students, sessions, pool, onPick, onAdd }) {
  const [filter, setFilter] = useState("active");
  const [q, setQ] = useState("");
  const [adding, setAdding] = useState(false);
  const [f, setF] = useState({ nick: "", first: "", last: "", phone: "", line: "", fb: "", ig: "" });
  const field = (k, ph) => <input value={f[k]} onChange={(e) => setF({ ...f, [k]: e.target.value })} placeholder={ph} className="rounded-md px-2 py-1 text-sm" style={{ ...font, border: "1px solid #D7E0F3" }} />;
  const cutoff = new Date(today); cutoff.setMonth(cutoff.getMonth() - 3);
  const statusOf = (st) => {
    const own = sessions.filter((x) => x.studentId === st.id);
    const done = own.filter((x) => x.done);
    const remaining = own.filter((x) => !x.done);
    const upcoming = remaining.some((x) => x.at >= today);
    const lastDone = done.length ? new Date(Math.max(...done.map((x) => x.at))) : null;
    if (upcoming || (lastDone && lastDone >= cutoff && remaining.length > 0)) return "active";
    if (remaining.length === 0 && own.length > 0) return "finished";
    return "gone";
  };
  const list = students
    .map((st) => ({ st, status: statusOf(st), done: sessions.filter((x) => x.studentId === st.id && x.done).length, total: sessions.filter((x) => x.studentId === st.id).length }))
    .filter((x) => filter === "all" || x.status === filter)
    .filter((x) => !q || `${x.st.id} ${x.st.nick} ${x.st.first} ${x.st.last}`.toLowerCase().includes(q.toLowerCase()));
  const counts = { active: 0, finished: 0, gone: 0 };
  students.forEach((st) => counts[statusOf(st)]++);

  return (
    <div>
      <div className="mb-3 flex flex-wrap gap-2">
        {[["active", `กำลังเรียน ${counts.active}`], ["finished", `เรียนจบแล้ว ${counts.finished}`], ["gone", `หายไป ${counts.gone}`], ["all", `ทั้งหมด ${students.length}`]].map(([k, l]) => (
          <button key={k} onClick={() => setFilter(k)} className="rounded-full px-3 py-1.5 text-sm font-medium"
            style={filter === k ? { background: BLUE, color: "#fff" } : { background: "#fff", color: INK, border: "1px solid #D7E0F3" }}>{l}</button>
        ))}
        <input value={q} onChange={(e) => setQ(e.target.value)} placeholder="ค้นหาชื่อ / รหัส" className="ml-auto rounded-full px-3 py-1.5 text-sm" style={{ ...font, border: "1px solid #D7E0F3", minWidth: 160 }} />
        <button onClick={() => setAdding((v) => !v)} className="rounded-full px-3 py-1.5 text-sm font-medium text-white" style={{ background: BLUE }}>+ เพิ่มนักเรียน</button>
      </div>
      {adding && (
        <div className="mb-3 rounded-2xl bg-white p-3" style={{ border: "1px solid #D7E0F3" }}>
          <div className="mb-2 text-sm font-semibold" style={{ color: BLUE }}>เพิ่มนักเรียนใหม่ (หรือส่งลิงก์สมัครให้กรอกเองก็ได้)</div>
          <div className="grid grid-cols-2 gap-1.5 sm:grid-cols-4">
            {field("nick", "ชื่อเล่น *")}{field("first", "ชื่อจริง")}{field("last", "นามสกุล")}{field("phone", "เบอร์โทร")}
            {field("line", "LINE ID")}{field("fb", "Facebook")}{field("ig", "Instagram")}
            <button onClick={() => { if (!f.nick.trim()) return; const id = onAdd(f); setF({ nick: "", first: "", last: "", phone: "", line: "", fb: "", ig: "" }); setAdding(false); setFilter("all"); setQ(id); }}
              className="rounded-md py-1 text-sm font-semibold text-white" style={{ background: BLUE }}>บันทึก</button>
          </div>
        </div>
      )}
      <div className="overflow-hidden rounded-2xl bg-white" style={{ border: "1px solid #D7E0F3" }}>
        {list.length === 0 && <p className="py-8 text-center text-sm text-slate-500">ไม่พบนักเรียน</p>}
        {list.map(({ st: s, status, done, total }, i) => (
          <button key={s.id} onClick={() => onPick(s.id)} className="flex w-full items-center gap-3 px-4 py-3 text-left" style={i ? { borderTop: "1px solid #EEF2FA" } : {}}>
            <div className="flex h-10 w-10 shrink-0 items-center justify-center rounded-full font-bold" style={{ background: BLUE_SOFT, color: BLUE }}>{s.nick[0]}</div>
            <div className="min-w-0 flex-1">
              <div className="truncate font-semibold">{s.nick} <span className="font-normal text-slate-500">{s.first} {s.last}</span></div>
              <div className="truncate text-xs text-slate-500">#{s.id} · {s.teacher || "-"} · {s.course || "-"} · เรียนแล้ว {done}/{total} · ต่อคอร์ส {s.renewCount} · ใบเซอร์ {s.certCount}/{CERT_TARGET}</div>
            </div>
            {pool.get(s.id)?.forfeited.length > 0 && (
              <span className="shrink-0 rounded-full px-2 py-0.5 text-xs font-medium" style={{ background: "#FDE8E8", color: "#B42318" }}>ส่วนกลาง {pool.get(s.id).forfeited.length}</span>
            )}
            {status === "finished" && <span className="shrink-0 rounded-full px-2 py-0.5 text-xs" style={{ background: "#EEF2FA", color: "#64748B" }}>จบแล้ว</span>}
            {s.certCount >= CERT_TARGET && <Award size={18} className="shrink-0" style={{ color: "#D98A00" }} />}
            <ChevronRight size={18} className="shrink-0 text-slate-400" />
          </button>
        ))}
      </div>
    </div>
  );
}

// ─── ลิงก์สมัคร + รายการรอรับเข้าระบบ ─────────────────────────────
function FormPreview({ say, onImport }) {
  const [copied, setCopied] = useState(false);
  const [regs, setRegs] = useState([]);
  const [loading, setLoading] = useState(true);
  const url = `${window.location.origin}/join`;
  const copy = () => { navigator.clipboard?.writeText(url); setCopied(true); setTimeout(() => setCopied(false), 1500); };
  const refresh = () => { setLoading(true); loadRegistrations().then(setRegs).catch((e) => { console.error(e); say("โหลดรายการสมัครไม่สำเร็จ (ยังไม่ได้รันตาราง registrations?)"); }).finally(() => setLoading(false)); };
  useEffect(() => { refresh(); }, []);
  const accept = async (r) => {
    const id = onImport({ nick: r.nick, first: r.first, last: r.last, phone: r.phone, line: r.line, fb: r.fb, ig: r.ig });
    try { await removeRegistration(r.id); } catch (e) { console.error(e); }
    setRegs((all) => all.filter((x) => x.id !== r.id));
    say(`รับ ${r.nick} เข้าระบบแล้ว (#${id})`);
  };
  const reject = async (r) => { try { await removeRegistration(r.id); } catch (e) { console.error(e); } setRegs((all) => all.filter((x) => x.id !== r.id)); say("ลบรายการแล้ว"); };
  return (
    <div className="space-y-4">
      <div className="rounded-2xl bg-white p-4" style={{ border: "1px solid #D7E0F3" }}>
        <div className="mb-1 text-sm font-semibold">ส่งลิงก์นี้ให้เด็กหลังจ่ายเงิน</div>
        <p className="mb-3 text-xs text-slate-500">เด็กกรอกเอง ไม่ต้องใส่รหัส ข้อมูลจะมารอในรายการด้านล่าง กด "รับเข้าระบบ" แล้วค่อยจัดคอร์ส วัน เวลา</p>
        <div className="flex items-center gap-2 rounded-xl px-3 py-2 text-sm" style={{ background: BLUE_SOFT, color: BLUE }}>
          <a href={url} target="_blank" rel="noreferrer" className="flex-1 truncate underline">{url}</a>
          <button onClick={copy} title="คัดลอก">{copied ? <Check size={16} /> : <Copy size={16} />}</button>
        </div>
        <div className="mt-2 flex gap-2">
          <a href={`https://line.me/R/share?text=${encodeURIComponent("ลงทะเบียนเรียนกับ Today What Todo ได้ที่นี่เลยครับ " + url)}`} target="_blank" rel="noreferrer"
            className="rounded-full px-3 py-1.5 text-xs font-medium text-white" style={{ background: "#06C755" }}>แชร์ทาง LINE</a>
          <a href={url} target="_blank" rel="noreferrer" className="rounded-full px-3 py-1.5 text-xs font-medium" style={{ background: "#fff", color: BLUE, border: `1px solid ${BLUE}` }}>เปิดดูหน้าฟอร์ม</a>
        </div>
      </div>

      <div className="rounded-2xl bg-white p-4" style={{ border: "1px solid #D7E0F3" }}>
        <div className="mb-2 flex items-center justify-between">
          <div className="text-sm font-semibold" style={{ color: BLUE }}>รอรับเข้าระบบ ({regs.length})</div>
          <button onClick={refresh} className="rounded-full px-3 py-1 text-xs" style={{ background: "#EEF2FA", color: INK }}>{loading ? "กำลังโหลด…" : "รีเฟรช"}</button>
        </div>
        {regs.length === 0 && !loading && <p className="py-4 text-center text-sm text-slate-500">ยังไม่มีคนสมัครใหม่</p>}
        <div className="space-y-2">
          {regs.map((r) => (
            <div key={r.id} className="rounded-xl p-3 text-sm" style={{ border: "1px solid #EEF2FA" }}>
              <div className="font-semibold">{r.nick} <span className="font-normal text-slate-500">{r.first} {r.last}</span></div>
              <div className="text-xs text-slate-500">{[r.phone && `โทร ${r.phone}`, r.line && `LINE ${r.line}`, r.fb && `FB ${r.fb}`, r.ig && `IG ${r.ig}`].filter(Boolean).join(" · ")}</div>
              {r.note && <div className="mt-1 rounded-lg px-2 py-1 text-xs" style={{ background: "#FFF3D6", color: "#7A4B00" }}>{r.note}</div>}
              <div className="mt-2 flex items-center gap-2">
                <span className="mr-auto text-xs text-slate-400">{new Date(r.created_at).toLocaleString("th-TH", { dateStyle: "short", timeStyle: "short" })}</span>
                <button onClick={() => reject(r)} className="rounded-md px-2.5 py-1 text-xs" style={{ background: "#FDE8E8", color: "#B42318" }}>ลบ</button>
                <button onClick={() => accept(r)} className="rounded-md px-3 py-1 text-xs font-semibold text-white" style={{ background: BLUE }}>รับเข้าระบบ</button>
              </div>
            </div>
          ))}
        </div>
      </div>
    </div>
  );
}
